{
  "metadata": {
    "component_name": "PMEG2010EPK",
    "manufacturer": "Nexperia",
    "key_specifications": "20 V reverse voltage, 1 A average forward current, low forward voltage <= 415 mV, low reverse current, ultra small SOD1608 (DFN1608D-2) SMD plastic package, package height typ. 0.37 mm, AEC-Q101 qualified",
    "applications": "Low voltage rectification, high efficiency DC-to-DC conversion, switch mode power supply, LED backlight for mobile application, low power consumption applications, ultra high-speed switching, reverse polarity protection",
    "grade": "B",
    "maker_pn": "PMEG2010EPK"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "1. General description\nPlanar Schottky barrier rectifier with an integrated guard ring for stress protection, encapsulated in a leadless ultra small SOD1608 (DFN1608D-2) Surface-Mounted Device (SMD) plastic package with visible and solderable side pads.\n\n2. Features and benefits\n• Average forward current: IF(AV) ≤ 1 A\n• Reverse voltage: VR ≤ 20 V\n• Low forward voltage VF ≤ 415 mV\n• Low reverse current\n• Solderable side pads\n• Package height typ. 0.37 mm\n• Ultra small and leadless SMD plastic package\n• AEC-Q101 qualified\n\n3. Applications\n• Low voltage rectification\n• High efficiency DC-to-DC conversion\n• Switch mode power supply\n• LED backlight for mobile application\n• Low power consumption applications\n• Ultra high-speed switching\n• Reverse polarity protection\n\n4. Quick reference data\n[Quick reference data table]",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 2,
      "categories": [
        "Packaging Information"
      ],
      "content": "5. Pinning information\n[Pinning information table]\n\n6. Ordering information\n[Ordering information table]\n\n7. Marking\n[Marking codes table and figure]",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 3,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "8. Limiting values\n[Limiting values table]\n\n9. Thermal characteristics\n[Thermal characteristics table]",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 4,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fig. 2. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values\n\nFig. 3. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values\n\nFig. 4. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 5,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Table 7. Characteristics\n\nVF forward voltage [...]\n\nIR reverse current [...]\n\nCd diode capacitance [...]\n\ntrr reverse recovery time [...]\n\nVFRM peak forward recovery voltage [...]",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 6,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fig. 7. Diode capacitance as a function of reverse voltage; typical values\n\nFig. 8. Average forward power dissipation as a function of average forward current; typical values\n\nFig. 9. Average reverse power dissipation as a function of reverse voltage; typical values\n\nFig. 10. Average forward current as a function of ambient temperature; typical values",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    },
    {
      "page_number": 10,
      "categories": [
        "Product Summary"
      ],
      "content": "Nexperia PMEG2010EPK\n20 V, 1 A low VF Schottky barrier rectifier",
      "grade": "B",
      "maker_pn": "PMEG2010EPK",
      "part number": "0404-001329"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "Planar Schottky barrier rectifier with an integrated guard ring for stress protection, encapsulated in a leadless ultra small SOD1608 (DFN1608D-2) Surface-Mounted Device (SMD) plastic package with visible and solderable side pads. Features include average forward current IF(AV) ≤ 1 A, reverse voltage VR ≤ 20 V, low forward voltage VF ≤ 415 mV, low reverse current, solderable side pads, and package height typically 0.37 mm.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "Ultra small and leadless SMD plastic package. AEC-Q101 qualified. Suitable for low voltage rectification, high efficiency DC-to-DC conversion, switch mode power supply, LED backlight for mobile applications, low power consumption applications, ultra high-speed switching, and reverse polarity protection.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "Nexperia PMEG2010EPK is a 20 V, 1 A low VF Schottky barrier rectifier with quick reference data including average forward current, reverse voltage, forward voltage, and other specifications.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "8. Limiting values [Limiting values table] 9. Thermal characteristics [Thermal characteristics table] Fig. 2. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values Fig. 3. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values Fig. 4. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "Table 7. Characteristics VF forward voltage [...] IR reverse current [...] Cd diode capacitance [...] trr reverse recovery time [...] VFRM peak forward recovery voltage [...]",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "Fig. 7. Diode capacitance as a function of reverse voltage; typical values Fig. 8. Average forward power dissipation as a function of average forward current; typical values Fig. 9. Average reverse power dissipation as a function of reverse voltage; typical values Fig. 10. Average forward current as a function of ambient temperature; typical values",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "8. Limiting values [Limiting values table] - This section provides information on the maximum and minimum ratings for various parameters such as voltages, currents, temperatures, and power dissipation that the component can withstand without permanent damage or degradation in performance. Exceeding these limits may cause permanent damage or failure of the component.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "9. Thermal characteristics [Thermal characteristics table] - This section details the thermal characteristics of the component, including parameters such as thermal resistance, maximum junction temperature, and power dissipation ratings. These specifications are crucial for ensuring proper thermal management and preventing overheating, which can lead to component failure or degraded performance.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "8. Limiting values [Limiting values table] 9. Thermal characteristics [Thermal characteristics table] - These sections collectively provide information on the environmental conditions and limits within which the component can operate reliably. The limiting values define the absolute maximum and minimum ratings for various parameters, while the thermal characteristics specify the thermal behavior and requirements for proper heat dissipation. Understanding and adhering to these specifications is essential for ensuring the component's reliability and longevity in the intended application.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      }
    ],
    "Packaging Information": [
      {
        "content": "5. Pinning information [Pinning information table] This section provides details on the pinout configuration and pin assignments for the electronic component, which is crucial for proper interfacing and integration.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "6. Ordering information [Ordering information table] This section lists the ordering codes, product identifiers, and other relevant information required for procurement and purchasing of the electronic component from the manufacturer or authorized distributors.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "7. Marking [Marking codes table and figure] This section describes the markings or labels present on the physical package of the electronic component, including manufacturer logos, part numbers, date codes, and other identification markers. The marking information aids in component traceability and authentication.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      },
      {
        "content": "Packaging Information for Electronic Components This section encompasses details related to the physical packaging, pinout configuration, ordering process, and marking specifications of an electronic component. It provides essential information for proper integration, procurement, and identification of the component.",
        "part number": "0404-001329.pdf",
        "grade": "B",
        "maker_pn": "PMEG2010EPK"
      }
    ]
  },
  "part number": "0404-001329"
}