{
  "metadata": {
    "component_name": "JW1120",
    "manufacturer": "JW (Likely a semiconductor company based on the component name)",
    "key_specifications": "4.5V to 20V operating input range, 2A output current, up to 94% efficiency, fixed 1MHz switching frequency, input under voltage lockout, start-up current run-away protection, LED short protection, thermal protection, available in TSOT23-6 and TSOT23-8 packages",
    "applications": "LED Driver",
    "grade": "F",
    "maker_pn": "JW1120"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "DESCRIPTION \nThe JW®1120 is a current mode monolithic buck LED driver. Operating with an input range of 4.5-20V, JW1120 delivers 2A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode. At light loads, the LED driver operates in low frequency to maintain high efficiency and low output ripple.\n\nThe JW1120 guarantees robustness with LED short protection, thermal protection, start-up current run-away protection, input under voltage lockout.\n\nThe JW1120 is available in 6-pin and 8-pin TSOT packages, which provide a compact solution with minimal external components.\n\nFEATURES\n- 4.5V to 20V operating input range\n- 2A output current\n- Up to 94% efficiency\n- High efficiency (>85%) at light load\n- Fixed 1MHz Switching frequency\n- Input under voltage lockout\n- Start-up current run-away protection\n- LED short protection\n- Thermal protection\n- Available in TSOT23-6 and TSOT23-8 packages\n\nAPPLICATIONS\n- LED Driver",
      "grade": "F",
      "maker_pn": "JW1120",
      "part number": "1003-005494"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The JW®1120 is a current mode monolithic buck LED driver operating with an input range of 4.5-20V and delivering 2A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without an external Schottky diode. At light loads, it operates in low frequency to maintain high efficiency and low output ripple.",
        "part number": "1003-005494.pdf",
        "grade": "F",
        "maker_pn": "JW1120"
      },
      {
        "content": "The JW1120 guarantees robustness with features like LED short protection, thermal protection, start-up current run-away protection, and input under voltage lockout. It is available in compact 6-pin and 8-pin TSOT packages with minimal external components.",
        "part number": "1003-005494.pdf",
        "grade": "F",
        "maker_pn": "JW1120"
      },
      {
        "content": "Key features of the JW1120 include 4.5V to 20V operating input range, 2A output current, up to 94% efficiency, high efficiency (>85%) at light load, fixed 1MHz switching frequency, input under voltage lockout, start-up current run-away protection, LED short protection, and thermal protection.",
        "part number": "1003-005494.pdf",
        "grade": "F",
        "maker_pn": "JW1120"
      },
      {
        "content": "The JW1120 is designed for LED driver applications, offering a compact and robust solution with features like high efficiency, wide input range, and various protection mechanisms.",
        "part number": "1003-005494.pdf",
        "grade": "F",
        "maker_pn": "JW1120"
      }
    ]
  },
  "part number": "1003-005494"
}