{
  "metadata": {
    "component_name": "RT8306",
    "manufacturer": "Not specified in the given text",
    "key_specifications": "48-CH high precision constant current LED driver, 12-bit PWM control, 48 flexible PWM generators, independent 12-bit PWM brightness control for each channel, 8-bit IDAC for LED peak current, 48 independent 8-bit DACs for boosting/decreasing LED current, 60mA maximum constant current sink per channel, ±2% current accuracy per channel, supports local and global dimming",
    "applications": "Timing scanning applications of LED backlight",
    "grade": "F",
    "maker_pn": "DS8306"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "The RT8306 is a 48-CH high precision constant current LED driver with 12-bit PWM control for the timing scanning applications of LED backlight. The RT8306 has 48 Channels flexible PWM generators and independent 12-bit PWM brightness were control LED current for every channel. Moreover, it has one global high accurate 8-bit IDAC which sets the LED peak current. And 48 independent 8-bit DACs can be used to boost or decrease LED Current for high dynamic range application. The constant current sink channels on the LED drivers are capable of sinking 60mA of current and its level can be set by register address 0561 [7:0] from 5mA to 60mA. The RT8306 provides ±2% high accuracy current each channel. It also supports the local dimming and global dimming by independent PWM generators with programmable PWM duty cycle, period and delay.",
      "grade": "F",
      "maker_pn": "DS8306",
      "part number": "1003-003429"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The RT8306 is a 48-CH high precision constant current LED driver with 12-bit PWM control for the timing scanning applications of LED backlight. It has 48 Channels flexible PWM generators and independent 12-bit PWM brightness control for LED current in every channel.",
        "part number": "1003-003429.pdf",
        "grade": "F",
        "maker_pn": "DS8306"
      },
      {
        "content": "The RT8306 features one global high accurate 8-bit IDAC which sets the LED peak current, and 48 independent 8-bit DACs that can boost or decrease LED Current for high dynamic range applications. The constant current sink channels can sink up to 60mA of current, adjustable from 5mA to 60mA.",
        "part number": "1003-003429.pdf",
        "grade": "F",
        "maker_pn": "DS8306"
      },
      {
        "content": "The RT8306 provides ±2% high accuracy current for each channel. It supports local dimming and global dimming through independent PWM generators with programmable PWM duty cycle, period, and delay.",
        "part number": "1003-003429.pdf",
        "grade": "F",
        "maker_pn": "DS8306"
      },
      {
        "content": "The RT8306 is a high precision LED driver with 48 channels, PWM control, adjustable current sinks, and dimming capabilities for LED backlight applications.",
        "part number": "1003-003429.pdf",
        "grade": "F",
        "maker_pn": "DS8306"
      }
    ]
  },
  "part number": "1003-003429"
}