{
  "metadata": {
    "component_name": "JW1123",
    "manufacturer": "N/A (not explicitly stated in the given text)",
    "key_specifications": "4.5V to 28V operating input range, 2A output current, up to 94% efficiency, 600kHz switching frequency, input under voltage lockout, start-up current run-away protection, LED short protection, thermal protection, SOT23-6 package",
    "applications": "IP camera and CCD camera, flash light, display cabinet lamp, general LED lighting",
    "grade": "F",
    "maker_pn": "JW1123"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "DESCRIPTION \nThe JW®1123 is a current mode monolithic buck LED driver. Operating with an input range of 4.5V-28V, JW1123 delivers 2A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode. It integrates PWM signal to analogy dimming mode to achieve dimmable LED lighting application. \nThe JW1123 guarantees robustness with LED short protection, thermal protection, start-up current run-away protection, input under voltage lockout.\n\nFEATURES\n- 4.5V to 28V Operating Input Range\n- 2A Output Current\n- Up to 94% Efficiency @ Vin=12V, Vout=6V, ILED=2A\n- 600kHz Switching Frequency\n- Input Under Voltage Lockout\n- Start-up Current Run-away Protection\n- LED Short Protection\n- Thermal Protection\n- Available in SOT23-6 Package\n\nAPPLICATIONS\n- IP camera and CCD camera\n- Flash light\n- Display cabinet lamp\n- General LED lighting",
      "grade": "F",
      "maker_pn": "JW1123",
      "part number": "1003-004749"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The JW®1123 is a current mode monolithic buck LED driver operating with an input range of 4.5V-28V and delivering 2A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode.",
        "part number": "1003-004749.pdf",
        "grade": "F",
        "maker_pn": "JW1123"
      },
      {
        "content": "The JW1123 integrates PWM signal to analogy dimming mode to achieve dimmable LED lighting application. It guarantees robustness with LED short protection, thermal protection, start-up current run-away protection, and input under voltage lockout.",
        "part number": "1003-004749.pdf",
        "grade": "F",
        "maker_pn": "JW1123"
      },
      {
        "content": "Key features of the JW1123 include 4.5V to 28V operating input range, 2A output current, up to 94% efficiency at Vin=12V, Vout=6V, ILED=2A, 600kHz switching frequency, input under voltage lockout, start-up current run-away protection, LED short protection, thermal protection, and availability in SOT23-6 package.",
        "part number": "1003-004749.pdf",
        "grade": "F",
        "maker_pn": "JW1123"
      },
      {
        "content": "The JW1123 is suitable for applications such as IP camera and CCD camera, flash light, display cabinet lamp, and general LED lighting.",
        "part number": "1003-004749.pdf",
        "grade": "F",
        "maker_pn": "JW1123"
      }
    ]
  },
  "part number": "1003-004749"
}