{
  "metadata": {
    "component_name": "NCR320PAS/NCR321PAS",
    "manufacturer": "NXP Semiconductors",
    "key_specifications": "Stabilized output current of 10 mA without external resistor, adjustable up to 250 mA with external resistor. High current accuracy at supply voltage variation. Low voltage overhead of 1.4 V. Supply voltage up to 16 V. Digital PWM input up to 10 kHz frequency for NCR321PAS. AEC-Q101 qualified.",
    "applications": "Constant current LED driver, generic constant current source, automotive applications (e.g. interior lighting, dashboard, instrumentation, number plate light)",
    "grade": "A",
    "maker_pn": "NCR320PAS"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "1.1.  General description\nLED driver consisting of resistor-equipped NPN transistor with two diodes on one chip in a leadless medium power DFN2020D-6 (SOT1118D) Surface-Mounted Device (SMD) plastic package with visible and solderable side pads.\n\n1.2.  Features and benefits\n• Stabilized output current of 10 mA without external resistor\n• Stabilized output current adjustable up to 250 mA when an external resistor is used\n• High current accuracy at supply voltage variation\n• Low voltage overhead of 1.4 V\n• Reduces component count and board space\n• High power dissipation of 530 mW\n• Supply voltage up to 16 V\n• Digital PWM input up to 10 kHz frequency for NCR321PAS\n• AEC-Q101 qualified\n\n1.3.  Applications\n• Constant current LED driver\n• Generic constant current source\n• Automotive applications (for example: interior lighting, dash board, instrumentation, number plate light)\n• Increase stabilized output current by paralleling drivers",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 2,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Table 2. Quick reference data\nSymbol Parameter Conditions Min Typ Max Unit\nenable voltage\nNCR320PAS - - 25 V\nVEN\nNCR321PAS - - 4.5 V\nVout output voltage - - 16 V\nstabilized output current\nNCR320PAS Vout = 1.4 V;\nVEN = 12 V\n[1] 9 10 11 mA\nIout\nNCR321PAS Vout = 1.4 V;\nVEN = 3.3 V\n[1] 9 10 11 mA\n\n[1] Pulse test: tp ≤ 300 µs; δ ≤ 0.02",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 3,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "Table 6. Limiting values\nIn accordance with the Absolute Maximum Rating System (IEC 60134).\nSymbol Parameter Conditions Min Max Unit\nIout stabilized output current if\nexternal resistor is used\n- 300 mA\nenable voltage\nNCR320PAS - 25 V\nVEN\nNCR321PAS - 4.5 V\nVout output voltage - 16 V\nVR reverse voltage [1] - 0.5 V\n[2] - 370 mW\n[3] - 570 mW\n[4] - 530 mW\nPtot total power dissipation Tamb ≤ 25 °C\n[5] - 700 mW\nTj junction temperature - 150 °C\nTamb ambient temperature -55 150 °C\nTstg storage temperature -65 150 °C\n\n[1] Between all terminals.\n[2] Device mounted on an FR4 Printed-Circuit Board (PCB), single-side copper, tin-plated and standard footprint.\n[3] Device mounted on an FR4 Printed-Circuit Board (PCB), single-side copper, tin-plated; mounting pad for collector 1 cm2.\n[4] Device mounted on an FR4 Printed-Circuit Board (PCB), 4-layer copper, tin-plated and standard footprint.\n[5] Device mounted on an FR4 Printed-Circuit Board (PCB), 4-layer copper, tin-plated; mounting pad for collector 1 cm2.",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 4,
      "categories": [
        "Thermal Characteristics"
      ],
      "content": "Table 7. Thermal characteristics\nSymbol Parameter Conditions Min Typ Max Unit\n[1] - - 338 K/W\n[2] - - 219 K/W\n[3] - - 236 K/W\nRth(j-a) thermal resistance from junction to ambient in free air\n[4] - - 179 K/W",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 5,
      "categories": [
        "Thermal Characteristics"
      ],
      "content": "Fig. 2. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values\n\nFig. 3. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values\n\nFig. 4. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values\n\nFig. 5. Transient thermal impedance from junction to ambient as a function of pulse duration; typical values",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 6,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Table 8. Characteristics\nTamb = 25 °C unless otherwise specified.\nSymbol Parameter Conditions Min Typ Max Unit\nV(BR)CEO collector-emitter breakdown voltage IC = 1 mA; IB = 0 A 16 - - V\nhFE DC current gain VCE =1 V; IC = 50 mA [1] 200 350 -\nRint internal resistor IRint = 10 mA 85 95 105 Ω\nVRint voltage drop at internal resistor Rint Iout = 10 mA [1] 0.85 0.95 1.05 V\nenable current NCR320PAS VEN = 12 V [1] - 1.2 - mA\nIEN NCR321PAS VEN = 3.3 V [1] - 1.2 - mA\nbias resistor NCR320PAS - 10 - kΩ\nRB NCR321PAS - 1.5 - kΩ\nstabilized output current NCR320PAS VEN = 12 V; Vout = 1.4 V [1] 9 10 11 mA\nIout NCR321PAS VEN = 3.3 V; Vout = 1.4 V [1] 9 10 11 mA\nstabilized output current NCR320PAS at Rext = 3 Ω VEN = 12 V; Vout > 1.4 V [1] - 250 - mA\nIout NCR321PAS at Rext = 3 Ω VEN = 3.3 V; Vout > 1.4 V [1] - 250 - mA\nVout, min lowest sufficient output voltage overhead: Vout = VCC - VLED Iout > 10 mA - 1.4 - V\nstabilized output current change over ambient temperature NCR320PAS VEN = 12 V; Vout > 2 V [1] - -0.27 - %/K\nΔIout/(Iout x ΔTamb) NCR321PAS VEN = 3.3 V; Vout > 2 V [1] - -0.27 - %/K\nstabilized output current change over supply voltage NCR320PAS VEN = 12 V; Vout > 2 V [1] - 1 - %/V\nΔIout/(Iout x ΔVCC) NCR321PAS VEN = 3.3 V; Vout > 2 V [1] - 1 - %/V",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 7,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fig. 6. NCR320PAS: Output current as a function of output voltage; typical values\nFig. 7. NCR320PAS: Output current as a function of external resistor; typical values\nFig. 8. NCR320PAS: Output current as a function of output voltage; typical values\nFig. 9. NCR320PAS: Output current as a function of output voltage; typical values",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 8,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fig. 10. NCR320PAS: Output current as a function of output voltage; typical values\nFig. 11. NCR320PAS: Output current as a function of enable voltage; typical values\nFig. 12. NCR320PAS: Output current as a function of enable voltage; typical values\nFig. 13. NCR320PAS: Output current as a function of enable voltage; typical values",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 9,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fig. 14. NCR320PAS: Output current as a function of enable voltage; typical values\nFig. 15. NCR320PAS: Enable current as a function of enable voltage; typical values\nFig. 16. NCR321PAS: Output current as a function of output voltage; typical values\nFig. 17. NCR321PAS: Output current as a function of external resistor; typical values",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 13,
      "categories": [
        "Application Circuits"
      ],
      "content": "To savely drive currents that are above the limits of the NCR32xPAS, two or more devices can be parallel connected as illustrated in Figure 28. When choosing the same values for the external resistors, the drive current splits equally and the capability of handling excess power is doubled. Both, NCR320PAS and NCR321PAS can be used in this configuration.",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 14,
      "categories": [
        "Packaging Information"
      ],
      "content": "DFN2020D-6: plastic, thermally enhanced ultra thin and small outline package; no leads; 6 terminals; body 2 x 2 x 0.65 mm SOT1118D",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 15,
      "categories": [
        "Packaging Information"
      ],
      "content": "Reflow soldering footprint for DFN2020D-6 (SOT1118D)",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    },
    {
      "page_number": 18,
      "categories": [
        "Product Summary"
      ],
      "content": "1. Product profile\n1.1. General description\n1.2. Features and benefits\n1.3. Applications\n2. Quick reference data\n3. Pinning information\n4. Ordering information\n5. Marking",
      "grade": "A",
      "maker_pn": "NCR320PAS",
      "part number": "1103-003498"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "LED driver consisting of resistor-equipped NPN transistor with two diodes on one chip in a leadless medium power DFN2020D-6 (SOT1118D) Surface-Mounted Device (SMD) plastic package with visible and solderable side pads. It features a stabilized output current of 10 mA without external resistor, adjustable up to 250 mA with an external resistor. It offers high current accuracy at supply voltage variation, low voltage overhead of 1.4 V, and reduces component count and board space.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The LED driver has a high power dissipation of 530 mW, supports supply voltage up to 16 V, and has a digital PWM input up to 10 kHz frequency for NCR321PAS model. It is AEC-Q101 qualified for automotive applications such as interior lighting, dash board, instrumentation, and number plate light. The output current can be increased by paralleling multiple drivers.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The product summary covers the general description, key features and benefits, and applications of the LED driver. It is a constant current source suitable for automotive and other applications requiring a stable and adjustable LED current.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "Table 2 provides quick reference data for key electrical parameters like enable voltage (VEN), output voltage (Vout), and stabilized output current (Iout) for the NCR320PAS and NCR321PAS devices under specific conditions. It includes typical and maximum values for these parameters.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "Table 6 lists the limiting values or absolute maximum ratings for various electrical parameters like stabilized output current (Iout), enable voltage (VEN), output voltage (Vout), reverse voltage (VR), total power dissipation (Ptot), junction temperature (Tj), ambient temperature (Tamb), and storage temperature (Tstg). These ratings must not be exceeded to ensure reliable operation.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "Table 8 provides detailed electrical characteristics such as collector-emitter breakdown voltage (V(BR)CEO), DC current gain (hFE), internal resistor (Rint) and its voltage drop (VRint), enable current (IEN), bias resistor (RB), stabilized output current (Iout) under different conditions like external resistor (Rext), lowest sufficient output voltage (Vout, min), output current change over temperature (ΔIout/(Iout x ΔTamb)) and supply voltage (ΔIout/(Iout x ΔVCC)). Typical, minimum, and maximum values are specified.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The text also mentions several figures (Fig. 6 to Fig. 17) that graphically illustrate the variation of output current (Iout) with respect to output voltage (Vout), external resistor (Rext), and enable voltage (VEN) for the NCR320PAS and NCR321PAS devices under typical conditions. Additionally, it includes a figure showing the variation of enable current (IEN) with enable voltage (VEN).",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      }
    ],
    "Application Circuits": [
      {
        "content": "To safely drive currents that are above the limits of the NCR32xPAS, two or more devices can be parallel connected as illustrated in Figure 28.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "When choosing the same values for the external resistors, the drive current splits equally and the capability of handling excess power is doubled.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "Both, NCR320PAS and NCR321PAS can be used in this parallel configuration to increase current handling capability.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The parallel connection of multiple NCR32xPAS devices allows for driving higher currents beyond the limits of a single device, by equally distributing the current and increasing the overall power handling capability.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "Table 6 provides limiting values for various parameters of the device under different conditions, in accordance with the Absolute Maximum Rating System (IEC 60134). It lists the maximum stabilized output current (Iout), enable voltage (VEN), output voltage (Vout), reverse voltage (VR), total power dissipation (Ptot), junction temperature (Tj), ambient temperature (Tamb), and storage temperature (Tstg) ranges.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The maximum stabilized output current (Iout) is 300 mA if an external resistor is used. The maximum enable voltage (VEN) is 25 V for NCR320PAS and 4.5 V for NCR321PAS. The maximum output voltage (Vout) is 16 V, and the maximum reverse voltage (VR) is 0.5 V between all terminals.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The maximum total power dissipation (Ptot) varies depending on the ambient temperature (Tamb) and the mounting conditions of the device on the Printed-Circuit Board (PCB). For example, when mounted on an FR4 PCB with a single-side copper layer and a standard footprint, the maximum Ptot is 370 mW at Tamb ≤ 25 °C. With a larger mounting pad for the collector (1 cm2), the maximum Ptot increases to 570 mW.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "The maximum junction temperature (Tj) is 150 °C. The ambient temperature (Tamb) range is -55 °C to 150 °C, and the storage temperature (Tstg) range is -65 °C to 150 °C.",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      }
    ],
    "Packaging Information": [
      {
        "content": "DFN2020D-6: plastic, thermally enhanced ultra thin and small outline package; no leads; 6 terminals; body 2 x 2 x 0.65 mm SOT1118D",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "DFN2020D-6 package details: plastic, thermally enhanced, ultra thin, small outline, no leads, 6 terminals, body dimensions 2 x 2 x 0.65 mm, SOT1118D package type",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "Reflow soldering footprint for DFN2020D-6 (SOT1118D)",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      },
      {
        "content": "DFN2020D-6 (SOT1118D) package: plastic, thermally enhanced, ultra thin, small outline, no leads, 6 terminals, 2 x 2 x 0.65 mm body size, reflow soldering footprint",
        "part number": "1103-003498.pdf",
        "grade": "A",
        "maker_pn": "NCR320PAS"
      }
    ]
  },
  "part number": "1103-003498"
}