{
  "metadata": {
    "component_name": "AT24CSW04X/AT24CSW08X",
    "manufacturer": "Microchip",
    "key_specifications": "I²C-Compatible Serial EEPROM with 4-Kbit (512x8) or 8-Kbit (1,024x8) density, 1.7V to 3.6V operation, software write protection, 256-bit security register, 100kHz/400kHz/1MHz speeds, industrial temperature range, low power, high endurance and data retention",
    "applications": "The datasheet does not explicitly mention main applications, but based on the features like security register, write protection, and high reliability, it can be inferred that these serial EEPROMs are suitable for applications requiring secure storage of critical data and code in industrial, automotive, and Internet of Things (IoT) devices.",
    "grade": "B",
    "maker_pn": "AT24CSW04X"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "AT24CSW04X/AT24CSW08X\nI²C-Compatible (Two-Wire) Serial EEPROM\nwith a Security Register and Software Write Protection\n4‑ Kbit (512 x 8), 8‑ Kbit (1,024 x 8)\n\nFeatures\n• Low-Voltage Operation:\n– V CC = 1.7V to 3.6V\n• Internally Organized as 512 x 8 (4K) or 1,024 x 8 (8K)\n• Software Write Protection of the EEPROM Array:\n– Five configuration options\n– Protection settings can be made permanent\n• 256 ‑ Bit Security Register:\n– Preprogrammed 128-bit serial number\n– Additional 16 bytes of free user EEPROM provided to store critical user data\n• Factory Set Hardware Client Address:\n– Unique ordering code for each available client address value (AT24CSW04X/AT24CSW08X)\n• Industrial Temperature Range: -40°C to +85°C\n• I 2C-Compatible (Two-Wire) Serial Interface:\n– 100 kHz Standard Mode, 1.7V to 3.6V\n– 400 kHz Fast Mode, 1.7V to 3.6V\n– 1 MHz Fast Mode Plus (FM+), 1.7V to 3.6V\n• Schmitt Triggers, Filtered Inputs for Noise Suppression\n• Bidirectional Data Transfer Protocol\n• Ultra-Low Active Current (1 mA maximum) and Standby Current (0.8 μA maximum)\n• 16-Byte Page Write Mode:\n– Partial page writes allowed\n• Random and Sequential Read Modes\n• Self-Timed Write Cycle within 5 ms Maximum\n• ESD Protection > 4,000V\n• High Reliability:\n– Endurance: 1,000,000 write cycles\n– Data retention: 100 years\n• Green Package Options (Lead-free/Halide-free/RoHS compliant)\n• Die Sale Options: Wafer Form",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 4,
      "categories": [
        "Packaging Information"
      ],
      "content": "1. Package Types (not to scale)\nVcc\nSCL\n4-Ball WLCSP\n(Top View)\nGND\nSDA\nA1 A2\nB1 B2\n5-Lead SOT23\n(Top View)\nSCL 1\n2\n3\n5\n4\nGND\nSDA\nWP\nVcc",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 5,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "2. Pin Descriptions\n\nThe descriptions of the pins are listed in Table 2-1.\n\nTable 2-1. Pin Function Table\nName 5-Lead SOT23 4-Ball WLCSP Function\nSCL 1 B1 Serial Clock\nGND 2 A2 Ground\nSDA 3 B2 Serial Data\nVCC 4 A1 Device Power Supply\nWP(1) 5 — Write-Protect\n\nNote: \n1. If the WP pin is not driven, it is internally pulled down to GND. In order to operate in a wide variety of\napplication environments, the pull‑ down mechanism is intentionally designed to be somewhat strong. Once\nthis pin is biased above the CMOS input buffer's trip point (~0.5 x VCC), the pull‑ down mechanism disengages.\nMicrochip recommends connecting this pin to a known state whenever possible.\n\n2.1 Serial Clock (SCL)\nThe SCL pin is used to provide a clock to the device and to control the flow of data to and from the device. Command\nand input data present on the SDA pin is always latched in on the rising edge of SCL, while output data on the SDA\npin is clocked out on the falling edge of SCL. The SCL pin must either be forced high when the serial bus is idle or\npulled high using an external pull-up resistor.\n\n2.2 Ground\nThe ground reference for the power supply. GND should be connected to the system ground.\n\n2.3 Serial Data (SDA)\nThe SDA pin is an open-drain bidirectional input/output pin used to serially transfer data to and from the device. The\nSDA pin must be pulled high using an external pull-up resistor (not to exceed 10 kΩ in value) and may be wire-ORed\nwith any number of other open-drain or open-collector pins from other devices on the same bus.\n\n2.4 Device Power Supply (VCC)\nThe Device Power Supply (VCC) pin is used to supply the source voltage to the device. Operations at invalid VCC\nvoltages may produce spurious results and should not be attempted.\n\n2.5 Write-Protect (WP)\nThe write-protect input, when connected to GND, allows normal write operations. When the WP pin is connected\ndirectly to VCC, all write operations to the protected memory are inhibited.\nIf the pin is left floating, the WP pin will be internally pulled down to GND. However, due to capacitive coupling that\nmay appear in customer applications, Microchip recommends always connecting the WP pin to a known state. When\nusing a pull‑ up resistor, Microchip recommends using 10 kΩ or less.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 6,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Table 2-2. Write-Protect\nWP Pin Status Part of the Array Protected\nAt VCC Full Array and Security Register\nAt GND Normal Write Operations",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 10,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Parameter Symbol Minimum Typical(1) Maximum Units Test Conditions\nOutput Low Level VOL2 — — 0.4 V VCC = 3.0V, IOL = 2.1 mA\n\nTable 4-3. AC Characteristics(1)\nParameter Symbol Standard Mode Fast Mode Fast Mode Plus Units\n                  VCC = 1.7V to 3.6V VCC = 1.7V to 3.6V VCC = 1.7V to 3.6V\n                  Min. Max. Min. Max. Min. Max.\nClock Frequency, SCL fSCL — 100 — 400 — 1000 kHz\n... [table content truncated for brevity]",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 11,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 4-1.  Bus Timing\n\n4.5 Electrical Specifications\n4.5.1 Power-Up Requirements and Reset Behavior\n\nTable 4-4. Power-Up Conditions(1)\nSymbol Parameter Min. Max. Units\ntPUP Time required after VCC is stable before the device can accept commands 100 － µs\nVPOR Power-on Reset Threshold Voltage － 1.5 V\ntPOFF Minimum time at VCC = 0V between power cycles 1 － ms",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 12,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Table 4-5. Pin Capacitance(1)\nSymbol Test Condition Max. Units Conditions\nCI/O Input/Output Capacitance (SDA) 8 pF VI/O = 0V\nCIN Input Capacitance (SCL) 6 pF VIN = 0V\n\nTable 4-6. EEPROM Cell Performance Characteristics\nOperation Test Condition Min. Max. Units\nWrite Endurance(1) TA = +25°C, VCC (min.) < VCC < VCC (max.), Byte or Page Write mode 1,000,000 — Write Cycles\nData Retention(1) TA = +55°C 100 — Years",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 13,
      "categories": [
        "Device Operation and Communication"
      ],
      "content": "The AT24CSW04X/AT24CSW08X operates as a client device and utilizes a simple I2C-compatible two-wire digital serial interface to communicate with a host controller, commonly referred to as the bus host. The host initiates and controls all read and write operations to the client devices on the serial bus, and both the host and the client devices can transmit and receive data on the bus.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 14,
      "categories": [
        "Device Operation and Communication"
      ],
      "content": "After every byte of data is received, the receiving device must confirm to the transmitting device that it has successfully received the data byte by responding with what is known as an Acknowledge (ACK). An ACK is accomplished by the transmitting device first releasing the SDA line at the falling edge of the eighth clock cycle, followed by the receiving device responding with a logic '0' during the entire high period of the ninth clock cycle.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 15,
      "categories": [
        "Device Operation and Communication"
      ],
      "content": "After an interruption in protocol, power loss or system Reset, any two‑wire device can be protocol reset by clocking SCL until SDA is released by the EEPROM and goes high. The number of clock cycles until SDA is released by the EEPROM will vary. The software Reset sequence should not take more than nine dummy clock cycles. Once the software Reset sequence is complete, new protocol can be sent to the device by sending a Start condition followed by the protocol.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 16,
      "categories": [
        "Memory Organization"
      ],
      "content": "The AT24CSW04X is internally organized as 32 pages of 16 bytes each and the AT24CSW08X is organized as 64 pages of 16 bytes each for the EEPROM array. The device also contains a 32‑byte Security register which is organized as two pages of 16 bytes each. This register contains a factory-programmed ensured unique 128‑bit serial number in the lower 16 bytes. The upper 16 bytes are user‑programmable and can (later) be permanently write‑protected (see Security Register).",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 17,
      "categories": [
        "Memory Organization",
        "Device Addressing"
      ],
      "content": "Accessing the device requires an 8-bit device address byte following a Start condition to enable the device for a read or write operation. Since multiple client devices can reside on the serial bus, each client device must have its own unique address so the host can access each device independently. The Most Significant four bits of the device address byte is referred to as the device type identifier. The device type identifier '1010' (Ah) for the main EEPROM access or '1011' (Bh) for Security register and Write Protection register access is required in bits 7 through 4 of the device address byte (see Table 6‑1).",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 18,
      "categories": [
        "Memory Organization",
        "Device Addressing"
      ],
      "content": "For all operations except the current address read, a word address byte must be transmitted to the device immediately following the device address byte. The word address byte contain a 9-bit (in the case of the AT24CSW04X) or 10-bit (in the case of the AT24CSW08X) memory array word address and is used to specify which byte location in the EEPROM to start reading or writing. Refer to Table 6-5 to review these bit positions. When accessing the Security register, it is required that the A7 and A6 bits of the word address be set to '10' respectively. These bits are at a higher order address range than what is needed to address the 32‑byte space (A4 through A0). It is recommended that all address bits that fall outside the address range that do not have other requirements be set to a logic '0'.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 19,
      "categories": [
        "Write Operations"
      ],
      "content": "All write operations for the AT24CSW04X/AT24CSW08X begin with the host sending a Start condition, followed by a device address byte with the R/W bit set to logic  '0' and then by the word address byte. The data value(s) to be written to the device immediately follow the word address byte. When writing to a protected region, the device will ACK but the internal write cycle will abort, leaving the device ready for the next operation.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 20,
      "categories": [
        "Write Operations"
      ],
      "content": "A page write operation allows up to 16 bytes to be written in the same write cycle, provided all bytes are in the same row of the memory array (where address bits A9/A8 to A3 are the same). Partial page writes of less than 16 bytes are also allowed.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 21,
      "categories": [
        "Write Operations"
      ],
      "content": "The length of the self-timed write cycle (tWR) is defined as the amount of time from the Stop condition that begins the internal write cycle to the Start condition of the first device address byte sent to the AT24CSW04X/AT24CSW08X that it subsequently responds to with an ACK.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 22,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "The AT24CSW04X/AT24CSW08X utilizes a hardware data protection scheme that allows the user to write‑ protect the entire memory contents when the WP pin is at VCC (or a valid VIH). No write protection will be set if the WP pin is at GND or left floating.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 23,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "The AT24CSW04X/AT24CSW08X utilizes a software scheme that allows a portion or the entire EEPROM to be inhibited from being written to by modifying the contents of the Write Protection register (WPR). If desired, the WPR can be set so that it may no longer be modified, thereby making the current protection scheme permanent.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 24,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "The EEPROM array in the AT24CSW04X/AT24CSW08X will be protected from writing in accordance with the WPB1 and WPB0 bit values as long as the WPRE bit is set to logic '1'. If the WPRE bit is set to logic '0', no portion of the EEPROM array will be protected. The combination of these three bits creates five possible levels of protection for the device. The protected address ranges of the memory are shown in Table 8-6.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "To read the contents of the WPR, a random read operation must be sent to the device (see Random Read) so that the reserved word address bits A7 and A6 can properly be set. It is not possible to read the contents of the WPR with a current address read. When reading the WPR contents, data bit 7 through 4 will always read as a logic '0' as seen in Table 8-4.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read operations are initiated the same way as write operations with the exception that the Read/Write select bit in the device address byte must be set to a logic '1'. There are multiple read operations supported by the device: Current Address Read, Random Address Read, Sequential Read",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "A random read begins in the same way as a byte write operation does to load in a new data word address. This is known as a \"dummy write\" sequence. However, the data byte and the Stop condition of the byte write must be omitted to prevent the part from entering an internal write cycle. Once the device address and word address are clocked in and acknowledged by the EEPROM, the bus host must generate another Start condition. Sequential reads are initiated by either a current address read or a random read. After the bus host receives a data word, it responds with an Acknowledge. As long as the EEPROM receives an ACK, it will continue to increment the word address and serially clock out sequential data words.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 29,
      "categories": [
        "Security Register"
      ],
      "content": "The AT24CSW04X/AT24CSW08X includes a 32-byte Security register. The Security register is segmented into a 16-byte read-only section and a 16‑ byte user-programmable section organized as 2 pages of 16 bytes each. The user-programmable portion supports both byte write and page write operations. The read-only section contains a preprogrammed ensured unique 128-bit serial number. The user-programmable portion may be permanently locked at any time with the Lock command.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 30,
      "categories": [
        "Security Register"
      ],
      "content": "The Security register supports byte writes, page writes and partial page writes in the upper 16 bytes of the region. Page writes and partial page writes in the Security register have the same page boundary restrictions and behavior as they do in the EEPROM region (see Page Write). Writing in the Security register requires beginning the device address byte with 1011b (Bh), matching the hardware address bits (A2, A1) to the corresponding value determined by the ordering code of the device (see Table 6-3 and Table 6-4) and sending a logic '0' in the Read/Write Select bit. The device will ACK this sequence. Following the device address byte, bits A7 and A6 of the word address byte must be set to 10b regardless of the intended address being written. The user-programmable portion of the Security register can be permanently inhibited from future writing with the Lock command. The status of the Lock state can be determined by sending a subset of the Lock command.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 31,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "10.3.1 Lock Command\nThe Lock command is an irreversible sequence that will permanently prevent all future writing to the Security register. Once the Lock command has been executed, the Security register becomes read-only.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 32,
      "categories": [
        "Device Default Condition from Microchip"
      ],
      "content": "The AT24CSW04X/AT24CSW08X is delivered with the EEPROM array set to logic '1', resulting in FFh data in all locations.\n\nThe Security register contains a preprogrammed 128-bit serial number in the lower 16 bytes. The upper 16 bytes of this register is set to logic '1' resulting in FFh data.\n\nThe device is delivered with the Security register Lock function not enabled (see Lock Command) and the Write Protection register set to 00h.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 33,
      "categories": [
        "Packaging Information"
      ],
      "content": "12.1 Package Marking Information\n\n4-ball WLCSP\nNN\n\n5-lead SOT23\n##%UYY\n WWNNN",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 34,
      "categories": [
        "Packaging Information"
      ],
      "content": "For the most current package drawings, please see the Microchip Packaging Specification located at http://www.microchip.com/packaging",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 35,
      "categories": [
        "Packaging Information"
      ],
      "content": "For the most current package drawings, please see the Microchip Packaging Specification located at http://www.microchip.com/packaging",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 36,
      "categories": [
        "Packaging Information"
      ],
      "content": "For the most current package drawings, please see the Microchip Packaging Specification located at http://www.microchip.com/packaging",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 37,
      "categories": [
        "Packaging Information"
      ],
      "content": "DRAWING NO. REV.  TITLE GPC\n4U-13 A\n10/1/15\n4U-13, 4-ball 2x2 Array, 0.40mm Pitch\nWafer Level Chip Scale Package (WLCSP) with BSC GUJ\n\nCOMMON DIMENSIONS\n(Unit of Measure = mm)\nSYMBOL MIN TYP MAX NOTE\n  A  0.260 0.295 0.330\n A1  — 0.070 —\n A2  — 0.225 —     3           \n   D         Contact Microchip for Details\n d1  0.400 BSC\n    E         Contact Microchip for Details\n  e1  0.400 BSC\n  b — 0.162 —\n\nPIN ASSIGNMENT MATRIX\nBOTTOM VIEWTOP VIEW\n\nSIDE VIEW\n1 2\nA\nB\nVCC\nSDA\nGND\nSCL\nd1\ne1E\nD    b (4X)\nA2\nA1\nA\nk 0.075 C\nk 0.015 (4X)\nv d 0.015 C\nd 0.05 C A B\nA1 CORNER A1 CORNER\nSEATING PLANE\nB\nA\n2 1\nB\nA\n1 2\nd\nm\nm\n\nNote:  1. Dimensions are NOT to scale.\n         2. Solder ball composition is 95.5Sn-4.0Ag-0.5Cu.\n          3. Product offered with Back Side Coating (BSC)\nB\nA\nC\n\nNote:  For the most current package drawings, please see the Microchip Packaging Specification located at http://\nwww.microchip.com/packaging.",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    },
    {
      "page_number": 40,
      "categories": [
        "Product Summary"
      ],
      "content": "Product Identification System\nTo order or obtain information, e.g., on pricing or delivery, refer to the factory or the listed sales office.\n\nProduct Family\n24CS = I2C Compatiable Serial EEPROM with a Security Register\n\nDevice Density & Feature\nW04 = 4-Kbit with Software Write Protection\nW08 = 8-Kbit with Software Write Protection",
      "grade": "B",
      "maker_pn": "AT24CSW04X",
      "part number": "1103-004345"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "AT24CSW04X/AT24CSW08X are I²C-compatible (two-wire) serial EEPROMs with a security register and software write protection, available in 4-Kbit (512 x 8) and 8-Kbit (1,024 x 8) densities. They feature low-voltage operation (1.7V to 3.6V), software write protection of the EEPROM array with five configuration options, and a 256-bit security register with a preprogrammed 128-bit serial number and 16 bytes of free user EEPROM.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "Key features include an industrial temperature range (-40°C to +85°C), I²C-compatible serial interface with 100 kHz Standard Mode, 400 kHz Fast Mode, and 1 MHz Fast Mode Plus (FM+), Schmitt triggers and filtered inputs for noise suppression, bidirectional data transfer protocol, ultra-low active current (1 mA maximum) and standby current (0.8 μA maximum), 16-byte page write mode with partial page writes allowed, random and sequential read modes, self-timed write cycle within 5 ms maximum, and ESD protection > 4,000V.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "These EEPROMs offer high reliability with endurance of 1,000,000 write cycles and data retention of 100 years, as well as green package options (lead-free/halide-free/RoHS compliant) and die sale options in wafer form. The product identification system uses a naming convention where '24CS' indicates an I²C-compatible serial EEPROM with a security register, 'W04' denotes a 4-Kbit device with software write protection, and 'W08' denotes an 8-Kbit device with software write protection.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The text describes the pin functions of the device, including Serial Clock (SCL), Ground (GND), Serial Data (SDA), Device Power Supply (VCC), and Write-Protect (WP) pins. It provides details on the electrical characteristics of each pin, such as the voltage levels, pull-up resistor values, and write protection functionality.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "The text includes tables with detailed electrical specifications, such as output low voltage levels, AC timing characteristics (clock frequency, setup and hold times, etc.), power-up requirements and reset behavior, pin capacitance values, and EEPROM cell performance characteristics (write endurance, data retention).",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "The text explains various read and write operations supported by the device, including Current Address Read, Random Address Read, Sequential Read, and the Lock Command, which permanently prevents future writing to the Security register.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "The AT24CSW04X/AT24CSW08X utilizes a hardware data protection scheme that allows the user to write‑ protect the entire memory contents when the WP pin is at VCC (or a valid VIH). No write protection will be set if the WP pin is at GND or left floating.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "The AT24CSW04X/AT24CSW08X utilizes a software scheme that allows a portion or the entire EEPROM to be inhibited from being written to by modifying the contents of the Write Protection register (WPR). If desired, the WPR can be set so that it may no longer be modified, thereby making the current protection scheme permanent.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "The EEPROM array in the AT24CSW04X/AT24CSW08X will be protected from writing in accordance with the WPB1 and WPB0 bit values as long as the WPRE bit is set to logic '1'. If the WPRE bit is set to logic '0', no portion of the EEPROM array will be protected. The combination of these three bits creates five possible levels of protection for the device.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "The protected address ranges of the memory are shown in Table 8-6.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      }
    ],
    "Packaging Information": [
      {
        "content": "1. Package Types (not to scale)\n\nVcc\nSCL\n4-Ball WLCSP\n(Top View)\nGND\nSDA\nA1 A2\nB1 B2\n\n5-Lead SOT23\n(Top View)\nSCL 1\n2\n3\n5\n4\nGND\nSDA\nWP\nVcc",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "12.1 Package Marking Information\n\n4-ball WLCSP\nNN\n\n5-lead SOT23\n##%UYY\n WWNNN\n\nFor the most current package drawings, please see the Microchip Packaging Specification located at http://www.microchip.com/packaging",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      },
      {
        "content": "DRAWING NO. REV. TITLE GPC\n4U-13 A\n10/1/15\n4U-13, 4-ball 2x2 Array, 0.40mm Pitch\nWafer Level Chip Scale Package (WLCSP) with BSC GUJ\n\nCOMMON DIMENSIONS\n(Unit of Measure = mm)\nSYMBOL MIN TYP MAX NOTE\n  A  0.260 0.295 0.330\n A1  — 0.070 —\n A2  — 0.225 —     3\n   D         Contact Microchip for Details\n d1  0.400 BSC\n    E         Contact Microchip for Details\n  e1  0.400 BSC\n  b — 0.162 —\n\nPIN ASSIGNMENT MATRIX\nBOTTOM VIEWTOP VIEW\n\nSIDE VIEW\n1 2\nA\nB\nVCC\nSDA\nGND\nSCL\nd1\ne1E\nD    b (4X)\nA2\nA1\nA\nk 0.075 C\nk 0.015 (4X)\nv d 0.015 C\nd 0.05 C A B\nA1 CORNER A1 CORNER\nSEATING PLANE\nB\nA\n2 1\nB\nA\n1 2\nd\nm\nm\n\nNote:  1. Dimensions are NOT to scale.\n         2. Solder ball composition is 95.5Sn-4.0Ag-0.5Cu.\n          3. Product offered with Back Side Coating (BSC)\nB\nA\nC\n\nNote:  For the most current package drawings, please see the Microchip Packaging Specification located at http://www.microchip.com/packaging.",
        "part number": "1103-004345.pdf",
        "grade": "B",
        "maker_pn": "AT24CSW04X"
      }
    ]
  },
  "part number": "1103-004345"
}