{
  "metadata": {
    "component_name": "DS28E80",
    "manufacturer": "Maxim Integrated",
    "key_specifications": "248 bytes of user-programmable nonvolatile memory, 64-bit unique ID, 1-Wire interface, radiation resistant up to 75kGy, operating range 3.3V ±10%, -40°C to +85°C, 6-pin TDFN package",
    "applications": "Identification of medical consumables, identification and calibration of medical tools/accessories",
    "grade": "D",
    "maker_pn": "DS28E80"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "General Description\nThe DS28E80 is a user-programmable nonvolatile memory chip. In contrast to the floating-gate storage cells, the DS28E80 employs a storage cell technology that is resistant to gamma radiation. The DS28E80 has 248 bytes of user memory that are organized in blocks of 8 bytes. Individual blocks can be write-protected. Each memory block can be written 8 times. The DS28E80 communicates over the single-contact 1-Wire® bus at standard speed or overdrive speed. Each device has its own guaranteed unique 64-bit registration number that is factory programmed into the chip. The communication follows the 1-Wire protocol with a 64-bit registration number acting as node address in the case of a multiple-device 1-Wire network.\n\nApplications\n• Identification of Medical Consumables\n• Identification and Calibration Medical Tools/Accessories\n\nBenefits and Features\n• High Gamma Resistance Allows User-Programmable Manufacturing or Calibration Data Before Medical Sterilization\n    - Resistant Up to 75kGy (kiloGray) of Gamma Radiation\n    - Reprogrammable 248 Bytes of User Memory\n• Lower Block Size Provides Greater Flexibility in Programming User Memory\n    - Memory is Organized as 8-Byte Blocks\n    - Each Block Can Be Written 8 Times\n    - User-Programmable Write Protection for Individual Memory Blocks\n• Advanced 1-Wire Protocol Minimizes Interface to Just Single Contact\n• Compact Package and Single IO Interface Reduces Board Space and Enhances Reliability\n    - Unique Factory-Programmed, 64-Bit Identification Number\n    - Communicates at 1-Wire Standard Speed (15.3kbps max) and Overdrive Speed (76kbps max)\n    - Operating Range: 3.3V ±10%, -40°C to + 85°C Reading, 0°C to +50°C Writing\n    - ±8kV HBM ESD Protection (typ) for IO Pin\n    - 6-Pin TDFN Package",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 2,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Absolute Maximum Ratings\nIO Voltage Range to GND ....................................-0.5V to +4.0V\nIO Sink Current.................................................................±20mA\nOperating Temperature Range ........................... -40°C to +85°C\nJunction Temperature ......................................................+150°C\nStorage Temperature Range ............................-55°C to +125°C\nLead Temperature (soldering, 10s) .................................+300°C\nSoldering Temperature (reflow)\nTDFN ...........................................................................+260°C\n\nPackage Thermal Characteristics\nTDFN\nJunction-to-Ambient Thermal Resistance (θJA) ..........60°C/W\nJunction-to-Case Thermal Resistance (θJC) ...............11°C/W\n\nElectrical Characteristics\n(TA = -40°C to +85°C, unless otherwise noted.)\n\n[Table of electrical characteristics]",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 3,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "[Continued table of electrical characteristics with notes]",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 4,
      "categories": [
        "Product Summary"
      ],
      "content": "The DS28E80 combines 1984 bits of 8-times programmable radiation hard nonvolatile user memory, administration memory, protection memory, and a 64-bit ROM ID in a single chip. A data buffer assists when writing to the memory. Data is transferred serially through the 1-Wire protocol that requires only a single data lead and a ground return. The user memory can be write protected to prevent overwriting the memory data. The protection applies to individual memory blocks. To protect against adverse effects caused by bit errors, the communication relies on 16-bit CRCs that the DS28E80 generates at various places in the protocol. The master verifies the CRC and, when found correct, transmits a release byte (any value from 00h to FFh) to approve EEPROM programming cycle. In case of a CRC error, the master can abort the communication and start over. The device's 64-bit ROM ID can be used to electronically identify the object in which the DS28E80 is used. The ROM ID guarantees unique identification and functions as logical address in a multidrop 1-Wire network environment where multiple devices reside on a common 1-Wire bus and operate independently of each other. The main application of the DS28E80 is identification and monitoring of consumables for medical applications.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 5,
      "categories": [
        "Product Summary"
      ],
      "content": "Figure 1. DS28E80 Block Diagram \nFigure 2. Hierarchical Structure for 1-Wire Protocol",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 6,
      "categories": [
        "Product Summary"
      ],
      "content": "Each DS28E80 contains a unique ROM ID that is 64 bits long. The first 8 bits are a 1-Wire family code: 4Ah. The next 48 bits are a unique serial number. The last 8 bits are a cyclic redundancy check (CRC) of the first 56 bits. See Figure 3 for details. The CRC is generated using a polynomial generator consisting of a shift register and XOR gates as shown in Figure 4. The polynomial is X8 + X5 + X4 + 1.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 7,
      "categories": [
        "Product Summary"
      ],
      "content": "The memory of the DS28E80 consists of user memory, administration memory, protection memory, a write buffer, and a ROM ID. Table 1 shows the size, access mode, and purpose of the various memory areas. The user memory ( Figure 5 ) is organized as 31 blocks of 8 bytes each, totaling of 248 bytes.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 8,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Write Block command writes an entire 8-byte memory block. This command affects the remaining cycles counter. The data provided with the command is temporarily stored in the write buffer. The protocol allows writing multiple adjacent blocks, up to the end of the memory in a single write block command flow.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 9,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Memory command is used to read the user memory. The protocol allows reading multiple blocks up to the end of the memory in a single read memory command flow. After the last byte of a block is read, the DS28E80 transmits a CRC of the block data for the master to verify the data integrity.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 10,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Write Protect Block\nThe Write Protect Block command is used to protect a user memory block from changes. Once set, the protection cannot be reset. To detect transmission errors when issuing this command, the DS28E80 generates and transmits a CRC after the parameter byte. In case of an invalid CRC, the master aborts the command by issuing a 1-Wire reset. To activate the protection the master must transmit a release byte. After the programming time is over, the DS28E80 transmits a CS byte.\n\nBits[4:0]: Block Number (BN) . These bits specify the number of the memory block to be write protected. Valid block numbers are 00000b (start of memory) to 11110b (last block of user memory).",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 11,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Block Protection\nThe Read Block Protection command is used to read the protection status of a memory block. To detect transmission errors when issuing this command, the DS28E80 generates and transmits a CRC after the parameter byte. After the CRC, the master receives the protection status byte. If the block is unprotected, the code is 0Fh; the code for a protected block is F0h.\n\nBits[4:0]: Block Number (BN). These bits specify the number of the first memory block for which to read the protection. Valid block numbers are 00000b (start of memory) to 11110b (last block of user memory).",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 12,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Remaining Cycles\nThe Read Remaining Cycles command is used to read how many more times the Write Block command can be executed for a given memory block. The value for an unprogrammed memory block is 08h. The value 00h indicates that the write cycles for the block are exhausted. To detect transmission errors when issuing this command, the DS28E80 generates and transmits a CRC after the parameter byte. After the CRC, the master receives the remaining write cycles number for the specific block.\n\nBits[4:0]: Block Number (BN). These bits specify the number of the first memory block for which to read the remaining cycles. Valid block numbers are 00000b (start of memory) to 11110b (last block of user memory).",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 13,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 6a. Memory Functions Flow Chart",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 14,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 6b. Memory Functions Flow Chart",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 15,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 6c. Memory Functions Flow Chart",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 18,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The 1-Wire bus is a system that has a single bus master and one or more slaves. In all instances, the DS28E80 is a slave device. The bus master is typically a microcontroller. The discussion of this bus system is broken down into three topics: hardware configuration, transaction sequence, and 1-Wire signaling (signal types and timing). The 1-Wire protocol defines bus transactions in terms of the bus state during specific time slots that are initiated on the falling edge of sync pulses from the bus master.\n\nThe 1-Wire port of the DS28E80 is open drain with an internal circuit equivalent to that shown in Figure 7.\n\nA multidrop bus consists of a 1-Wire bus with multiple slaves attached. The DS28E80 supports both standard and overdrive communication speed of 15.3kbps (max) and 76kbps (max), respectively. The DS28E80 requires a pullup resistor of maximum 750Ω.\n\nThe idle state for the 1-Wire bus is high. If for any reason a transaction must be suspended, the bus must be left in the idle state if the transaction is to resume. If this does not occur and the bus is left low for more than 16µs (overdrive speed) or more than 120µs (standard speed), one or more devices on the bus could be reset.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 19,
      "categories": [],
      "content": "1-Wire ROM Function Commands\nOnce the bus master has detected a presence, it can issue one of the seven ROM function commands that the DS28E80 supports. All ROM function commands are 8 bits long. A list of these commands follows (Figure 8).\n\nRead ROM [33h]\nThe Read ROM command allows the bus master to read the DS28E80's ROM ID (8-bit family code, unique 48-bit serial number, and 8-bit CRC)...\n\nMatch ROM [55h]\nThe Match ROM command, followed by a 64-bit ROM ID, allows the bus master to address a specific DS28E80 on a multidrop bus...\n\nSearch ROM [F0h]\nWhen a system is initially brought up, the bus master might not know the number of devices on the 1-Wire bus or their ROM ID numbers. By taking advantage of the wired-AND property of the bus, the master can use a process of elimination to identify the ID of all slave devices...",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 20,
      "categories": [],
      "content": "Figure 8a. ROM Functions Flow Chart",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 21,
      "categories": [],
      "content": "Figure 8b. ROM Functions Flow Chart (continued)",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "The other CRC is a 16-bit type, generated according to the standardized CRC-16 polynomial function X 16 + X15 + X2 + 1. This CRC is used for error detection with all memory function commands. In contrast to the 8-bit CRC, the 16-bit CRC is always communicated in the inverted form. A CRC generator inside the DS28E80 chip ( Figure 12) calculates a new 16-bit CRC, as shown in the memory function flowchart ( Figure 6). The bus master compares the CRC value read from the device to the one it calculates from the data and decides whether to continue with an operation or to start over again.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 26,
      "categories": [
        "Application Circuits"
      ],
      "content": "1-Wire Communication Examples\nSee Table 7 and Table 8 for the 1-Wire Communication legend and the data direction color codes.",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    },
    {
      "page_number": 27,
      "categories": [
        "Packaging Information"
      ],
      "content": "+Denotes lead(Pb)-free/RoHS-compliant package.\nT = Tape and reel. PACKAGE TYPE\tPACKAGE CODE\tOUTLINE NO.\tLAND PATTERN NO.\n6 TDFN\tT633MK+1\t21-0137\t90-0058\n\nPART\tTEMP RANGE\tPIN-PACKAGE\nDS28E80Q+U\t-40°C to +85°C\t6 TDFN\nDS28E80Q+T\t-40°C to +85°C\t6 TDFN (2.5k pcs)",
      "grade": "D",
      "maker_pn": "DS28E80",
      "part number": "1103-002870"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The DS28E80 is a user-programmable nonvolatile memory chip with 248 bytes of user memory organized in blocks of 8 bytes. It employs a storage cell technology that is resistant to gamma radiation up to 75kGy. The DS28E80 communicates over the single-contact 1-Wire bus at standard or overdrive speed, and each device has a unique 64-bit registration number factory-programmed into the chip.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "Key features of the DS28E80 include high gamma resistance allowing user-programmable manufacturing or calibration data before medical sterilization, lower block size for greater flexibility in programming user memory, advanced 1-Wire protocol minimizing interface to a single contact, compact package and single IO interface reducing board space and enhancing reliability, unique factory-programmed 64-bit identification number, and operating range of 3.3V ±10%, -40°C to +85°C for reading, and 0°C to +50°C for writing.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "The DS28E80 combines 1984 bits of 8-times programmable radiation hard nonvolatile user memory, administration memory, protection memory, and a 64-bit ROM ID in a single chip. Data is transferred serially through the 1-Wire protocol that requires only a single data lead and a ground return. The user memory can be write protected to prevent overwriting data, and the protection applies to individual memory blocks. Communication relies on 16-bit CRCs for error detection and correction.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "Each DS28E80 contains a unique 64-bit ROM ID consisting of an 8-bit 1-Wire family code (4Ah), a 48-bit unique serial number, and an 8-bit cyclic redundancy check (CRC). The CRC is generated using a polynomial generator with a shift register and XOR gates. The user memory is organized as 31 blocks of 8 bytes each, totaling 248 bytes.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      }
    ],
    "Application Circuits": [
      {
        "content": "Figure 6a. Memory Functions Flow Chart, Figure 6b. Memory Functions Flow Chart, Figure 6c. Memory Functions Flow Chart - These figures illustrate the flow chart for memory functions.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "The DS28E80 chip has a 16-bit CRC generator that calculates a new 16-bit CRC according to the standardized CRC-16 polynomial function X^16 + X^15 + X^2 + 1. This 16-bit CRC is used for error detection with all memory function commands and is communicated in the inverted form. The bus master compares the CRC value read from the device to the one it calculates from the data to decide whether to continue with an operation or start over again.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "1-Wire Communication Examples are provided, with legends and data direction color codes given in Table 7 and Table 8.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      }
    ],
    "Packaging Information": [
      {
        "content": "PACKAGE TYPE PACKAGE CODE OUTLINE NO. LAND PATTERN NO. 6 TDFN T633MK+1 21-0137 90-0058",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "+Denotes lead(Pb)-free/RoHS-compliant package. T = Tape and reel.",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "PART TEMP RANGE PIN-PACKAGE DS28E80Q+U -40°C to +85°C 6 TDFN DS28E80Q+T -40°C to +85°C 6 TDFN (2.5k pcs)",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      },
      {
        "content": "PACKAGE TYPE PACKAGE CODE OUTLINE NO. LAND PATTERN NO. 6 TDFN T633MK+1 21-0137 90-0058 +Denotes lead(Pb)-free/RoHS-compliant package. T = Tape and reel. PART TEMP RANGE PIN-PACKAGE DS28E80Q+U -40°C to +85°C 6 TDFN DS28E80Q+T -40°C to +85°C 6 TDFN (2.5k pcs)",
        "part number": "1103-002870.pdf",
        "grade": "D",
        "maker_pn": "DS28E80"
      }
    ]
  },
  "part number": "1103-002870"
}