{
  "metadata": {
    "component_name": "W25Q512JV",
    "manufacturer": "Winbond",
    "key_specifications": "3V 512M-bit Serial Flash Memory with Dual/Quad SPI, 2.7V to 3.6V operation, up to 133MHz SPI clock, 256-byte page size, 4KB/32KB/64KB erase blocks, hardware and software write protection, 3/4-byte addressing modes, Quad I/O instructions for high speed data transfer",
    "applications": "Code shadowing to RAM, executing code directly from Flash (XIP), storing voice, text and data in systems with limited space, pins and power",
    "grade": "A",
    "maker_pn": "W25Q512JV"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "W25Q512JV \n\n3V 512M-BIT \nSERIAL FLASH MEMORY WITH \nDUAL/QUAD SPI\n\nFor Industrial & Industrial Plus Grade",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 3,
      "categories": [
        "Status and Configuration Registers"
      ],
      "content": "7.1.1 Erase/Write In Progress (BUSY) – Status Only\n7.1.2 Write Enable Latch (WEL) – Status Only\n7.1.3 Block Protect Bits (BP3, BP2, BP1, BP0) – Volatile/Non-Volatile Writable\n7.1.4 Top/Bottom Block Protect (TB) – Volatile/Non-Volatile Writable\n7.1.5 Complement Protect (CMP) – Volatile/Non-Volatile Writable\n7.1.6 Status Register Protect (SRP, SRL) – Volatile/Non-Volatile Writable\n7.1.7 Erase/Program Suspend Status (SUS) – Status Only\n7.1.8 Security Register Lock Bits (LB3, LB2, LB1) – Non-Volatile OTP Writable\n7.1.9 Quad Enable (QE) – Volatile/Non-Volatile Writable\n7.1.10 Current Address Mode (ADS) – Status Only\n7.1.11 Power-Up Address Mode (ADP) – Non-Volatile Writable\n7.1.12 Write Protect Selection (WPS) – Volatile/Non-Volatile Writable\n7.1.13 Output Driver Strength (DRV1, DRV0) – Volatile/Non-Volatile Writable\n7.1.14 Reserved Bits – Non Functional\n7.1.15 W25Q512JV Status Register Memory Protection (WPS = 0, CMP = 0) \n7.1.16 W25Q512JV Status Register Memory Protection (WPS = 0, CMP = 1)\n7.1.17 W25Q512JV Individual Block Memory Protection (WPS=1) \n7.2 Extended Address Register – Volatile Writable Only",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 6,
      "categories": [
        "Product Summary"
      ],
      "content": "The W25Q512JV (512M-bit) Serial Flash memory  provides a storage solu tion for systems with limited space, pins and power. The 25Q series offers flexibility and performance well beyond ordinary Serial Flash devices. They are ideal for code shadowing to RAM,  executing code directly from D ual/Quad SPI (XIP) and storing voice, text and data. The device operate s on a single 2.7V to 3.6V power supply with current consumption as low as 1µA for power-down. All devices are offered in space-saving packages.\n\nThe W25Q512JV array is organized into 262,144 programmable pages of 256 -bytes each. Up to 256 bytes can be programmed at a time. Pages can be erased in groups of 16 (4KB sector erase), groups of 128 (32KB block erase), groups of 256 (64KB block erase) or the entire chip (chip erase). The W25Q512JV has 16,384 erasable 4KB sectors and  1,028 erasable 64KB blocks respectively. The small 4KB sectors allow for greater flexibility in applications that require data and parameter storage.\n\nThe W25Q512JV supports the standard Serial Peripheral Interface (SPI), Dual/Quad I/O SPI: Serial Clock, Chip Select, Serial Data I/O0 (DI), I/O1 (DO), I/O2, and I/O3. SPI clock frequencies of W25Q512JV of up to 133MHz are supported allowing equivalent clock rates of 266MHz (133MHz x 2) for Dual I/O and 532MHz (133MHz x 4) for Quad I/O when using the Fast Rea d Dual/Quad I/O. These transfer rates can outperform standard Asynchronous 8 and 16-bit Parallel Flash memories.\n\nAdditionally, the device supports JEDEC standard manufacturer and device ID and SFDP Register , a 64-bit Unique Serial Number and three 256-bytes Security Registers.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 13,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "6.1.4 3-Byte / 4-Byte Address Modes \nThe W25Q512JV provides two Address Modes that can be used to specify any byte of data in the memory array. The 3-Byte Address Mode is backward compatible to older generations of serial flash memory that only support up to 128M-bit data. To address the 256M-bit or more data in 3-Byte Address Mode, Extended Address Register must be used in addition to the 3-Byte addresses. \n4-Byte Address Mode is designed to support Serial Flash Memory devices from 256M-bit to 32G-bit. The extended Address Register is not necessary when the 4-Byte Address Mode is enabled.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 14,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "6.2 Write Protection\nApplications that use non-volatile memory must take into consideration the possibility of noise and other adverse system conditions that may compromise data integrity. To address this concern, the W25Q512JV provides several means to protect the data from inadvertent writes.\n\n- Device resets when VCC is below threshold\n- Time delay write disable after Power-up\n- Write enable/disable instructions and automatic write disable after erase or program\n- Software and Hardware (/WP pin) write protection using Status Registers\n- Additional Individual Block/Sector Locks for array protection\n- Write Protection using Power-down instruction\n- Lock Down write protection for Status Register until the next power-up\n- One Time Program (OTP) write protection for array and Security Registers using Status Register*",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 15,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7. STATUS AND CONFIGURATION REGISTERS\nThree Status/Configuration Registers and Extended Address Register are provided for W25Q512JV. The Read Status Register-1/2/3 instructions can be used to provide status on the availability of the flash memory array, whether the device is write enabled or disabled, the state of write protection, Quad SPI setting, Security Register lock status, Erase/Program Suspend status, output driver strength, power-up and current Address Mode. The Write Status Register instruction can be used to configure the device write protection features, Quad SPI setting, Security Register OTP locks, Hold/Reset functions, output driver strength and power-up Address Mode.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 19,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.10 Current Address Mode (ADS) – Status Only \nThe Current Address Mode bit is a read only bit in the Status Register -3 that indicates which address \nmode the device is currently operating in . When ADS=0, the device is in the 3 -Byte Address Mode, when \nADS=1, the device is in the 4-Byte Address Mode.\n\n7.1.11 Power-Up Address Mode (ADP) – Non-Volatile Writable\nThe ADP bit is a non -volatile bit that determines  the initial address mode when the device is powered on \nor reset. This bit is only used during the power on or device reset initialization period, and it is only writable \nby the non -volatile Write Status sequence (06h + 11h).  When ADP=0 (factory default), the device will \npower up into 3 -Byte Address Mode, the Extended Address Register must be used to access memory \nregions beyond 128Mb. When ADP=1, the device will power up into 4-Byte Address Mode directly.\n\n7.1.12 Write Protect Selection (WPS) – Volatile/Non-Volatile Writable\nThe WPS bit is used to select which Write Protect scheme should be used . When WPS=0, the device will \nuse the combination of CMP, TB, BP[3:0] bits to protect a sp ecific area of the memory array. When \nWPS=1, the device will utilize the Individual Block Locks to protect any individual sector or blocks. The \ndefault value for all Individual Block Lock bits is 1 upon device power on or after reset.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 20,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.13 Output Driver Strength (DRV1, DRV0) – Volatile/Non-Volatile Writable\nThe DRV1 & DRV0 bits are used to determine the output driver strength for the Read operations.\n\nDRV1, DRV0 Driver Strength\n0, 0 100%\n0, 1 75%(1)\n1, 0 50%\n1, 1 25%(2)\n\nNotes:\n\n1. Factory default for part numbers with ordering options \"IN\".\n2. Factory default for part numbers with ordering options \"IQ\".\n\n7.1.14 Reserved Bits – Non Functional\nThere are a few reserved Status Register bits that may be read out as a \"0\" or \"1\". It is recommended to \nignore the values of those bits. During a \"Write Status Register\" instruction, the Reserved Bits can be \nwritten as \"0\", but there will not be any effects.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 21,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.15 W25Q512JV Status Register Memory Protection (WPS = 0, CMP = 0) \n\nSTATUS REGISTER(1) W25Q512JV (512M-BIT / 64M-BYTE) MEMORY PROTECTION(2)\nTB BP3 BP2 BP1 BP0 PROTECTED\nBLOCK(S) PROTECTED\nADDRESSES PROTECTED\nDENSITY PROTECTED\nPORTION\n\n[Table showing memory protection details based on status register values]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 22,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.16 W25Q512JV Status Register Memory Protection (WPS = 0, CMP = 1) \n\nSTATUS REGISTER(1) W25Q512JV (512M-BIT / 64M-BYTE) MEMORY PROTECTION(2)\nTB BP3 BP2 BP1 BP0 PROTECTED BLOCK(S) PROTECTED ADDRESSES PROTECTED DENSITY PROTECTED PORTION\n... (table contents) ...",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 23,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.17 W25Q512JV Individual Block Memory Protection (WPS=1)\n\n(diagram and notes on individual block/sector locks)",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 24,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.2 Extended Address Register – Volatile Writable Only\n\n(details on extended address register and how it is used for addressing different memory regions)",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 25,
      "categories": [
        "Product Summary"
      ],
      "content": "The Standard/Dual/Quad SPI instruction set of the W25Q512JV consists of 48 basic instructions that are fully controlled through the SPI bus (see Instruction Set Table1-4). Instructions are initiated with the falling edge of Chip Select (/CS). The first byte of data clocked into the DI input provides the instruction code.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.2 Instruction Set Table 1 (Standard/Dual/Quad SPI, 3-Byte Address Mode)(1)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6 Byte 7\n[Table with instruction codes and descriptions]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.3 Instruction Set Table 2 (Dual/Quad SPI Instructions,3-Byte Address Mode)\nData Input Output  Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6 Byte 7 Byte 8 Byte 9 Byte 10\n[Table with instruction codes and descriptions for Dual/Quad SPI]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 28,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.4 Instruction Set Table 3 (Standard SPI, 4-Byte Address Mode)(1)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6 Byte 7\nNumber of Clock(1-1-1) 8 8 8 8 8 8 8\n[Full instruction set table]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 29,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.5 Instruction Set Table 4 (Dual/Quad SPI Instructions, 4-Byte Address Mode)\nData Input Output  Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6 Byte 7 Byte 8 Byte9\nNumber of Clock(1-1-2) 8 8 8 8 8 8 4 4\n[Full instruction set table]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 30,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Notes:\n1. Data bytes are shifted with Most Significant Bit first. Byte fields with data in parenthesis \"( )\" indicate data output from the device on either 1, 2 or 4 IO pins.\n2. The Status Register contents and Device ID will repeat continuously until /CS terminates the instruction.\n3. At least one byte of data input is required for Page Program, Quad Page Program and Program Security Registers, up to 256 bytes of data input. If more than 256 bytes of data are sent to the device, the addressing will wrap to the beginning of the page and overwrite previously sent data.\n4. Write Status Register-1 (01h) can also be used to program Status Register -1&2, see section 8.2.5.\n5. Security Register Address:\n         Security Register 1:  A23 -16 = 00h;  A 15-8 = 10h;  A7 -0 = byte address\n         Security Register 2:  A23 -16 = 00h;  A15 -8 = 20h;  A7 -0 = byte address\n         Security Register 3:  A23 -16 = 00h;  A15 -8 = 30h;  A7 -0 = byte address\n[Additional notes on instruction set tables]",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 31,
      "categories": [],
      "content": "8.2.1 Write Enable (06h)\nThe Write Enable instruction (Figure 5) sets the Write Enable Latch (WEL) bit in the Status Register to a 1. The WEL bit must be set prior to every Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase, Write Status Register and Erase/Program Security Registers instruction.\n\n8.2.2 Write Enable for Volatile Status Register (50h)\nThe non-volatile Status Register bits described in section 7.1 can also be written to as volatile bits. This gives more flexibility to change the system configuration and memory protection schemes quickly without waiting for the typical non-volatile bit write cycles or affecting the endurance of the Status Register non-volatile bits. To write the volatile values into the Status Register bits, the Write Enable for Volatile Status Register (50h) instruction must be issued prior to a Write Status Register (01h) instruction.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 32,
      "categories": [],
      "content": "8.2.3 Write Disable (04h)\nThe Write Disable instruction (Figure 7) resets the Write Enable Latch (WEL) bit in the Status Register to a 0. The Write Disable instruction is entered by driving /CS low, shifting the instruction code \"04h\" into the DI pin and then driving /CS high. Note that the WEL bit is automatically reset after Power-up and upon completion of the Write Status Register, Erase/Program Security Registers, Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase and Reset instructions.\n\n8.2.4 Read Status Register-1 (05h), Status Register-2 (35h) & Status Register-3 (15h)\nThe Read Status Register instructions allow the 8-bit Status Registers to be read. The instruction is entered by driving /CS low and shifting the instruction code \"05h\" for Status Register-1, \"35h\" for Status Register-2 or \"15h\" for Status Register-3 into the DI pin on the rising edge of CLK. The status register bits are then shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first as shown in Figure 8. Refer to section 7.1 for Status Register descriptions.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 33,
      "categories": [],
      "content": "8.2.5 Write Status Register-1 (01h), Status Register-2 (31h) & Status Register-3 (11h)\nThe Write Status Register instruction allows the Status Registers to be written. The writable Status Register bits include: TB, BP[3:0] in Status Register-1; CMP, LB[3:1], QE, SRL in Status Register-2;, DRV1, DRV0, WPS & ADP in Status Register-3. All other Status Register bit locations are read-only and will not be affected by the Write Status Register instruction. LB[3:1] are non-volatile OTP bits, once it is set to 1, it cannot be cleared to 0.\n\nTo write non-volatile Status Register bits, a standard Write Enable (06h) instruction must previously have been executed for the device to accept the Write Status Register instruction (Status Register bit WEL must equal 1). Once write enabled, the instruction is entered by driving /CS low, sending the instruction code \"01h/31h/11h\", and then writing the status register data byte as illustrated in Figure 9a.\n\nTo write volatile Status Register bits, a Write Enable for Volatile Status Register (50h) instruction must have been executed prior to the Write Status Register instruction (Status Register bit WEL remains 0). However, SRL and LB[3:1] cannot be changed from \"1\" to \"0\" because of the OTP protection for these bits. Upon power off or the execution of a Software/Hardware Reset, the volatile Status Register bit values will be lost, and the non-volatile Status Register bit values will be restored.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 34,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q512JV is also backward compatible to Winbond's previous generations of serial flash memories, in which the Status Register-1&2 can be written using a single \"Write Status Register-1 (01h)\" command. To complete the Write Status Register-1&2 instruction, the /CS pin must be driven high after the sixteenth bit of data that is clocked in as shown in Figure 9b. If /CS is driven high after the eighth clock, the Write Status Register-1 (01h) instruction will only program the Status Register-1, the Status Register-2 will not be affected (Previous generations will clear CMP and QE bits).",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 35,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "When the device is in the 3-Byte Address Mode, the Extended Address Register is used as the 4th address byte A[31:24] to access memory regions beyond 128Mb. The Read Extended Address Register instruction is entered by driving /CS low and shifting the instruction code \"C8h\" into the DI pin on the rising edge of CLK. The Extended Address Register bits are then shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first as shown in Figure 10.\n\nWhen the device is in the 4-Byte Address Mode, the Extended Address Register is not used.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 36,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Extended Address Register is a volatile register that stores the 4th byte address (A31-A24) when the device is operating in the 3-Byte Address Mode (ADS=0). To write the Extended Address Register bits, a Write Enable (06h) instruction must previously have been executed for the device to accept the Write Extended Address Register instruction (Status Register bit WEL must equal 1). Once write enabled, the instruction is entered by driving /CS low, sending the instruction code \"C5h\", and then writing the Extended Address Register data byte as illustrated in Figure 11.\n\nUpon power up or the execution of a Software/Hardware Reset, the Extended Address Register bit values will be cleared to 0.\n\nThe Extended Address Register is only effective when the device is in the 3-Byte Address Mode. When the device operates in the 4-Byte Address Mode (ADS=1), any command with address input of A31-A24 will replace the Extended Address Register values. It is recommended to check and update the Extended Address Register if necessary when the device is switched from 4-Byte to 3-Byte Address Mode.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 37,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.8 Enter 4-Byte Address Mode (B7h) \nThe Enter 4 -Byte Address Mode instruction (Figure 12) will allow 32 -bit address (A31 -A0) to be used to access the memory array beyond 128Mb. The Enter 4-Byte Address Mode instruction is entered by driving /CS low, shifting the instruction code \"B7h\" into the DI pin and then driving /CS high.\n\n8.2.9 Exit 4-Byte Address Mode (E9h)\nIn order to be backward compatible, the Exit 4 -Byte Address Mode instruction (Figure 13) will only allow 24-bit address (A2 3-A0) to be used to access the memory array up to 128Mb. The Extended Address Register must be used to access the memory array beyond 128Mb. The Exit 4 -Byte Address Mode instruction is entered by driving /CS low, shifting the instruction code \"E9h\" into th e DI pin and then driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 38,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.10 Read Data (03h)\nThe Read Data instruction allows one or more data bytes to be sequentially read from the memory. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"03h\" followed by a 32/24-bit address (A31/A23-A0) into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory loc ation will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first. The address is automatically incremented to the next higher address after each byte of data is shifted out allowing for a continuous stream of data. T his means that the entire memory can be accessed with a single instruction as long as the clock continues. The instruction is completed by driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 39,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.11 Read Data with 4-Byte Address (13h)\nThe Read Data with 4-Byte Address instruction is similar to the Read Data (03h) instruction. Instead of 24-bit address, 32-bit address is needed following the instruction code 13h. No matter the device is operating in 3 -Byte Address Mode or 4 -byte Address Mode, the Re ad Data with 4 -Byte Address instruction will always require 32-bit address to access the entire 512Mb memory.\n\nThe Read Data with 4-Byte Address instruction sequence is shown in Figure 15. If this instruction is issued while an Erase, Program or Write cycle is in process (BUSY=1) the instruction is ignored and will not have any effects on the current cycle. The Read Data with 4 -Byte Address instruction allows clock rates from D.C. to a maximum of fR (see AC Electrical Characteristics).",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 40,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction is similar to the Read Data instruction except that it can operate at the highest possible frequency of FR (see AC Electrical Characteristics). This is accomplished by adding eight \"dummy\" clocks after the 24/32-bit address as shown in Figure 16. The dummy clocks allow the devices internal circuits additional time for setting up the initial address. During the dummy clocks the data value on the DO pin is a \"don't care\".",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 41,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read with 4-Byte Address instruction is similar to the Fast Read instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the Read Data with 4-Byte Address instruction will always require 32-bit address to access the entire 512Mb memory. The Fast Read with 4-Byte Address (0Ch) instruction is only supported in Standard SPI mode.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 42,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual Output (3Bh) instruction is similar to the standard Fast Read (0Bh) instruction except that data is output on two pins; IO0 and IO1. This allows data to be transferred at twice the rate of standard SPI devices. The Fast Read Dual Output instruction is ideal for quickly downloading code from Flash to RAM upon power-up or for applications that cache code-segments to RAM for execution. Similar to the Fast Read instruction, the Fast Read Dual Output instruction can operate at the highest possible frequency of FR (see AC Electrical Characteristics). This is accomplished by adding eight \"dummy\" clocks after the 24/32-bit address as shown in Figure 19. The dummy clocks allow the device's internal circuits additional time for setting up the initial address. The input data during the dummy clocks is \"don't care\". However, the IO0 pin should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 43,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual Output with 4-Byte Address (3Ch) instruction is only supported in Standard SPI mode.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 44,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad Output (6Bh) instruction is similar to the Fast Read Dual Output (3Bh) instruction except that data is output on four pins, IO 0, IO 1, IO 2, and IO 3. The Quad Enable (QE) bit in Status Register-2 must be set to 1 before the device will accept the Fast Read Quad Output Instruction. The Fast Read Quad Output Instruction allows data to be transferred at four times the rate of standard SPI devices.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 45,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad Output with 4-Byte Address (6Ch) instruction is only supported in Standard SPI mode.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 46,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BBh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Address bits (A23/A31 -0) two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 47,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O with 4-Byte Address (BCh) instruction is similar to the Fast Read Dual I/O instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the Fast Read Dual I/O with 4-Byte Address instruction will always require 32-bit address to access the entire 512Mb memory.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 48,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad I/O (EBh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO0, IO1, IO2 and IO3 and four Dummy clocks are required in SPI mode prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Fast Read Quad I/O Instruction.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 49,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad I/O with 4-Byte Address (ECh) instruction is only supported in Standard SPI mode. Fast Read Quad I/O with 4-Byte Address Configurable \"Dummy Clocks\" and \"Wrap Length\" The number of \"dummy clocks\" and \"wrap length\" of the \"Fast Read Quad I/O with4-Byte Address (ECh)\" instruction in SPI mode are configurable. In standard SPI mode and before executing the Fast Read Quad I/O instruction, the number of \"dummy clocks\" can be configured by the \"Set Read Parameters (C0h)\" instruction. Depending on the Read Parameter Bits P[6:4] setting, the number of dummy clocks can be configured as either 6, 8, 10, 12, 14, or 16. The default number of dummy clocks upon power up or after a Reset instruction is 6.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 50,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Set Burst with Wrap (77h) instruction is used in conjunction with \"Fast Read Quad I/O\" instruction to access a fixed length of 8/16/32/64-byte section within a 256-byte page. Certain applications can benefit from this feature and improve the overall system code execution performance. Once W6-4 is set by a Set Burst with Wrap instruction, all the following \"Fast Read Quad I/O\" instruction will use the W6-4 setting to access the 8/16/32/64-byte section within any page. To exit the \"Wrap Around\" function and return to normal read operation, another Set Burst with Wrap instruction should be issued to set W4 = 1. The default value of W4 upon power on or after a software/hardware reset is 1.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 51,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "\"Set Read Parameters (C0h)\" instruction is used to accommodate a wide range of applications with different needs for either maximum read frequency or minimum data access latency. This is accomplished by setting the number of dummy clocks and wrap length configurations for set of selected instructions. In SPI mode, SPI Set Read Parameters (C0h)\" instruction writes to 'Dummy Clocks' P[6: 4] bits only, while it will ignore 'Wrap Length' P[1:0] bits input as they are don't care in SPI mode. The Set Read Parameters instruction sequence is shown in Figure 54. Set Read Parameters instruction (SPI) is used to configure the number of dummy cycles through P[6:4] Read Parameter bits for the following SPI, instructions: - Standard SPI mode: Fast Read Quad I/O (EBh/ECh) instruction",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 53,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Page Program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Page Program Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"02h\" followed by a 24/32-bit address (A23/A31-A0) and at least one data byte, into the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being sent to the device.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 54,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Page Program with 4-Byte Address instruction is similar to the Page Program instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the Page Program with 4-Byte Address instruction will always require 32-bit address to access the entire 512Mb memory.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 55,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Quad Page Program instruction allows up to 256 bytes of data to be programmed at previously erased (FFh) memory locations using four pins: IO 0, IO 1, IO 2, and IO 3. The Quad Page Program can improve performance for PROM Programmer and applications that have slow clock speeds <5MHz.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 56,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Quad Input Page Program with 4-Byte Address instruction is similar to the Quad Input Page Program instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the Quad Input Page Program with 4-Byte Address instruction will always require 32-bit address to access the entire 512Mb memory.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 57,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Sector Erase instruction sets all memory within a specified sector (4K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Sector Erase Instruction (Status Register bit WEL must equal 1). The Sector Erase instruction will not be executed if the addressed page is protected by the Block Protect (CMP, TB, BP3, BP2, BP1, and BP0) bits or the Individual Block/Sector Locks.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 58,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.29 Sector Erase with 4-Byte Address (21h) \nThe Sector Erase with 4-Byte Address instruction is similar to the Sector Erase instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the Sector Erase with 4-Byte Address instruction will always require 32-bit address to access the entire 512Mb memory.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 59,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.30 32KB Block Erase (52h)\nThe Block Erase instruction sets all memory within a specified block (32K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"52h\" followed a 24/32-bit block address (A23/A31-A0).",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 60,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.31 64KB Block Erase (D8h)\nThe Block Erase instruction sets all memory within a specified block (64K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"D8h\" followed a 24/32-bit block address (A23/A31-A0).",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 61,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The 64KB Block Erase with 4 -Byte Address instruction is  similar to the 64KB Block Erase instruction except that it requires 32-bit address instead of 24-bit address. No matter the device is operating in 3-Byte Address Mode or 4-byte Address Mode, the 64KB Block Erase with 4 -Byte Address instruction will always require 32-bit address to access the entire 256Mb memory.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 62,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Chip Erase instruction sets all memory within the  device to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Chip Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting t he instruction code \"C7h\" or \"60h\". The Chip Erase instruction sequence is shown in Figure 41.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 63,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Suspend instruction \"75h\", allows the system to interrupt a Sector or Block Erase operation or a Page Program operation and then read from or program/erase data to, any other sectors or blocks. The Erase/Program Suspend instruction sequence is shown in Figure 42.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 64,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Resume instruction \"7Ah\" must be written to resume the Sector or Block Erase operation or the Page Program operation after an Erase/Program Suspend. The Resume instruction \"7Ah\" will be accepted by the device only if the SUS bit in the Status Register equals to 1 and the BUSY bit equals to 0. After issued the SUS bit will be cleared from 1 to 0 immediately, the BUSY bit will be set from 0 to 1 within 200ns and the Sector or Block will complete the erase operation or the page will complete the program operation.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 65,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Although the standby current during normal operation is relatively low, standby current can be further reduced with the Power-down instruction. The lower power consumption makes the Power-down instruction especially useful for battery powered applications (See ICC1 and ICC2 in AC Characteristics). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"B9h\" as shown in Figure 44.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 66,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Release from Power-down / Device ID instruction is a multi-purpose instruction. It can be used to release the device from the power-down state, or obtain the devices electronic identification (ID) number. To release the device from the power-down state, the instruction is issued by driving the /CS pin low, shifting the instruction code \"ABh\" and driving /CS high as shown in Figure 45. Release from power-down will take the time duration of tRES1 (See AC Characteristics) before the device will resume normal operation and other instructions are accepted.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 67,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer/Device ID instruction is an alternative to the Release from Power-down / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"90h\" followed by a 24-bit address (A23-A0) of 000000h. After which, the Manufacturer ID for Winbond (EFh) and the Device ID are shifted out on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 46. The Device ID values for the W25Q512JV are listed in Manufacturer and Device Identification table. The instruction is completed by driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 68,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer / Device ID Dual I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 2x speed. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"92h\" followed by a 24/32-bit address (A23/A31-A0) of 000000h, but with the capability to input the Address bits two bits per clock. After which, the Manufacturer ID for Winbond (EFh) and the Device ID are shifted out 2 bits per clock on the falling edge of CLK with most significant bits (MSB) first as shown in Figure 47. The Device ID values for the W25Q512JV are listed in Manufacturer and Device Identification table. The Manufacturer and Device IDs can be read continuously, alternating from one to the other. The instruction is completed by driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 69,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer / Device ID Quad I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 4x speed. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"94h\" followed by a four clock dummy cycles and then a 24/32-bit address (A23/A31-A0) of 000000h, but with the capability to input the Address bits four bits per clock. After which, the Manufacturer ID for Winbond (EFh) and the Device ID are shifted out four bits per clock on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 48. The Device ID values for the W25Q512JV are listed in Manufacturer and Device Identification table. The Manufacturer and Device IDs can be read continuously, alternating from one to the other. The instruction is completed by driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 70,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Unique ID Number instruction accesses a factory-set read-only 64-bit number that is unique to each W25Q512JV device. The ID number can be used in conjunction with user software methods to help prevent copying or cloning of a system.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 71,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "For compatibility reasons, the W25Q512JV provides several instructions to electronically determine the identity of the device. The Read JEDEC ID instruction is compatible with the JEDEC standard for SPI compatible serial memories that was adopted in 2003.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 72,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q512JV features a 256-Byte Serial Flash Discoverable Parameter (SFDP) register that contains information about device configurations, available instructions and other features. The SFDP parameters are stored in one or more Parameter Identification (PID) tables. Currently only one PID table is specified, but more may be added in the future.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 73,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q512JV offers three 256-byte Security Registers which can be erased and programmed individually. These registers may be used by the system manufacturers to store security and other important information separately from the main memory array. \n\nThe Erase Security Register instruction is similar to the Sector Erase instruction. A Write Enable instruction must be executed before the device will accept the Erase Security Register Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"44h\" followed by a 24/32-bit address (A23/A31-A0) to erase one of the three security registers.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 74,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Program Security Register instruction is similar to the Page Program instruction. It allows from one byte to 256 bytes of security register data to be programmed at previously erased (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Program Security Register Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"42h\" followed by a 24/32-bit address (A23/A31-A0) and at least one data byte, into the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being sent to the device.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 75,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Security Register instruction is similar to the Fast Read instruction and allows one or more data bytes to be sequentially read from one of the four security registers. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"48h\" followed by a 24/32-bit address (A23/A31-A0) and eight \"dummy\" clocks into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 76,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register-3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, TB, BP[3:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 77,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register-3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, TB, BP[3:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 78,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register-3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, TB, BP[3:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 79,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.50 Global Block/Sector Lock (7Eh) \nAll Block/Sector Lock bits can be set to 1 by the Global Block/Sector Lock instruction. The command must be issued by driving /CS low, shifting the instruction code \"7Eh\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high.\n\n8.2.51 Global Block/Sector Unlock (98h)\nAll Block/Sector Lock bits can be set to 0 by the Global Block/Sector Unlock instruction. The command must be issued by driving /CS low, shifting the instruction code \"98h\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 80,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.52 Enable Reset (66h) and Reset Device (99h)\nBecause of the small package and the limitation on the number of pins, the W25Q512JV provide a software Reset instruction instead of a dedicated RESET pin. Once the Reset instruction is accepted, any on-going internal operations will be terminated and the device will return to its default power-on state and lose all the current volatile settings, such as Volatile Status Register bits, Write Enable Latch (WEL) status, Program/Erase Suspend status, Read parameter setting (P7-P0), and Wrap Bit setting (W6-W4).",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 81,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9. ELECTRICAL CHARACTERISTICS\n\n9.1 Absolute Maximum Ratings (1)\n\n9.2 Operating Ranges",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 82,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "PARAMETER SYMBOL \nSPEC \nUNIT \nMIN MAX \nVCC (min) to /CS Low  tVSL(1)  20  µs \nTime Delay Before Write Instruction  tPUW(1)  5  ms \nWrite Inhibit Threshold Voltage  VWI(1)  1.0 1.4 V \nThe minimum duration for e nsuring \ninitialization will occur \ntPWD(1) 100  µs \nVCC voltage needed to below V PWD for \nensuring initialization will occur \nVPWD(1)  0.9 V",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 83,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.3.1 Power Cycle Requirement \nFor power cycle, the system must not initial the power -up sequence until Vcc drops down to V PWD and                   \nkeeps a tPWD for device to initialize correctly.",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    },
    {
      "page_number": 84,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "PARAMETER SYMBOL CONDITIONS \nSPEC \nUNIT \nMIN TYP MAX \nInput Capacitance CIN(1) VIN = 0V   6 pF \nOutput Capacitance Cout(1) VOUT = 0V   8 pF \nInput Leakage ILI    ±2 µA \nI/O Leakage ILO    ±2 µA \nStandby Current  ICC1  \n/CS = VCC,  \nVIN = GND or VCC (85℃)  10 60 µA \n/CS = VCC,  \nVIN = GND or VCC(105℃)  10 300 µA \nPower-down Current  ICC2 \n/CS = VCC,  \nVIN = GND or VCC(85℃)   1 20 µA \n/CS = VCC,  \nVIN = GND or VCC(105℃)  10 30 µA \nCurrent Read Data / \nDual /Quad 50MHz(2) ICC3 C = 0.1 VCC / 0.9 VCC  \nDO = Open  20 35 mA \nCurrent Read Data / \nDual Output Read/Quad \nOutput Read 104MHz(2) \nICC3 C = 0.1 VCC / 0.9 VCC  \nDO = Open  25 40 mA \nCurrent Write Status \nRegister ICC4 /CS = VCC   20 25 mA \nCurrent Page Program  ICC5 /CS = VCC   20 25 mA \nCurrent Sector/Block \nErase ICC6 /CS = VCC   20 25 mA \nCurrent Chip Erase ICC7 /CS = VCC   20 25 mA \nInput Low Voltage  VIL  –0.5  VCC x 0.3 V \nInput High Voltage VIH  VCC x 0.7  VCC + 0.4 V \nOutput Low Voltage VOL IOL = 100 µA    0.2 V \nOutput High Voltage VOH IOH = –100 µA VCC – 0.2   V",
      "grade": "A",
      "maker_pn": "W25Q512JV",
      "part number": "1107-007424"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The W25Q512JV (512M-bit) Serial Flash memory provides a compact storage solution for systems with limited space, pins and power. It operates on a single 2.7V to 3.6V power supply with low power consumption of 1µA in power-down mode. The device is ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP), and storing voice, text and data.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      },
      {
        "content": "The W25Q512JV array is organized into 262,144 programmable pages of 256-bytes each, with up to 256 bytes programmable at a time. Pages can be erased in groups of 16 (4KB sector erase), 128 (32KB block erase), 256 (64KB block erase) or the entire chip (chip erase). It has 16,384 erasable 4KB sectors and 1,028 erasable 64KB blocks, allowing flexibility in applications requiring data and parameter storage.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      },
      {
        "content": "The W25Q512JV supports the standard Serial Peripheral Interface (SPI), Dual/Quad I/O SPI with Serial Clock, Chip Select, Serial Data I/O0 (DI), I/O1 (DO), I/O2, and I/O3. It supports SPI clock frequencies of up to 133MHz, allowing equivalent clock rates of 266MHz for Dual I/O and 532MHz for Quad I/O when using the Fast Read Dual/Quad I/O, outperforming standard Asynchronous 8 and 16-bit Parallel Flash memories.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      },
      {
        "content": "Additionally, the W25Q512JV supports JEDEC standard manufacturer and device ID, SFDP Register, a 64-bit Unique Serial Number and three 256-bytes Security Registers. The Standard/Dual/Quad SPI instruction set consists of 48 basic instructions controlled through the SPI bus, initiated with the falling edge of Chip Select (/CS) and the first byte providing the instruction code.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The W25Q512JV provides 3-Byte and 4-Byte addressing modes to access the entire 64MB (512Mb) memory array. It has features like Write Protection using Status Registers, Block/Sector Locks, Power-down mode, and Security Registers for storing sensitive data. The Status Registers provide information on write protection status, addressing mode, output driver strength, and other device configurations.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      },
      {
        "content": "The W25Q512JV supports a variety of read instructions like Read Data, Fast Read, Dual/Quad Output Reads, and Dual/Quad I/O Reads with configurable dummy clocks and wrap lengths for optimized performance in different applications. It also has instructions for writing data like Page Program, Quad Page Program as well as instructions for erasing data at sector, block and chip level.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      },
      {
        "content": "The device provides instructions for entering/exiting 4-Byte Address mode, reading Extended Address Register, setting Read Parameters, and other utility instructions like Read Manufacturer/Device ID, Read Unique ID, and reading Serial Flash Discoverable Parameters (SFDP). It has three 256-byte Security Registers that can be individually erased, programmed and read for storing sensitive information.",
        "part number": "1107-007424.pdf",
        "grade": "A",
        "maker_pn": "W25Q512JV"
      }
    ]
  },
  "part number": "1107-007424"
}