{
  "metadata": {
    "component_name": "W25N01GV",
    "manufacturer": "Winbond",
    "key_specifications": "1G-bit Serial SLC NAND Flash Memory with Dual/Quad SPI, Buffer Read & Continuous Read modes, 2.7V to 3.6V supply, low power (25mA active, 10uA standby), small packages (WSON, SOIC, TFBGA), ECC, write protection, bad block management",
    "applications": "Code shadowing to RAM, executing code directly from SPI (XIP), storing voice, text and data in systems with limited space, pins and power",
    "grade": "D",
    "maker_pn": "W25N01GV"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "3V 1G-BIT \nSERIAL SLC NAND FLASH MEMORY WITH \nDUAL/QUAD SPI \nBUFFER READ & CONTINUOUS READ",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 7,
      "categories": [
        "Product Summary"
      ],
      "content": "The W25N01GV (1G-bit) Serial SLC NAND Flash Memory provides a storage solution for systems with limited space, pins and power. The W25N SpiFlash family incorporates the popular SPI interface and the traditional large NAND non-volatile memory space. They are ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP) and storing voice, text and data. The device operates on a single 2.7V to 3.6V power supply with current consumption as low as 25mA active and 10µA for standby. All W25N SpiFlash family devices are offered in space-saving packages which were impossible to use in the past for the typical NAND flash memory.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 8,
      "categories": [
        "Packaging Information"
      ],
      "content": "W25N01GV is offered in an 8-pad WSON 8x6-mm (package code ZE), a 16-pin SOIC 300-mil (package code SF), and two 24-ball 8x6-mm TFBGA (package code TB & TC) packages as shown in Figure 1a-c respectively. Package diagrams and dimensions are illustrated at the end of this datasheet.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 9,
      "categories": [
        "Packaging Information"
      ],
      "content": "Figure 1b. W25N01GV Pin Assignments, 16-pin SOIC 300-mil (Package Code SF)\n\nPIN NO. PIN NAME I/O FUNCTION\n1 /HOLD (IO3) I/O Hold Input (Data Input Output 3)(2)\n2 VCC Power Supply\n... (pin descriptions omitted for brevity)",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 13,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "6.1.1 Standard SPI Instructions \nThe W25N01GV is accessed through an SPI compatible bus consisting of four signals: Serial Clock (CLK), Chip Select (/CS), Serial Data Input (DI) and Serial Data Output (DO). Standard SPI instructions use the DI input pin to serially write instructions, addresses or data to the device on the rising edge of CLK. The DO output pin is used to read data or status from the device on the falling edge of CLK.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 14,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "6.1.2 Dual SPI Instructions\nThe W25N01GV supports Dual SPI operation when using instructions such as \"Fast Read Dual Output (3Bh)\" and \"Fast Read Dual I/O (BBh)\". These instructions allow data to be transferred to or from the device at two to three times the rate of ordinary Serial Flash devices. The Dual SPI Read instructions are ideal for quickly downloading code to RAM upon power-up (code-shadowing) or for executing non-speed-critical code directly from the SPI bus (XIP). When using Dual SPI instructions, the DI and DO pins become bidirectional I/O pins: IO0 and IO1.\n\n6.1.3 Quad SPI Instructions\nThe W25N01GV supports Quad SPI operation when using instructions such as \"Fast Read Quad Output (6Bh)\", \"Fast Read Quad I/O (EBh)\" and \"Quad Program Data Load (32h/34h)\". These instructions allow data to be transferred to or from the device four to six times the rate of ordinary Serial Flash. The Quad Read instructions offer a significant improvement in continuous and random access transfer rates allowing fast code-shadowing to RAM or execution directly from the SPI bus (XIP). When using Quad SPI instructions the DI and DO pins become bidirectional IO0 and IO1, and the /WP and /HOLD pins become IO2 and IO3 respectively.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 15,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "6.2 Write Protection\nApplications that use non-volatile memory must take into consideration the possibility of noise and other adverse system conditions that may compromise data integrity. To address this concern, the W25N01GV provides several means to protect the data from inadvertent writes.\n\n- Device resets when VCC is below threshold\n- Write enable/disable instructions and automatic write disable after erase or program\n- Software and Hardware (/WP pin) write protection using Protection Register (SR-1)\n- Lock Down write protection for Protection Register (SR-1) until the next power-up\n- One Time Program (OTP) write protection for memory array using Protection Register (SR-1)\n- Hardware write protection using /WP pin when WP-E is set to 1",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 16,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Three Status Registers are provided for W25N01GV: Protection Register (SR-1), Configuration Register (SR-2) & Status Register (SR-3). Each register is accessed by Read Status Register and Write Status Register commands combined with 1-Byte Register Address respectively.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 17,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.2 Write Protection Enable Bit (WP-E) – Volatile Writable, OTP lockable\nThe Write Protection Enable bit (WP-E) is a volatile read/write bits in the status register-1 (S1). The WP-E bit, in conjunction with SRP1 & SRP0, controls the method of write protection: software protection, hardware protection, power supply lock-down or one time programmable (OTP) protection, /WP pin functionality, and Quad SPI operation enable/disable.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 18,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.2.1 One Time Program Lock Bit (OTP-L) – OTP lockable\nIn addition to the main memory array, W25N01GV also provides an OTP area for the system to store critical data that cannot be changed once it's locked. The OTP area consists of 10 pages of 2,112-Byte each. The default data in the OTP area are FFh. Only Program command can be issued to the OTP area to change the data from \"1\" to \"0\", and data is not reversible (\"0\" to \"1\") by the Erase command. Once the correct data is programmed in and verified, the system developer can set OTP-L bit to 1, so that the entire OTP area will be locked to prevent further alteration to the data.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 19,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "W25N01GV has a built-in ECC algorithm that can be used to preserve the data integrity. Internal ECC calculation is done during page programming, and the result is stored in the extra 64-Byte area for each page. During the data read operation, ECC engine will verify the data values according to the previously stored ECC information and to make necessary corrections if needed. The verification and correction status is indicated by the ECC Status Bit. ECC function is enabled by default when power on (ECC-E=1), and it will not be reset to 0 by the Device Reset command.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 20,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "W25N01GV provides two different modes for read operations, Buffer Read Mode (BUF=1) and Continuous Read Mode (BUF=0). Prior to any Read operation, a Page Data Read command is needed to initiate the data transfer from a specified page in the memory array to the Data Buffer. By default, after power up, the data in page 0 will be automatically loaded into the Data Buffer and the device is ready to accept any read commands.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 21,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "To facilitate the NAND flash memory bad block management, the W25N01GV is equipped with an internal Bad Block Management Look-Up-Table (BBM LUT). Up to 20 bad memory blocks may be replaced by a good memory block respectively. The addresses of the blocks are stored in the internal Look-Up Table as Logical Block Address (LBA, the bad block) & Physical Block Address (PBA, the good block). The LUT-F bit indicates whether the 20 memory block links have been fully utilized or not. The default value of LUT-F is 0, once all 20 links are used, LUT-F will become 1, and no more memory block links may be established.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 22,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.3.3 Program Failure (P-FAIL) – Status Only  \nThe Program Failure Bit is used to indicate whether the internally-controlled Program operation was executed successfully (P-FAIL = 0) or timed out (P-FAIL = 1). The P-FAIL bit is also set when the Program command is issued to a locked or protected memory array or OTP area. This bit is cleared at the beginning of the Program Execute instruction on an unprotected memory array or OTP area. Device Reset instruc tion can also clear the P-FAIL bit.\n\n7.3.4 Erase Failure (E-FAIL) – Status Only  \nThe Erase Failure Bit is used to indicate whether the internally -controlled Erase operation was executed successfully (E-FAIL = 0) or timed out (E -FAIL = 1). The E-FAIL bit is also set when the Erase command is issued to a locked or protected memory array. This bit is cleared at the beginning of the Block Erase instruction on an unprotected memory array. Device Reset instruction can also clear the E-FAIL bit.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 23,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "7.4 W25N01GV Status Register Memory Protection\nSTATUS REGISTER(1) W25N01GV (1G-BIT / 128M-BYTE) MEMORY PROTECTION(2)\n\n(Table content showing memory protection configurations)",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 24,
      "categories": [
        "Product Summary"
      ],
      "content": "8. INSTRUCTIONS  \nThe Standard/Dual/Quad SPI instruction set of the W25N01GV consists of 27 basic instructions that are fully controlled through the SPI bus (see Instruction Set Table1, 2). Instructions are initiated with the falling edge of Chip Select (/CS). The first byte of data clo cked into the DI  input provides the i nstruction code. Data on the DI input is sampled on the rising edge of clock with most significant bit (MSB) first.\n\n8.1 Device ID and Instruction Set Tables\n8.1.1 Manufacturer and Device Identification\nMANUFACTURER ID (MF7 - MF0)\nWinbond Serial Flash EFh\n\nDevice ID (ID15 - ID0)\nW25N01GV AA21h",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 28,
      "categories": [
        "Product Summary"
      ],
      "content": "Notes:\n1. Output designates data output from the device.\n2. Column Address (CA) only requires CA[11:0], CA[15:12] are considered as dummy bits.\n3. Page Address (PA) requires 16 bits. PA[15:6] is the address for 128KB blocks (total 1,024 blocks), PA[5:0] is the address for 2KB pages (total 64 pages for each block).\n4. Logical and Physical Block Address (LBA & PBA) each consists of 16 bits. LBA[9:0] & PBA[9:0] are effective Block Addresses. LBA[15:14] is used for additional information.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 29,
      "categories": [
        "Product Summary"
      ],
      "content": "8.2.1 Device Reset (FFh)\nBecause of the small package and the limitation on the number of pins, the W25N01GV provide a software Reset instruction instead of a dedicated RESET pin. Once the Reset instruction is accepted, any on-going internal operations will be terminated and the device state bits will follow the below table. Once the Reset command is accepted by the device, the device will take approximately tRST to reset, depending on the current operation the device is performing, tRST can be 5us~500us. During this period, no command will be accepted.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 30,
      "categories": [
        "Product Summary"
      ],
      "content": "8.2.2 Read JEDEC ID (9Fh)\nThe Read JEDEC ID instruction is compatible with the JEDEC standard for SPI compatible serial memories that was adopted in 2003. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"9Fh\" followed by 8 dummy clocks. The JEDEC assigned Manufacturer ID byte for Winbond (EFh) and two Device ID bytes are then shifted out on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 6. For memory type and capacity values refer to Manufacturer and Device Identification table.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 31,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Status Register instructions allow the 8-bit Status Registers to be read. The instruction is entered by driving /CS low and shifting the instruction code \" 0Fh or 05h\" into the DI pin on the rising edge of CLK followed by an 8-bit Status Register Address. The status register bits are then shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first as shown in Figure 7. Refer to section 7.1-3 for Status Register descriptions.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 32,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Write Status Register instruction allows the Status Registers to be written. The writable Status Register bits include: SRP [1:0], TB, BP[3:0] and WP-E bit in Status Register-1; OTP-L, OTP-E, SR1-L, ECC-E and BUF bit in Status Register-2. All other Status Register bit locations are read-only and will not be affected by the Write Status Register instruction.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 33,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Write Enable instruction (Figure 9) sets the Write Enable Latch (WEL) bit in the Status Register to a 1. The WEL bit must be set prior to every Page Program, Quad Page Program, Block Erase and Bad Block Management instruction. The Write Enable instruction is entered by driving /CS low, shifting the instruction code \"06h\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high. \n\nThe Write Disable instruction (Figure 10) resets the Write Enable Latch (WEL) bit in the Status Register to a 0. The Write Disable instruction is entered by driving /CS low, shifting the instruction code \"04h\" into the DI pin and then driving /CS high. Note that the WEL bit is automatically reset after Power-up and upon completion of the Page Program, Quad Page Program, Block Erase, Reset and Bad Block Management instructions.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 34,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Due to large NAND memory density size and the technology limitation, NAND memory devices are allowed to be shipped to the end customers with certain amount of \"Bad Blocks\" found in the factory testing. Up to 2% of the memory blocks can be marked as \"Bad Blocks\" upon shipment, which is a maximum of 20 blocks for W25N01GV. In order to identify these bad blocks, it is recommended to scan the entire memory array for bad block markers set in the factory. A \"Bad Block Marker\" is a non-FFh data byte stored at Byte 0 of Page 0 for each bad block. An additional marker is also stored in the first two bytes of the 64-Byte spare area.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 35,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The internal Look Up Table (LUT) consists of 20 Logical-Physical memory block links (from LBA0/PBA0 to LBA19/PBA19). The \"Read BBM Look Up Table\" command can be used to check the existing address links stored inside the LUT.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 36,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "To better manage the data integrity, W25N01GV implements internal ECC correction for the entire memory array. When the ECC-E bit in the Status/Configuration Register is set to 1 (also power up default), the internal ECC algorithm is enabled for all Program and Read operations. During a \"Program Execute\" command for a specific page, the ECC algorithm will calculate the ECC information based on the data inside the 2K-Byte data buffer and write the ECC data into the extra 64-Byte ECC area in the same physical memory page. During the Read operations, ECC information will be used to verify the data read out from the physical memory array and possible corrections can be made to limited amount of data bits that contain errors. The ECC Status Bits (ECC-1 & ECC-0) will also be set indicating the result of ECC calculation.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 37,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The 128KB Block Erase instruction sets all memory within a specified block ( 64-Pages, 128K-Bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"D8h\" followed by 8-bit dummy clocks and the 16-bit page address.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 38,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Program operation allows from one byte to 2,112 bytes (a page) of data to be programmed at previously erased (FFh) memory locations. A Program operation involves two steps: 1. Load the program data into the Data Buffer. 2. Issue \"Program Execute\" command to transfer the data from Data Buffer to the specified memory page. A Write Enable instruction must be executed before the device will accept the Load Program Data Instructions (Status Register bit WEL= 1).",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 39,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The \"Quad Load Program Data\" and \"Quad Random Load Program Data\" instructions are identical to the \"Load Program Data\" and \"Random Load Program Data\" in terms of operation sequence and functionality. The only difference is that \"Quad Load\" instructions will input the data bytes from all four IO pins instead of the single DI pin. This method will significantly shorten the data input time when a large amount of data needs to be loaded into the Data Buffer.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 40,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Program Execute instruction is the second step of the Program operation. After the program data are loaded into the 2, 112-Byte Data Buffer  (or 2,048 bytes when ECC is enabled) , the Program Execute instruction will program the Data Buffer content into the physical memory p age that is specified in the instruction.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 41,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Page Data Read instruction will transfer the data of the specified memory page into the 2,112-Byte Data Buffer. The instruction is initiated by driving the  /CS pin low then shifting the instruction code \"13h\" followed by 8-bit dummy clocks and the 16-bit Page Address into the DI pin as shown in Figure 18.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 42,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Data instruction allows one or more data bytes to be sequentially read from the Data Buffer after executing the Read Page Data instruction . The Read Data instruction is initiated by driving the /CS pin low and then shifting the instruction code \"03h\"  followed by the 16-bit Column Address and 8-bit dummy clocks or a 24-bit dummy clocks into the DI pin.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 43,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction allows one or more data bytes to be sequentially read from the Data Buffer after executing the Read Page Data instruction. The Fast Read instruction is initiated by driving the /CS pin low and then shifting the instruction code \"0Bh\" followed by the 16-bit Column Address and 8-bit dummy clocks or a 32-bit dummy clocks into the DI pin. After the address is received, the data byte of the addressed Data Buffer location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 44,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction allows one or more data bytes to be sequentially read from the Data Buffer after executing the Read Page Data instruction. The Fast Read instruction is initiated by driving the /CS pin low and then shifting the instruction code \"0Ch\" followed by the 16-bit Column Address and 24-bit dummy clocks (when BUF=1) or a 40-bit dummy clocks (when BUF=0) into the DI pin. After the address is received, the data byte of the addressed Data Buffer location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 45,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual Output (3Bh) instruction is similar to the standard Fast Read (0Bh) instruction except that data is output on two pins ; IO0 and IO1. This allows data to be transferred at twice the rate of standard SPI devices.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 46,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual Output (3Ch) instruction is similar to the standard Fast Read (0Bh) instruction except that data is output on two pins; IO0 and IO1. This allows data to be transferred at twice the rate of standard SPI devices.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 47,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad Output (6Bh) instruction is similar to the Fast Read Dual Output (3Bh) instruction except that data is output on four pins, IO0, IO1, IO2, and IO3. The Fast Read Quad Output Instruction allows data to be transferred at four times the rate of standard SPI devices.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 48,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad Output (6Ch) instruction is similar to the Fast Read Dual Output (3Bh) instruction except that data is output on four pins, IO0, IO1, IO2, and IO3. The Fast Read Quad Output Instruction allows data to be transferred at four times the rate of standard SPI devices.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 49,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BBh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Column Address or the dummy clocks two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 50,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BCh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Column Address or the dummy clocks two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 51,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad I/O (EBh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO0, IO1, IO2 and IO3 prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 52,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "Figure 28b. Fast Read Quad I/O Instruction (Continuous Read Mode, BUF=0)",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 53,
      "categories": [
        "Product Summary"
      ],
      "content": "8.2.25 Fast Read Quad I/O with 4-Byte Address (ECh) \n\nThe Fast Read Quad I/O (ECh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO 0, IO1, IO2 and IO3 prior to the data output. The Quad I/O dramatically reduces instruction overhead all owing faster random access for code execution (XIP) directly from the Quad SPI.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 54,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 29b. Fast Read Quad I/O with 4-Byte Address Instruction (Continuous Read Mode, BUF=0)",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 55,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "To access these additional data pages, the OTP-E bit in Status Register-2 must be set to \"1\" first. Then, Read operations can be performed on Unique ID and Parameter Pages, Read and Program operations can be performed on the OTP pages if it's not already locked. To return to the main memory array operation, OTP-E bit needs to be to set to 0.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 56,
      "categories": [
        "Product Summary"
      ],
      "content": "The Parameter Page contains 3 identical copies of the 256-Byte Parameter Data. The table below lists all the key data byte locations. All other unspecified byte locations have 00h data as default.\n\nByte Number\tDescriptions\tValues\n0~3\tParameter page signature\t4Fh, 4Eh, 46h, 49h\n4~5\tRevision number\t00h, 00h\n6~7\tFeature supported\t00h, 00h\n8~9\tOptional command supported\t02h, 00h\n...\n254~255\tIntegrity CRC\t0Fh, 3Dh\n256~511\tValue of bytes 0~255\n512~767\tValue of bytes 0~255",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 57,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9. ELECTRICAL CHARACTERISTICS\n9.1 Absolute Maximum Ratings\nPARAMETERS\tSYMBOL\tCONDITIONS\tRANGE\tUNIT\nSupply Voltage\tVCC\t\t–0.6 to +4.6\tV\n...\nNotes:\n1. This device has been designed and tested for the specified operation ranges. Proper operation outside of these levels is not guaranteed. Exposure to absolute maximum ratings may affect device reliability. Exposure beyond absolute maximum ratings may cause permanent damage.\n2. Compliant with JEDEC Standard J-STD-20C for small body Sn-Pb or Pb-free (Green) assembly and the European directive on restrictions on hazardous substances (RoHS) 2002/95/EU.\n3. JEDEC Standard JESD22-A114A (C1=100pF, R1=1500 ohms, R2=500 ohms).\n\n9.2 Operating Ranges\nPARAMETER\tSYMBOL\tCONDITIONS\tSPEC\tUNIT\n\t\t\tMIN\tMAX\nSupply Voltage\tVCC\t\t2.7\t3.6\tV\nAmbient Temperature, Operating\tTA\tIndustrial Grade\t\t+85\t°C\n\t\tIndustrial Plus Grade\t–40\t+105\t°C",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 58,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.3 Power-up Power-down Timing Requirements \n\nPARAMETER SYMBOL \nSPEC \nUNIT \nMIN MAX \nVCC (min) to /CS low tVSL(1) 200  µs \nTime Delay Before Write Instruction  tPUW(1) 1  ms \nMinimum duration for ensuring initialization will occur tPWD (1) 1  ms \nVCC voltage for ensuring initialization will occur VPWD(1)  0.7 V",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 59,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.4 DC Electrical Characteristics \n\nPARAMETER SYMBOL CONDITIONS \nSPEC \nUNIT \nMIN TYP MAX \nInput Capacitance CIN(1) VIN = 0V(1)   6 pF \nOutput Capacitance Cout(1) VOUT = 0V(1)   8 pF \nInput Leakage ILI    ±2 µA \nI/O Leakage ILO    ±2 µA \nStandby Current ICC1  \n/CS = VCC,  \nVIN = GND or VCC(85°C)   \n10 \n50 \nµA \nCS = VCC,  \nVIN = GND or VCC(105°C)  100 \nRead Current ICC2 C = 0.1 VCC / 0.9 VCC  \nDO = Open  25 35 mA \nCurrent Page Program  ICC3 /CS = VCC   25 35 mA \nCurrent Block Erase ICC4 /CS = VCC   25 35 mA \nInput Low Voltage  VIL  - 0.3  VCC x 0.3 V \nInput High Voltage VIH  VCC x 0.7  VCC + 0.3 V \nOutput Low Voltage VOL IOL = 2.1mA    0.4 V \nOutput High Voltage VOH IOH = –400 µA 2.4   V",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 60,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.5 AC Measurement Conditions \n\nPARAMETER SYMBOL \nSPEC \nUNIT \nMIN MAX \nLoad Capacitance CL  30 pF \nInput Rise and Fall Times  TR, TF  5 ns \nInput Pulse Voltages  VIN 0.1 VCC to 0.9 VCC V \nInput Timing Reference Voltages  IN 0.3 VCC to 0.7 VCC V \nOutput Timing Reference Voltages  OUT 0.5 VCC V",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 61,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.6 AC Electrical Characteristics(3) \nDESCRIPTION SYMBOL ALT \nSPEC \nUNIT \nMIN TYP MAX \nClock frequency for all instructions FR fC1 D.C.  104 MHz \nClock High, Low Time \nfor all instructions \ntCLH, \ntCLL(1) \n 45%PC   ns \nClock Rise Time peak to peak  tCLCH(2)  0.1   V/ns \nClock Fall Time peak to peak  tCHCL(2)  0.1   V/ns",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 62,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "AC Electrical Characteristics (cont'd) \nDESCRIPTION SYMBOL ALT \nSPEC \nUNIT \nMIN TYP MAX \n/CS Active Setup Time relative to CLK tSLCH tCSS 5   ns \n/CS Not Active Hold Time relative to CLK tCHSL  5   ns \nData In Setup Time  tDVCH tDSU 2   ns \nData In Hold Time  tCHDX tDH 3   ns \n/CS Active Hold Time relative to CLK tCHSH  3   ns \n/CS Not Active Setup Time relative to CLK tSHCH  3   ns \n/CS Deselect Time (for Array Read  Array Read)   tSHSL1 tCSH 10   ns \n/CS Deselect Time (for Erase, Program or Read \nStatus Registers  Read Status Registers) tSHSL2 tCSH 50   ns \nOutput Disable Time tSHQZ(2) tDIS   7 ns \nClock Low to Output Valid tCLQV tV   7 ns \nOutput Hold Time  tCLQX tHO 2   ns \n/HOLD Active Setup Time relative to CLK tHLCH  5   ns \n/HOLD Active Hold Time relative to CLK tCHHH  5   ns \nContinued – next page",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 64,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "The W25N01GV may have initial invalid blocks when it ships from factory. Also, additional invalid blocks may develop during the use of the device. Nvb represents the minimum number of valid blocks in the total number of available blocks (See Table 10.1). An invalid block is defined as blocks that contain bad bits uncorrectable by the on-chip ECC. The first eight blocks, block 0 to block 7 are guaranteed to be valid blocks at the time of shipment.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 65,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "After each program and erase operation, check the P-FAIL and E-FAIL bit to determine if the operation failed. In case of failure, a block replacement should be done with a bad-block management algorithm. The system has to use a minimum 1-bit ECC per 528 bytes of data to ensure data recovery.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 66,
      "categories": [
        "Packaging Information"
      ],
      "content": "Symbol Millimeters Inches \nMin Nom Max Min Nom Max \nA 0.70 0.75 0.80 0.028 0.030 0.031 \nA1 0.00 0.02 0.05 0.000 0.001 0.002 \nb 0.35 0.40 0.48 0.014 0.016 0.019 \nC --- 0.20 REF --- --- 0.008 REF --- \nD 7.90 8.00 8.10 0.311 0.315 0.319 \nD2 3.35 3.40 3.45 0.132 0.134 0.136 \nE 5.90 6.00 6.10 0.232 0.236 0.240 \nE2 4.25 4.30 4.35 0.167 0.169 0.171 \ne --- 1.27 --- --- 0.050 --- \nL 0.45 0.50 0.55 0.018 0.020 0.022 \ny 0.00 --- 0.050 0.000 --- 0.002",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 67,
      "categories": [
        "Packaging Information"
      ],
      "content": "11.2 16-Pin SOIC 300-mil (Package Code SF) \n\nSymbol Millimeters Inches \nMin Nom Max Min Nom Max \nA 2.36 2.49 2.64 0.093 0.098 0.104 \nA1 0.10 --- 0.30 0.004 --- 0.012 \nA2 --- 2.31 --- --- 0.091 --- \nb 0.33 0.41 0.51 0.013 0.016 0.020 \nC 0.18 0.23 0.28 0.007 0.009 0.011 \nD 10.08 10.31 10.49 0.397 0.406 0.413 \nE 10.01 10.31 10.64 0.394 0.406 0.419 \nE1 7.39 7.49 7.59 0.291 0.295 0.299 \ne 1.27 BSC 0.050 BSC \nL 0.38 0.81 1.27 0.015 0.032 0.050 \ny --- --- 0.076 --- --- 0.003 \nθ 0° --- 8° 0° --- 8°",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 69,
      "categories": [
        "Packaging Information"
      ],
      "content": "11.4 24-Ball TFBGA 8x6-mm (Package Code TC, 6x4 Ball Array) \n\nSymbol Millimeters Inches \nMin Nom Max Min Nom Max \nA --- --- 1.20 --- --- 0.047 \nA1 0.25 0.30 0.35 0.010 0.012 0.014 \nb 0.35 0.40 0.45 0.014 0.016 0.018 \nD 7.95 8.00 8.05 0.313 0.315 0.317 \nD1 5.00 BSC 0.197 BSC \nE 5.95 6.00 6.05 0.234 0.236 0.238 \nE1 3.00 BSC 0.118 BSC \ne 1.00 BSC 0.039 BSC \n\nNote: \nBall land: 0.45mm. Ball Opening: 0.35mm \nPCB ball land suggested <= 0.35mm",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 70,
      "categories": [
        "Packaging Information"
      ],
      "content": "W(1) 25N  01G  V  xx  x  \nW = Winbond \n25N = Serial SLC NAND Memory \n01G = 1G-bit \n \nV = 2.7V to 3.6V \n \nSF = 16-pin SOIC 300-mil                       ZE = 8-pad WSON 8x6mm \nTB = 24-ball TFBGA 8x6-mm (5x5 ball array)      TC  = 24-ball TFBGA 8x6-mm (6x4 ball array) \nI = Industrial Grade (-40°C to +85°C)  J = Industrial Plus Grade (-40°C to +105°C)  \n \n                 (2) \n \nG = Green Package (Lead-free, RoHS Compliant, Halogen-free (TBBA), Antimony-Oxide-free Sb2O3) \n         and BUF=1 is the default value after power up \nT = Green Package (Lead-free, RoHS Compliant, Halogen-free (TBBA), Antimony-Oxide-free Sb2O3) \n         and BUF=0 is the default value after power up \nR = Green Package (Lead-free, RoHS Compliant, Halogen-free (TBBA), Antimony-Oxide-free Sb2O3) \n     and BUF=1 is the fixed value. BUF bit can't be written to 0.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    },
    {
      "page_number": 71,
      "categories": [
        "Packaging Information",
        "Product Summary"
      ],
      "content": "The following table provides the valid part numbers for the W25N01GV SpiFlash Memory. Please contact Winbond for specific availability by density and package type. Winbond SpiFlash memories use a 12-digit Product Number for ordering. However, due to limited space, the Top Side Marking on all packages uses an abbreviated 11-digit number. \n\nPart Numbers for Industrial Grade Temperature:\n[Table listing part numbers and top side markings for various package types and densities]\n\nPart Numbers for Industrial Plus Grade Temperature:\n[Table listing part numbers and top side markings for various package types and densities]\n\nNote:\nW25N01GVxxxG: BUF=1 (Buffer Read Mode) is the default value after power up. BUF bit can be written to 0.\nW25N01GVxxxT: BUF=0 (Continuous Read Mode) is the default value after power up. BUF bit can be written to 1.\nW25N01GVxxxR: BUF=1 (Buffer Read Mode) is the fixed value. BUF bit can't be written to 0.",
      "grade": "D",
      "maker_pn": "W25N01GV",
      "part number": "1107-005665"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The W25N01GV (1G-bit) Serial SLC NAND Flash Memory is a storage solution for systems with limited space, pins and power. It incorporates the popular SPI interface and the traditional large NAND non-volatile memory space. It is ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP) and storing voice, text and data. The device operates on a single 2.7V to 3.6V power supply with low current consumption.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV has a Standard/Dual/Quad SPI instruction set consisting of 27 basic instructions fully controlled through the SPI bus. Instructions are initiated with the falling edge of Chip Select (/CS). The first byte provides the instruction code. Data on the DI input is sampled on the rising edge of clock with most significant bit (MSB) first. Key instructions include Device ID, Device Reset, Read JEDEC ID, and Fast Read Quad I/O with 4-Byte Address.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV includes a Parameter Page containing 3 identical copies of 256-Byte Parameter Data with information such as parameter page signature, revision number, feature supported, optional command supported, and integrity CRC. It also provides valid part numbers for Industrial Grade and Industrial Plus Grade Temperature ranges across various package types and densities.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The W25N01GV is a serial flash memory device that supports standard SPI, Dual SPI, and Quad SPI instructions for reading, writing, and erasing data. It has various features for write protection, including software protection, hardware protection using the /WP pin, power supply lock-down, and one-time programmable (OTP) protection. The device also has an OTP area for storing critical data that cannot be changed once locked, and an internal ECC algorithm for preserving data integrity.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV provides three status registers (Protection Register, Configuration Register, and Status Register) for controlling various device settings and monitoring the status of operations. It supports different read modes (Buffer Read Mode and Continuous Read Mode) and has a built-in Bad Block Management Look-Up Table (BBM LUT) for managing bad memory blocks. The device has status bits for indicating program and erase failures, and provides memory protection configurations based on the status register settings.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV has specific instructions for loading program data (including Quad Load Program Data), executing program operations, reading page data, and performing various read operations (Fast Read, Fast Read Dual Output, Fast Read Quad Output, Fast Read Dual I/O, Fast Read Quad I/O) with different data transfer rates. It also supports accessing additional data pages, such as the Unique ID and Parameter Pages, and the OTP pages if the OTP-E bit is set.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The datasheet provides detailed electrical characteristics, including absolute maximum ratings, operating ranges, power-up/power-down timing requirements, DC electrical characteristics (input/output capacitance, leakage currents, standby/read/program/erase currents, input/output voltage levels), AC measurement conditions, and AC electrical characteristics (clock frequency, setup/hold times, output disable/valid times) for various instructions and operations.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      }
    ],
    "Application Circuits": [
      {
        "content": "Figure 28b illustrates the Fast Read Quad I/O Instruction in Continuous Read Mode with BUF=0. This instruction allows for high-speed data transfer by utilizing four data lines (Quad I/O) and enabling continuous read mode.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "Figure 29b depicts the Fast Read Quad I/O with 4-Byte Address Instruction in Continuous Read Mode with BUF=0. This instruction is similar to the previous one but supports a 4-byte address, allowing access to larger memory spaces while maintaining high-speed data transfer through Quad I/O and continuous read mode.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The Fast Read Quad I/O and Fast Read Quad I/O with 4-Byte Address instructions are designed for efficient data retrieval from memory devices, such as NAND flash or EEPROM, by utilizing four data lines (Quad I/O) and enabling continuous read mode for improved throughput.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "These instructions are commonly used in applications that require high-speed data transfer from memory devices, such as embedded systems, data acquisition systems, or any application that needs to quickly access and process large amounts of data stored in memory.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "The W25N01GV provides several means to protect data integrity from inadvertent writes, including device resets when VCC is below threshold, write enable/disable instructions, automatic write disable after erase or program, software and hardware write protection using Protection Register (SR-1), Lock Down write protection for Protection Register (SR-1) until the next power-up, and One Time Program (OTP) write protection for memory array using Protection Register (SR-1).",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV has a Status Register (SR-1) that controls memory protection configurations. To access additional data pages like Unique ID, Parameter Pages, and OTP pages, the OTP-E bit in Status Register-2 must be set to '1'. To return to the main memory array operation, OTP-E bit needs to be set to 0.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The W25N01GV may have initial invalid blocks when shipped from the factory, and additional invalid blocks may develop during use. An invalid block is defined as blocks that contain bad bits uncorrectable by the on-chip ECC. The first eight blocks (block 0 to block 7) are guaranteed to be valid blocks at the time of shipment. After each program and erase operation, check the P-FAIL and E-FAIL bit to determine if the operation failed, and perform block replacement with a bad-block management algorithm. The system must use a minimum 1-bit ECC per 528 bytes of data to ensure data recovery.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      }
    ],
    "Packaging Information": [
      {
        "content": "W25N01GV is offered in an 8-pad WSON 8x6-mm (package code ZE), a 16-pin SOIC 300-mil (package code SF), and two 24-ball 8x6-mm TFBGA (package code TB & TC) packages as shown in Figure 1a-c respectively. Package diagrams and dimensions are illustrated at the end of this datasheet. The package dimensions and pin assignments for the 16-pin SOIC 300-mil (package code SF) are provided.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "The package dimensions for the 24-ball TFBGA 8x6-mm (package code TC, 6x4 ball array) are detailed, including specifications for ball land and ball opening sizes on the PCB. The part numbering scheme for W25N01GV is explained, with details on the meaning of each segment of the part number.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      },
      {
        "content": "Tables are provided listing the valid part numbers for the W25N01GV SpiFlash Memory in Industrial Grade Temperature and Industrial Plus Grade Temperature versions, across various package types and densities. The top side marking corresponding to each part number is also listed. Details are given on the meaning of the suffix letters G, T, and R related to the default and fixed values of the BUF bit.",
        "part number": "1107-005665.pdf",
        "grade": "D",
        "maker_pn": "W25N01GV"
      }
    ]
  },
  "part number": "1107-005665"
}