{
  "metadata": {
    "component_name": "W25Q128FV",
    "manufacturer": "Winbond",
    "key_specifications": "3V 128M-bit Serial Flash Memory with Dual/Quad SPI & QPI, SOIC/VSOP/WSON/TFBGA packages, up to 104MHz clock frequency, supports Standard/Dual/Quad SPI and QPI modes, various instructions for read/write/erase operations, security registers, status registers with protection features",
    "applications": "The datasheet does not explicitly mention main applications, but based on the features, it can be used in applications requiring non-volatile memory storage and code execution, such as embedded systems, Internet of Things (IoT) devices, industrial controllers, consumer electronics, etc.",
    "grade": "B",
    "maker_pn": "W25Q128FV"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "W25Q128FV \n\n3V 128M-BIT \nSERIAL FLASH MEMORY WITH \nDUAL/QUAD SPI & QPI",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 3,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1 Status Registers \n7.1.1 Erase/Write In Progress (BUSY) – Status Only\n7.1.2 Write Enable Latch (WEL) – Status Only\n7.1.3 Block Protect Bits (BP2, BP1, BP0) – Volatile/Non-Volatile Writable\n7.1.4 Top/Bottom Block Protect (TB) – Volatile/Non-Volatile Writable\n7.1.5 Sector/Block Protect Bit (SEC) – Volatile/Non-Volatile Writable\n7.1.6 Complement Protect (CMP) – Volatile/Non-Volatile Writable\n7.1.7 Status Register Protect (SRP1, SRP0) – Volatile/Non-Volatile Writable\n7.1.8 Erase/Program Suspend Status (SUS) – Status Only\n7.1.9 Security Register Lock Bits (LB3, LB2, LB1) – Volatile/Non-Volatile OTP Writable\n7.1.10 Quad Enable (QE) – Volatile/Non-Volatile Writable\n7.1.11 Write Protect Selection (WPS) – Volatile/Non-Volatile Writable\n7.1.12 Output Driver Strength (DRV1, DRV0) – Volatile/Non-Volatile Writable\n7.1.13 HOLD or /RESET Pin Function (HOLD/RST) – Volatile/Non-Volatile Writable",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 7,
      "categories": [
        "Packaging Information"
      ],
      "content": "3. PACKAGE TYPES AND PIN CONFIGURATIONS \n3.1 Pin Configuration SOIC / VSOP 208-mil \n3.2 Pad Configuration WSON 6x5-mm / 8x6-mm \n3.3 Pin Description SOIC / VSOP 208-mil, WSON 6x5-mm / 8x6-mm",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 8,
      "categories": [
        "Packaging Information"
      ],
      "content": "3.4 Pin Configuration SOIC 300-mil \n3.5 Pin Description SOIC 300-mil",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 9,
      "categories": [
        "Packaging Information"
      ],
      "content": "3.6 Ball Configuration TFBGA 8x6-mm (5x5 or 6x4 Ball Array) \n3.7 Ball Description TFBGA 8x6-mm",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Standard/Dual/Quad SPI instruction set of the W25Q128FV consists of 45 basic instructions that are fully controlled through the SPI bus (see Instruction Set Table1-2). Instructions are initiated with the falling edge of Chip Select (/CS). The first byte of data clocked into the DI input provides the instruction code. Data on the DI input is sampled on the rising edge of clock with most significant bit (MSB) first.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Instruction Set Table 1 (Standard/Dual/Quad SPI Instructions)(1)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6 Byte 7\n(Clock Number) (0 – 7) (8 – 15) (16 – 23) (24 – 31) (32 – 39) (40 – 47) (48 – 55)\n\nWrite Enable 06h\nVolatile SR Write Enable 50h\nWrite Disable 04h\nRead Status Register-1 05h (S7-S0)(2)\nWrite Status Register-1(4) 01h (S7-S0)(4)\n...",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Instruction Set Table 2 (Standard/Dual/Quad SPI Instructions)(1)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6\n(Clock Number) (0 – 7) (8 – 15) (16 – 23) (24 – 31) (32 – 39) (40 – 47)\n\nRead Unique ID 4Bh Dummy Dummy Dummy Dummy (UID63-UID0)\nPage Program 02h A23-A16 A15-A8 A7-A0 D7-D0 D7-D0(3)\nQuad Page Program 32h A23-A16 A15-A8 A7-A0 D7-D0, …(9) D7-D0, …(3)\n...",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 28,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.4 Instruction Set Table 3 (QPI Instructions)(14)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6\nClock Number (0, 1) (2, 3) (4, 5) (6, 7) (8, 9) (10, 11)\n[Full instruction set table]",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 29,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Notes:\n1. Data bytes are shifted with Most Significant Bit first. Byte fields with data in parenthesis \"( )\" indicate data output from the device on either 1, 2 or 4 IO pins.\n2. The Status Register contents and Device ID will repeat continuously until /CS terminates the instruction.\n3. At least one byte of data input is required for Page Program, Quad Page Program and Program Security Registers, up to 256 bytes of data input. If more than 256 bytes of data are sent to the device, the addressing will wrap to the beginning of the page and overwrite previously sent data.\n4. Write Status Register-1 (01h) can also be used to program Status Register -1&2, see section 8.2.5.\n[...]\n13. The number of dummy clocks for QPI Fast Read, QPI Fast Read Quad I/O & QPI Burst Read with Wrap is controlled by read parameter P7 – P4.\n14. The wrap around length for QPI Burst Read with Wrap is controlled by read parameter P3 – P0.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 30,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.1 Write Enable (06h)\nThe Write Enable instruction (Figure 5) sets the Write Enable Latch (WEL) bit in the Status Register to a 1. The WEL bit must be set prior to every Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase, Write Status Register and Erase/Program Security Registers instruction. The Write Enable instruction is entered by driving /CS low, shifting the instruction code \"06h\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high.\n\n8.2.2 Write Enable for Volatile Status Register (50h)\nThe non-volatile Status Register bits described in section 7.1 can also be written to as volatile bits. This gives more flexibility to change the system configuration and memory protection schemes quickly without waiting for the typical non-volatile bit write cycles or affecting the endurance of the Status Register non-volatile bits. To write the volatile values into the Status Register bits, the Write Enable for Volatile Status Register (50h) instruction must be issued prior to a Write Status Register (01h) instruction. Write Enable for Volatile Status Register instruction (Figure 6) will not set the Write Enable Latch (WEL) bit, it is only valid for the Write Status Register instruction to change the volatile Status Register bit values.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 31,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.3 Write Disable (04h) \nThe Write Disable instruction (Figure 7) resets the Write Enable Latch (WEL) bit in the Status Register to a 0. The Write Disable instruction is entered by driving /CS low, shifting the instruction code \"04h\" into the DI pin and then driving /CS high. Note that the WEL bit is automatically reset after Power-up and upon completion of the Write Status Register, Erase/Program Security Registers, Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase and Reset instructions.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 32,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.5 Write Status Register-1 (01h), Status Register-2 (31h) & Status Register-3 (11h)\nThe Write Status Register instruction allows the Status Registers to be written. The writable Status Register bits include: SRP0, SEC, TB, BP[2:0] in Status Register-1; CMP, LB[3:1], QE, SRP1 in Status Register-2; HOLD/RST, DRV1, DRV0, WPS & ADP in Status Register-3. All other Status Register bit locations are read-only and will not be affected by the Write Status Register instruction. LB[3:1] are non-volatile OTP bits, once it is set to 1, it cannot be cleared to 0.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 33,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "During non-volatile Status Register write operation (06h combined with 01h/31h/11h), after /CS is driven high, the self-timed Write Status Register cycle will commence for a time duration of tW (See AC Characteristics). While the Write Status Register cycle is in progress, the Read Status Register instruction may still be accessed to check the status of the BUSY bit. The BUSY bit is a 1 during the Write Status Register cycle and a 0 when the cycle is finished and ready to accept other instructions again. After the Write Status Register cycle has finished, the Write Enable Latch (WEL) bit in the Status Register will be cleared to 0.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 34,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128FV is also backward compatible to Winbond's previous generations of serial flash memories, in which the Status Register -1&2 can be written using a single \"Write Status Register -1 (01h)\" command. To complete the Write Status Register -1&2 instruction, the /CS pin must be driven high after the sixteenth bit of data that is clocked in as shown in Figure 9c & 9d. If /CS is driven high after the eighth clock, the Write Status Register -1 (01h) instruction will only program the Status Register-1, the Status Register-2 will not be affected (Previous generations will clear CMP and QE bits).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 35,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Data instruction allows one or more data bytes to be sequentially read from the memory. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"03h\" followed by a 24-bit address (A23-A0) into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first. The address is automatically incremented to the next higher address after each byte of data is shifted out allowing for a continuous stream of data. This means that the entire memory can be accessed with a single instruction as long as the clock continues. The instruction is completed by driving /CS high.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 36,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction is similar to the Read Data instruction except that it can operate at the highest possible frequency of FR (see AC Electrical Characteristics). This is accomplished by adding eight \"dummy\" clocks after the 24-bit address as shown in Figure 16. The dummy clocks allow the devices internal circuits additional time for setting up the initial address. During the dummy clocks the data value on the DO pin is a \"don't care\".",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 37,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read (0Bh) in QPI Mode \nThe Fast Read instruction is also supported in QPI mode. When QPI mode is enabled, the number of \ndummy clocks is configured by the \"Set Read Parameters (C0h)\" instruction to accommodate a wide \nrange of applications with different needs for either maximum Fast Read frequency or minimum data \naccess latency. Depending on the Read Parameter Bits P[5:4] setting, the number of dummy clocks can \nbe configured as either 2, 4, 6 or 8. The default number of dummy clocks upon power up or after a \nReset instruction is 2.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 38,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.8  Fast Read Dual Output (3Bh) \nThe Fast Read Dual Output (3Bh) instruction is similar to the standard Fast Re ad (0Bh) instruction \nexcept that data is output on two pins; IO0 and IO1. This allows data to be transferred at twice the rate of \nstandard SPI devices. The Fast Read Dual Output instruction is ideal for quickly downloading code from \nFlash to RAM upon power-up or for applications that cache code-segments to RAM for execution.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 39,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.9 Fast Read Quad Output (6Bh) \nThe Fast Read Quad Output (6Bh) instruction is similar to the Fast Read Dual Output (3Bh) instruction \nexcept that data is output on four pins, IO 0, IO 1, IO 2, and IO 3. The Quad Enable (QE) bit in Status \nRegister-2 must be set to 1 before the device will accept the Fast Read Quad Output Instruction. The \nFast Read Quad Output Instruction allows data to be transferred at four times the rate of standard SPI \ndevices.\n\nThe Fast Read Quad Output instruction can operate at the highest possible frequency of F R (see AC \nElectrical Characteristics). This is accompli shed by adding eight \"dummy\" clocks after the 24 -bit \naddress as shown in Figure 20. The dummy clocks allow the device's internal circuits additional time for \nsetting up the initial address. The input data during the dummy clocks is \"don't care\". However, t he IO \npins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 40,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BBh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Address bits (A23-0) two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 41,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7-0) after the input Address bits (A23-0), as shown in Figure 22a. The upper nibble of the (M7-4) controls the length of the next Fast Read Dual I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3-0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 42,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad I/O (EBh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO0, IO1, IO2 and IO3 and four Dummy clocks are required in SPI mode prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Fast Read Quad I/O Instruction.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 43,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "Fast Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode \n\nThe Fast Read Quad I/O instruction can also be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) command prior to EBh. The \"Set Burst with Wrap\" (77h) command can either enable or disable the \"Wrap Around\" feature for the following EBh commands. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 44,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "Fast Read Quad I/O (EBh) in QPI Mode\nThe Fast Read Quad I/O instruction is also supported in QPI mode, as shown in Figure 19c. When QPI mode is enabled, the number of dummy clocks is configured by the \"Set Read Parameters (C0h)\" instruction to accommodate a wide range of applications with different needs for either maximum Fast Read frequency or minimum data access latency. Depending on the Read Parameter Bits P[5:4] setting, the number of dummy clocks can be configured as either 2, 4, 6 or 8. The default number of dummy clocks upon power up or after a Reset instruction is 2.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 45,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "8.2.12 Word Read Quad I/O (E7h) \n\nThe Word Read Quad I/O (E7h) instruction is similar to the Fast Read Quad I/O (EBh) instruction except that the lowest Address bit (A0) must equal 0 and only two Dummy clocks are required prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Word Read Quad I/O Instruction.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 46,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Word Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode \nThe Word Read Quad I/O instruction can also be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) command prior to E7h. The \"Set Burst with Wrap\" (77h) command can either enable or disable the \"Wrap Around\" feature for the following E7h commands. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page. The output data starts at the initial address specified in the instruction, once it reaches the ending boundary of the 8/16/32/64-byte section, the output will wrap around to the beginning boundary automatically until /CS is pulled high to terminate the command.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 47,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.13 Octal Word Read Quad I/O (E3h)\nThe Octal Word Read Quad I/O (E3h) instruction is similar to the Fast Read Quad I/O (EBh) instruction except that the lower four Address bits (A0, A1, A2, A3) must equal 0. As a result, the dummy clocks are not required, which further reduces the instruction overhead allowing even faster random access for code execution (XIP). The Quad Enable bit (QE) of Status Register-2 must be set to enable the Octal Word Read Quad I/O Instruction.\n\nOctal Word Read Quad I/O with \"Continuous Read Mode\"\nThe Octal Word Read Quad I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7-0) after the input Address bits (A23-0), as shown in Figure 27a. The upper nibble of the (M7-4) controls the length of the next Octal Word Read Quad I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3-0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 48,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "If the \"Continuous Read Mode\" bits M5-4 = (1,0), then the next Fast Read Quad I/O instruction (after /CS is raised and then lowered) does not require the E3h instruction code, as shown in Figure 27b. This reduces the instruction sequence by eight clocks and allows the Read address to be immediately entered after /CS is asserted low. If the \"Continuous Read Mode\" bits M5-4 do not equal to (1,0), the next instruction (after /CS is raised and then lowered) requires the first byte instruction code, thus returning to normal operation. It is recommended to input FFh on IO0 for the next instruction (8 clocks), to ensure M4 = 1 and return the device to normal operation.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 49,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.14 Set Burst with Wrap (77h) \nIn Standard SPI mode, the Set Burst with Wrap (77h) instruction is used in conjunction  with \"Fast Read Quad I/O\" and \"Word Read Quad I/O\" instructions to access a fixed length of 8/16/32/64 -byte section within a 256 -byte page. Certain applications can benefit from this feature and improve the overall system code execution performance.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 50,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.15 Page Program (02h) \nThe Page Program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased  (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Page Program Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"02h\" followed by a 24 -bit address (A23-A0) and at least one data byte, into the DI pin.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 51,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 29a. Page Program Instruction (SPI Mode) \n\n/CS\nCLK Mode 0\nMode 3 0 1\nIO0\nIO1\nIO2\nIO3\n02h\nInstruction\n2 3 4 5\n20 16 12 8\n21 17\n22 18\n23 19\n13 9\n14 10\n15 11\nA23-16\n6 7 8 9\n4 0\n5 1\n6 2\n7 3\nA15-8 A7-0 Byte1 Byte 2 Byte 3\n4 0\n5 1\n6 2\n7 3\n4 0\n5 1\n6 2\n7 3\n4 0\n5 1\n6 2\n7 3\n10 11 12 13\nByte 255 Byte 256\n4 0\n5 1\n6 2\n7 3\n4 0\n5 1\n6 2\n7 3\nMode 0\nMode 3\n516\n517\n518\n519",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 52,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Quad Page Program instruction allows up to 256 bytes of data to be programmed at previously erased (FFh) memory locations using four pins: IO 0, IO1, IO2, and IO 3. The Quad Page Program can improve performance for PROM Programmer and applications that have slow clock speeds <5MHz.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 53,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Sector Erase instruction sets all memory within a specified sector (4K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Sector Erase Instruction (Status Register bit WEL must equal 1).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 54,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (32K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 55,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (64K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"D8h\" followed a 24-bit block address (A23-A0).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 56,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Chip Erase instruction sets all memory within the device to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Chip Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"C7h\" or \"60h\".",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 57,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Suspend instruction \"75h\", allows the system to interrupt a Sector or Block Erase operation or a Page Program operation and then read from or program/erase data to, any other sectors or blocks. The Erase/Program Suspend instruction \"75h\" will be accepted by the device only if the SUS bit in the Status Register equals to 0 and the BUSY bit equals to 1 while a Sector or Block Erase or a Page Program operation is on-going.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 59,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Resume instruction \"7Ah\" must be written to resume the Sector or Block Erase operation or the Page Program operation after an Erase/Program Suspend. The Resume instruction \"7Ah\" will be accepted by the device only if the SUS bit in the Status Register equals to 1 and the BUSY bit equals to 0. After issued the SUS bit will be cleared from 1 to 0 immediately, the BUSY bit will be set from 0 to 1 within 200ns and the Sector or Block will complete the erase operation or the page will complete the program operation. If the SUS bit equals to 0 or the BUSY bit equals to 1, the Resume instruction \"7Ah\" will be ignored by the device.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 60,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Although the standby current during normal operation is relatively low, standby current can be further reduced with the Power-down instruction. The lower power consumption makes the Power-down instruction especially useful for battery powered applications (See ICC1 and ICC2 in AC Characteristics). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"B9h\" as shown in Figure 37a & 37b. The /CS pin must be driven high after the eighth bit has been latched. If this is not done the Power-down instruction will not be executed. After /CS is driven high, the power-down state will entered within the time duration of tDP (See AC Characteristics). While in the power-down state only the Release Power-down / Device ID (ABh) instruction, which restores the device to normal operation, will be recognized. All other instructions are ignored. This includes the Read Status Register instruction, which is always available during normal operation. Ignoring all but one instruction makes the Power Down state a useful condition for securing maximum write protection. The device always powers-up in the normal operation with the standby current of ICC1.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 61,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Release from Power-down / Device ID instruction is a multi-purpose instruction. It can be used to release the device from the power-down state, or obtain the devices electronic identification (ID) number.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 62,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "When used to release the device from the power-down state and obtain the Device ID, the instruction is the same as previously described, and shown in Figure 38c & 38d, except that after /CS is driven high it must remain high for a time duration of tRES2 (See AC Characteristics). After this time duration the device will resume normal operation and other instructions will be accepted.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 63,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer/Device ID instruction is an alternative to the Release from Power-down / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 64,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.26 Read Manufacturer / Device ID Dual I/O (92h) \nThe Read Manufacturer / Device ID Dual I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 2x speed.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 65,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.27 Read Manufacturer / Device ID Quad I/O (94h)\nThe Read Manufacturer / Device ID Quad I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 4x speed.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 66,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.28 Read Unique ID Number (4Bh)\nThe Read Unique ID Number instruction accesses a factory-set read-only 64-bit number that is unique to each W25Q128FV device. The ID number can be used in conjunction with user software methods to help prevent copying or cloning of a system.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 67,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "For compatibility reasons, the W25Q128FV provides several instructions to electronically determine the identity of the device. The Read JEDEC ID instruction is compatible with the JEDEC standard for SPI compatible serial memories that was adopted in 2003. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"9Fh\". The JEDEC assigned Manufacturer ID byte for Winbond (EFh) and two Device ID bytes, Memory Type (ID15-ID8) and Capacity (ID7-ID0) are then shifted out on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 43a & 43b.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 68,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128BV features a 256-Byte Serial Flash Discoverable Parameter (SFDP) register that contains information about device configurations, available instructions and other features. The SFDP parameters are stored in one or more Parameter Identification (PID) tables. Currently only one PID table is specified, but more may be added in the future. The Read SFDP Register instruction is compatible with the SFDP standard initially established in 2010 for PC and other applications, as well as the JEDEC standard JESD216 that is published in 2011.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 69,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128FV offers three 256-byte Security Registers which can be erased and programmed individually. These registers may be used by the system manufacturers to store security and other important information separately from the main memory array. The Erase Security Register instruction is similar to the Sector Erase instruction. A Write Enable instruction must be executed before the device will accept the Erase Security Register Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"44h\" followed by a 24-bit address (A23-A0) to erase one of the three security registers.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 70,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Program Security Register instruction is similar to the Page Program instruction. It allows from one byte to 256 bytes of security register data to be programmed at previously erased  (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Program Security Register Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the  /CS pin low then shifting the instruction code \"42h\" followed by a 24 -bit address (A23 -A0) and at least one data byte, into the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being sent to the device.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 71,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Security Register instruction is similar to the Fast Read instruction and allows one or more data bytes to be sequentially read from one of the four security registers. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"48h\" followed by a 24-bit address (A23-A0) and eight \"dummy\" clocks into the DI pin. T he code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 72,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In QPI mode, to acc ommodate a wide range of applications with different needs for either maximum read frequency or minimum data access latency, \"Set Read Parameters (C0h)\" instruction can be used to configure the number of dummy clocks for \"Fast Read (0Bh)\", \"Fast Read Quad I/O (EBh)\" & \"Burst Read with Wrap (0Ch)\" instructions, and to configure the number of bytes of \"Wrap Length\" for the \"Burst Read with Wrap (0Ch)\" instruction.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 73,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The \"Burst Read with Wrap (0Ch)\" instruction provides an alternative way to perform the read operation with \"Wrap Around\" in QPI mode. The instruction is similar to the \"Fast Read (0Bh)\" instruction in QPI mode, except the addressing of the read operation will \"Wrap Around\" to the beginning boundary of the \"Wrap Length\" once the ending boundary is reached.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 74,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128FV support both Standard/Dual/Quad Serial Peripheral Interface (SPI) and Quad Peripheral Interface (QPI). However, SPI mode and QPI mode cannot be used at the same time. \"Enter QPI (38h)\" instruction is the only way to switch the device from SPI mode to QPI mode. Upon power-up, the default state of the device upon is Standard/Dual/Quad SPI mode. This provides full backward compatibility with earlier generations of Winbond serial flash memories.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 75,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In order to exit the QPI mode and return to the Standard/Dual/Quad SPI mode, an \"Exit QPI (FFh)\" instruction must be issued. When the device is switched from QPI mode to SPI mode, the existing Write Enable Latch (WEL) and Program/Erase Suspend status, and the Wrap Length setting will remain unchanged.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 76,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 77,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 78,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 79,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.41 Global Block/Sector Lock (7Eh) \nAll Block/Sector Lock bits can be set to 1 by the Global Block/Sector Lock instruction. The command must be issued by driving /CS low, shifting the instruction code \"7Eh\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high. A Write Enable instruction must be executed before the device will accept the Global Block/Sector Lock Instruction (Status Register bit WEL= 1).\n\n8.2.42 Global Block/Sector Unlock (98h)\nAll Block/Sector Lock bits can be set to 0 by the Global Block/Sector Unlock instruction. The command must be issued by driving /CS low, shifting the instruction code \"98h\" into the Data Input (DI) pin on the rising edge of CLK, and then driving /CS high. A Write Enable instruction must be executed before the device will accept the Global Block/Sector Unlock Instruction (Status Register bit WEL= 1).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 80,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.43 Enable Reset (66h) and Reset Device (99h)\nBecause of the small package and the limitation on the number of pins, the W25Q128FV provide a software Reset instruction instead of a dedicated RESET pin. Once the Reset instruction is accepted, any on-going internal operations will be terminated and the device will return to its default power-on state and lose all the current volatile settings, such as Volatile Status Register bits, Write Enable Latch (WEL) status, Program/Erase Suspend status, Read parameter setting (P7-P0), Continuous Read Mode bit setting (M7-M0) and Wrap Bit setting (W6-W4).",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 81,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9. ELECTRICAL CHARACTERISTICS\n\n9.1 Absolute Maximum Ratings (1)(2)\n\n9.2 Operating Ranges",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 82,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.3 Power-Up Power-Down Timing and Requirements(1) \nPARAMETER SYMBOL \nSPEC \nUNIT \nMIN MAX \nVCC (min) to /CS Low  tVSL 20  µs \nTime Delay Before Write Instruction  tPUW  5  ms \nWrite Inhibit Threshold Voltage  VWI 1.0 2.0 V \nNote: \n1. These parameters are characterized only.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 83,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.4 DC Electrical Characteristics \nPARAMETER SYMB\nOL CONDITIONS \nSPEC UNI\nT MIN TYP MAX \nInput Capacitance CIN(1) VIN = 0V   6 pF \nOutput Capacitance Cout(1) VOUT = 0V   8 pF \nInput Leakage ILI    ±2 µA \nI/O Leakage ILO    ±2 µA \nStandby Current  ICC1  /CS = VCC,  \nVIN = GND or VCC   10 50 µA \nPower-down Current  ICC2 /CS = VCC,  \nVIN = GND or VCC   1 20 µA \n[...] \nNotes: \n1. Tested on sample basis and specified through design and characterization data. TA = 25° C, VCC = 3.0V, 25% driver strength. \n2. Checker Board Pattern.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 84,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.5 AC Measurement Conditions(1) \nPARAMETER SYMBOL \nSPEC \nUNIT \nMIN MAX \nLoad Capacitance CL  30 pF \nInput Rise and Fall Times  TR, TF  5 ns \nInput Pulse Voltages  VIN 0.1 VCC to 0.9 VCC V \nInput Timing Reference Voltages  IN 0.3 VCC to 0.7 VCC V \nOutput Timing Reference Voltages  OUT 0.5 VCC to 0.5 VCC V \nNote: \n1. Output Hi-Z is defined as the point where data out is no longer driven.",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 85,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.6 AC Electrical Characteristics(6) \nDESCRIPTION SYMBOL ALT \nSPEC \nUNIT \nMIN TYP MAX \nClock frequency for all other instructions \n2.7V-3.6V VCC & Industrial Temperature \nexcept Read data instructions (03h) \nFR fC1 D.C.  104 MHz \nClock frequency for Read Data instruction (03h) fR fC2 D.C.  50 MHz \n... (full table contents)",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 86,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "AC Electrical Characteristics (cont'd) \nDESCRIPTION SYMBOL ALT \nSPEC UNI\nT MIN TYP MAX \n/HOLD to Output Low-Z tHHQX(2) tLZ   7 ns \n/HOLD to Output High-Z tHLQZ(2) tHZ   12 ns \nWrite Protect Setup Time Before /CS Low tWHSL(3)  20   ns \n... (full table contents)",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 87,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.7 Serial Output Timing \n9.8 Serial Input Timing \n9.9 /HOLD Timing \n9.10 /WP Timing",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    },
    {
      "page_number": 97,
      "categories": [
        "Packaging Information"
      ],
      "content": "The following table provides the valid part numbers for the W25Q128FV SpiFlash Memory. Please contact Winbond for specific availability by density and package type. Winbond SpiFlash memories use a 12-digit Product Number for ordering. However, due to limited space, the Top Side Marking on all packages uses an abbreviated 10-digit number.\n\nPACKAGE\nTYPE DENSITY PRODUCT NUMBER TOP SIDE MARKING\nS                          \nSOIC-8 208-mil 128M-bit\nW25Q128FVSIG\nW25Q128FVSIQ\nW25Q128FVSIF\n25Q128FVSG\n25Q128FVSQ\n25Q128FVSF",
      "grade": "B",
      "maker_pn": "W25Q128FV",
      "part number": "1107-006701"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "W25Q128FV - 3V 128M-BIT SERIAL FLASH MEMORY with Dual/Quad SPI and QPI interface",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "W25Q128FV is a 3V 128M-bit serial flash memory device with support for dual and quad SPI as well as QPI interfaces",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "The W25Q128FV is a high-density non-volatile memory IC with dual/quad SPI and QPI interfaces, operating at 3V supply voltage and providing 128 Mbits of storage capacity",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The W25Q128FV features various status registers that store information about the device's configuration, protection schemes, and operation status. These include the Erase/Write In Progress (BUSY) bit, Write Enable Latch (WEL) bit, Block Protect Bits (BP2, BP1, BP0), Top/Bottom Block Protect (TB) bit, Sector/Block Protect (SEC) bit, Complement Protect (CMP) bit, Status Register Protect (SRP1, SRP0) bits, Erase/Program Suspend Status (SUS) bit, Security Register Lock Bits (LB3, LB2, LB1), Quad Enable (QE) bit, Write Protect Selection (WPS) bit, Output Driver Strength (DRV1, DRV0) bits, and HOLD or /RESET Pin Function (HOLD/RST) bit.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "The W25Q128FV supports a wide range of instructions for reading, writing, erasing, and configuring the device. These include instructions for enabling/disabling write operations, reading and writing status registers, reading data, fast read operations (standard, dual output, quad output), page program operations, sector/block/chip erase operations, suspend/resume erase/program operations, power-down and release from power-down, reading manufacturer and device IDs, reading unique ID numbers, reading SFDP registers, erasing and programming security registers, reading security registers, setting read parameters, entering and exiting QPI mode, and configuring individual block/sector locks and global block/sector locks.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "The W25Q128FV has various electrical characteristics and specifications, including absolute maximum ratings, operating ranges, power-up and power-down timing requirements, DC electrical characteristics (input/output capacitance, leakage currents, standby and power-down currents), AC measurement conditions, AC electrical characteristics (clock frequencies, read/write timings, output timings, /HOLD timings, /WP timings), and serial output/input/hold/write protect timings.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      }
    ],
    "Application Circuits": [
      {
        "content": "Fast Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode: The Fast Read Quad I/O instruction can be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) command prior to EBh. The \"Set Burst with Wrap\" (77h) command can either enable or disable the \"Wrap Around\" feature for the following EBh commands. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "Fast Read Quad I/O (EBh) in QPI Mode: The Fast Read Quad I/O instruction is also supported in QPI mode. When QPI mode is enabled, the number of dummy clocks is configured by the \"Set Read Parameters (C0h)\" instruction to accommodate a wide range of applications with different needs for either maximum Fast Read frequency or minimum data access latency. Depending on the Read Parameter Bits P[5:4] setting, the number of dummy clocks can be configured as either 2, 4, 6 or 8.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "Word Read Quad I/O (E7h): The Word Read Quad I/O (E7h) instruction is similar to the Fast Read Quad I/O (EBh) instruction except that the lowest Address bit (A0) must equal 0 and only two Dummy clocks are required prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Word Read Quad I/O Instruction.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      }
    ],
    "Packaging Information": [
      {
        "content": "3. PACKAGE TYPES AND PIN CONFIGURATIONS: This section provides information about the different package types and pin configurations available for the W25Q128FV SpiFlash Memory, including SOIC/VSOP 208-mil, WSON 6x5-mm/8x6-mm, SOIC 300-mil, and TFBGA 8x6-mm.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "3.1 Pin Configuration SOIC/VSOP 208-mil, 3.2 Pad Configuration WSON 6x5-mm/8x6-mm, 3.3 Pin Description SOIC/VSOP 208-mil, WSON 6x5-mm/8x6-mm: These subsections provide detailed information about the pin configurations, pad configurations, and pin descriptions for the SOIC/VSOP 208-mil and WSON 6x5-mm/8x6-mm package types.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "3.4 Pin Configuration SOIC 300-mil, 3.5 Pin Description SOIC 300-mil: These subsections provide detailed information about the pin configuration and pin description for the SOIC 300-mil package type.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "3.6 Ball Configuration TFBGA 8x6-mm (5x5 or 6x4 Ball Array), 3.7 Ball Description TFBGA 8x6-mm: These subsections provide detailed information about the ball configuration and ball description for the TFBGA 8x6-mm package type with either a 5x5 or 6x4 ball array.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      },
      {
        "content": "Ordering Information and Marking Details: The text also includes information about valid part numbers for ordering the W25Q128FV SpiFlash Memory, as well as details on the top side marking used on the packages due to limited space. This information is crucial for properly identifying and ordering the correct product.",
        "part number": "1107-006701.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FV"
      }
    ]
  },
  "part number": "1107-006701"
}