{
  "metadata": {
    "component_name": "W25Q128FW",
    "manufacturer": "Winbond",
    "key_specifications": "128M-bit Serial Flash memory, SPI/Dual/Quad I/O SPI and QPI interfaces, up to 104MHz SPI clock, 4KB/32KB/64KB erase blocks, individual block/sector protection, security registers",
    "applications": "Code shadowing to RAM, executing code directly from Flash (XIP), storing voice, text and data in systems with limited space, pins and power",
    "grade": "B",
    "maker_pn": "W25Q128FW"
  },
  "page_summaries": [
    {
      "page_number": 5,
      "categories": [
        "Product Summary"
      ],
      "content": "The W25Q128FW (128M-bit) Serial Flash memory provides a storage solution for systems with limited space, pins and power. The 25Q series offers flexibility and performance well beyond ordinary Serial Flash devices. They are ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP) and storing voice, text and data.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 6,
      "categories": [
        "Product Summary"
      ],
      "content": "The W25Q128FW array is organized into 65,536 programmable pages of 256-bytes each. Up to 256 bytes can be programmed at a time. Pages can be erased in groups of 16 (4KB sector erase), groups of 128 (32KB block erase), groups of 256 (64KB block erase) or the entire chip (chip erase). The W25Q128FW has 4,096 erasable sectors and 256 erasable blocks respectively. The small 4KB sectors allow for greater flexibility in applications that require data and parameter storage. (See Figure 2.)\n\nThe W25Q128FW support the standard Serial Peripheral Interface (SPI), Dual/Quad I/O SPI as well as 2-clocks instruction cycle Quad Peripheral Interface (QPI) : Serial Clock, Chip Select, Serial Data I/O0 (DI), I/O1 (DO), I/O2 (/WP), and I/O3 (/HOLD). SPI clock frequencies of up to 104MHz are supported allowing equivalent clock rates of 208MHz (104MHz x 2) for Dual I/O and 416MHz (104MHz x 4) for Quad I/O when using the Fast Read Dual/Quad I/O and QPI instructions. These transfer rates can outperform standard Asynchronous 8 and 16-bit Parallel Flash memories. The Continuous Read Mode allows for efficient memory access with as few as 8-clocks of instruction-overhead to read a 24-bit address, allowing true XIP (execute in place) operation.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 7,
      "categories": [
        "Packaging Information"
      ],
      "content": "3. PACKAGE TYPES AND PIN CONFIGURATIONS \n3.1 Pin Configuration SOIC 208-mil \n3.2 Pad Configuration WSON 6x5-mm / 8x6-mm \n3.3 Pin Description SOIC 208-mil, WSON 6x5-mm / 8x6-mm",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 8,
      "categories": [
        "Packaging Information"
      ],
      "content": "3.4 Pin Configuration SOIC 300-mil \n3.5 Pin Description SOIC 300-mil",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 9,
      "categories": [
        "Packaging Information"
      ],
      "content": "3.6 Ball Configuration TFBGA 8x6-mm (5x5 or 6x4 Ball Array) \n3.7 Ball Description TFBGA 8x6-mm",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 22,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.15 6bhW25Q128FW Status Register Memory Protection (WPS = 0, CMP = 0) \n\nSTATUS REGISTER(1) W25Q128FW (128M-BIT) MEMORY PROTECTION(3) \n\nNotes:\n1. X = don't care\n2. L = Lower; U = Upper\n3. If any Erase or Program command specifies a memory region that contains protected data portion, this command will be ignored.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 23,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.16 W25Q128FW Status Register Memory Protection (WPS = 0, CMP = 1)\n\nSTATUS REGISTER(1) W25Q128FW (128M-BIT) MEMORY PROTECTION(3)\n\nNotes:\n1. X = don't care\n2. L = Lower; U = Upper\n3. If any Erase or Program command specifies a memory region that contains protected data portion, this command will be ignored.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 24,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.1.17 W25Q128FW Individual Block Memory Protection (WPS=1) \n\nNotes:\n1. Individual Block/Sector protection is only valid when WPS=1.\n2. All individual block/sector lock bits are set to 1 by default after power up, all memory array is protected.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Standard/Dual/Quad SPI instruction set of the W25Q128FW consists of 45 basic instructions that are fully controlled through the SPI bus (see Instruction Set Table1-2). Instructions are initiated with the falling edge of Chip Select (/CS). The first byte of data clocked into the DI input provides the instruction code. Data on the DI input is sampled on the rising edge of clock with most significant bit (MSB) first.\n\nThe QPI instruction set of the W25Q128FW consists of 32 basic instructions that are fully controlled through the SPI bus (see Instruction Set Table 3). Instructions are initiated with the falling edge of Chip Select (/CS). The first byte of data clocked through IO[3:0] pins provides the instruction code. Data on all four IO pins are sampled on the rising edge of clock with most significant bit (MSB) first. All QPI instructions, addresses, data and dummy bytes are using all four IO pins to transfer every byte of data with every two serial clocks (CLK).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.2 Instruction Set Table 1 (Standard/Dual/Quad SPI Instructions)(1)\nData Input Output Byte 1...Byte 7\n\n[Table with instructions and byte details]",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.3 Instruction Set Table 2 (Standard/Dual/Quad SPI Instructions)(1)\nData Input Output Byte 1...Byte 9\n\n[Table with instructions and byte details]",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 28,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.1.4 Instruction Set Table 3 (QPI Instructions)(14)\nData Input Output Byte 1 Byte 2 Byte 3 Byte 4 Byte 5 Byte 6\nClock Number (0, 1) (2, 3) (4, 5) (6, 7) (8, 9) (10, 11)\n[Table listing all QPI instructions and their byte encodings]",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 29,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Notes:\n1. Data bytes are shifted with Most Significant Bit first. Byte fields with data in parenthesis \"(  )\" indicate data output from the device on either 1, 2 or 4 IO pins.\n2. The Status Register contents and Device ID will repeat continuously until /CS terminates the instruction.\n...\n[Detailed notes on instruction formats, address/data mappings, etc.]",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 30,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2 Instruction Descriptions\n\n8.2.1 Write Enable (06h)\n[Description of Write Enable instruction]\n\n8.2.2 Write Enable for Volatile Status Register (50h)\n[Description of Write Enable for Volatile Status Register instruction]",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 31,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.3 Write Disable (04h) \nThe Write Disable instruction (Figure 7) resets the Write Enable Latch (WEL) bit in the Status Register to a 0. The Write Disable instruction is entered by driving /CS low, shifting the instruction code \"04h\" into the DI pin and then driving /CS high. Note that the WEL bit is automatically reset after Power-up and upon completion of the Write Status Register, Erase/Program Security Registers, Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase and Reset instructions.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 32,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.4 Read Status Register-1 (05h), Status Register-2 (35h) & Status Register-3 (15h)\nThe Read Status Register instructions allow the 8-bit Status Registers to be read. The instruction is entered by driving /CS low and shifting the instruction code \"05h\" for Status Register-1, \"35h\" for Status Register-2 or \"15h\" for Status Register-3 into the DI pin on the rising edge of CLK. The status register bits are then shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first as shown in Figure 8. Refer to section 7.1 for Status Register descriptions.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 33,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.5 Write Status Register-1 (01h), Status Register-2 (31h) & Status Register-3 (11h)\nThe Write Status Register instruction allows the Status Registers to be written. The writable Status Register bits include: SRP0, SEC, TB, BP[2:0] in Status Register-1; CMP, LB[3:1], QE, SRP1 in Status Register-2; HOLD/RST, DRV1, DRV0, WPS in Status Register-3. All other Status Register bit locations are read-only and will not be affected by the Write Status Register instruction. LB[3:1] are non-volatile OTP bits, once it is set to 1, it cannot be cleared to 0.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 34,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128FW is also backward compatible to Winbond's previous generations of serial flash memories, in which the Status Register-1&2 can be written using a single \"Write Status Register-1 (01h)\" command. To complete the Write Status Register-1&2 instruction, the /CS pin must be driven high after the sixteenth bit of data that is clocked in as shown in Figure 9c & 9d. If /CS is driven high after the eighth clock, the Write Status Register-1 (01h) instruction will only program the Status Register-1, the Status Register-2 will not be affected (Previous generations will clear CMP and QE bits).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 35,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Data instruction allows one or more data bytes to be sequentially read from the memory. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"03h\" followed by a 24-bit address (A23-A0) into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first. The address is automatically incremented to the next higher address after each byte of data is shifted out allowing for a continuous stream of data. This means that the entire memory can be accessed with a single instruction as long as the clock continues. The instruction is completed by driving /CS high.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 36,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction is similar to the Read Data instruction except that it can operate at the highest possible frequency of FR (see AC Electrical Characteristics). This is accomplished by adding eight \"dummy\" clocks after the 24-bit address as shown in Figure 16. The dummy clocks allow the devices internal circuits additional time for setting up the initial address. During the dummy clocks the data value on the DO pin is a \"don't care\".",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 37,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read (0Bh) in QPI Mode \nThe Fast Read instruction is also supported in QPI mode. When QP I mode is enabled, the number of \ndummy clocks is configured by the \"Set Read Parameters (C0h)\"  instruction to accommodate a wide \nrange of applications with different needs for either maximum Fast Read frequency or minimum data \naccess latency. Depending on the Read Parameter Bits P[5:4]  setting, the number of dummy clocks can \nbe configured as either 2, 4, 6 or 8. The default number of dummy clocks upon power up or after a Reset \ninstruction is 2.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 38,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.8 Fast Read Dual Output (3Bh) \nThe Fast Read Dual Output (3Bh) instruction is similar to the standard Fast Read (0Bh) instruction except \nthat data is output on two pins; IO0 and IO1. This allows data to be transferred at twice the rate of standard \nSPI devices. The Fast R ead Dual Output instruction is ideal for quickly downloading code from Flash to \nRAM upon power-up or for applications that cache code-segments to RAM for execution.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 39,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.9 Fast Read Quad Output (6Bh) \nThe Fast Read Quad Output (6Bh) instruction is similar to the Fast Read Dual Output (3Bh) instruction \nexcept that data is output on four pins, IO0, IO1, IO 2, and IO3. The Quad E nable (QE) bit in  Status \nRegister-2 must be set to 1 before the device will accept the Fast Read Quad Output Instruction. The Fast \nRead Quad Output Instruction allows data to be transferred at four times the rate of standard SPI devices.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 40,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BBh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Address bits (A23 -0) two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 41,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read Dual I/O with \"Continuous Read Mode\"\nThe Fast Read Dual I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7-0) after the input Address bits (A23 -0), as shown in Figure 22a. The upper nibble of the (M7 -4) controls the length of the next Fast Read Dual I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3 -0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 42,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad I/O (EBh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO 0, IO1, IO2 and IO3 and four Dummy clocks are required in SPI mode prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Fast Read Quad I/O Instruction.\n\nFast Read Quad I/O with \"Continuous Read Mode\"\nThe Fast Read Quad I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7 -0) after the input Address bits (A23 -0), as shown in Figure 24a. The upper nibble of the (M7 -4) controls the length of the next Fast Read Quad I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3-0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 43,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode \n\nThe Fast Read Quad I/O instruction can also be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) command prior to EBh. The \"Set Burst with Wrap\" (77h) command can either enable or disable the \"Wrap Around\" feature for the following EBh commands. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page. The output data starts at the initial address specified in the instruction, once it reaches the ending boundary of the 8/16/32/64-byte section, the output will wrap around to the beginning boundary automatically until /CS is pulled high to terminate the command.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 44,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read Quad I/O (EBh) in QPI Mode\nThe Fast Read Quad I/O instruction is also supported in QPI mode , as shown in Figure 1 9c. When QPI mode is enabled, the number of dummy clocks is configured by the \"Set Read Parameters (C0h)\" instruction to accommodate a wide range of applications with different needs for either maximum Fast Read frequency or minimum data access latency. Depending on the Read Parameter Bits P[5:4] setting, the number of dummy clocks can be configured as either 2, 4, 6 or 8. The default number of dummy clocks upon power up or after a Reset instruction is 2. In QPI mode, the \"Continuous Read Mode\" bits M7-0 are also considered as dummy clocks. In the default setting, the data output will follow the Continuous Read Mode bits immediately.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 45,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.12 Word Read Quad I/O (E7h) \nThe Word Read Quad I/O (E7h) instruction is similar to the Fast Read Quad I/O (EBh) instruction except that the lowest Address bit (A0) must equal 0 and only two Dummy clocks are required prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Word Read Quad I/O Instruction.\n\nWord Read Quad I/O with \"Continuous Read Mode\"\nThe Word Read Quad I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7-0) after the input Address bits (A23-0), as shown in Figure 26a. The upper nibble of the (M7-4) controls the length of the next Fast Read Quad I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3-0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 46,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Word Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode\nThe Word Read Quad I/O instruction can also be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) command prior to E7h. The \"Set Burst with Wrap\" (77h) command can either enable or disable the \"Wrap Around\" feature for the following E7h commands. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page. The output data starts at the initial address specified in the instruction, once it reaches the ending boundary of the 8/16/32/64-byte section, the output will wrap around to the beginning boundary automatically until /CS is pulled high to terminate the command.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 47,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Octal Word Read Quad I/O with \"Continuous Read Mode\"\nThe Octal Word Read Quad I/O instruction can further reduce instruction overhead through setting the \"Continuous Read Mode\" bits (M7-0) after the input Address bits (A23-0), as shown in Figure 27a. The upper nibble of the (M7-4) controls the length of the next Octal Word Read Quad I/O instruction through the inclusion or exclusion of the first byte instruction code. The lower nibble bits of the (M3-0) are don't care (\"x\"). However, the IO pins should be high-impedance prior to the falling edge of the first data out clock.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 49,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In Standard SPI mode, the Set Burst with Wrap (77h) instruction is used in conjunction with \"Fast Read Quad I/O\" and \"Word Read Quad I/O\" instructions to access a fixed length of 8/16/32/64-byte section within a 256-byte page. Certain applications can benefit from this feature and improve the overall system code execution performance.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 50,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Page Program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Page Program Instruction (Status Register bit WEL = 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"02h\" followed by a 24-bit address (A23-A0) and at least one data byte, into the DI pin.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 51,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "As with the write and erase instructions, the /CS pin must be driven high after the eighth bit of the last byte has been latched. If this is not done the Page Program instruction will not be executed. After /CS is driven high, the self-timed Page Program instruction will commence for a time duration of tpp (See AC Characteristics).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 52,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Quad Page Program instruction allows up to 256 bytes of data to be programmed at previously erased (FFh) memory locations using four pins: IO 0, IO 1, IO 2, and IO 3. The Quad Page Program can improve performance for PROM Programmer and applications that have slow clock speeds <5MHz.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 53,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Sector Erase instruction sets all memory within a specified sector (4K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Sector Erase Instruction (Status Register bit WEL must equal 1).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 54,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (32K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 55,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (64K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"D8h\" followed a 24-bit block address (A23-A0).",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 56,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Chip Erase instruction sets all memory within the device to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Chip Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"C7h\" or \"60h\".",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 57,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Suspend instruction \"75h\", allows the system to interrupt a Sector or Block Erase operation or a Page Program operation and then read from or program/erase data to, any other sectors or blocks. The Erase/Program Suspend instruction \"75h\" will be accepted by the device only if the SUS bit in the Status Register equals to 0 and the BUSY bit equals to 1 while a Sector or Block Erase or a Page Program operation is on-going.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 58,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 35b. Erase/Program Suspend Instruction (QPI Mode)",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 59,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Resume instruction \"7Ah\" must be written to resume the Sector or Block Erase operation or the Page Program operation after an Erase/Program Suspend. The Resume instruction \"7Ah\" will be accepted by the device only if the SUS bit in the Status Register equals to 1 and the BUSY bit equals to 0. After issued the SUS bit will be cleared from 1 to 0 immediately, the BUSY bit will be set from 0 to 1 within 200ns and the Sector or Block will complete the erase operation or the page will complete the program operation. If the SUS bit equals to 0 or the BUSY bit equals to 1, the Resume instruction \"7Ah\" will be ignored by the device.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 60,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Although the standby current during normal operation is relatively low, standby current can be further reduced with the Power-down instruction. The lower power consumption makes the Power-down instruction especially useful for battery powered applications (See ICC1 and ICC2 in AC Characteristics). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"B9h\" as shown in Figure 37a & 37b.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 61,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Release from Power-down / Device ID instruction is a multi-purpose instruction. It can be used to release the device from the power-down state, or obtain the devices electronic identification (ID) number.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 62,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "When used to release the device from the power-down state and obtain the Device ID, the instruction is the same as previously described, and shown in Figure 38c & 38d, except that after /CS is driven high it must remain high for a time duration of tRES2 (See AC Characteristics). After this time duration the device will resume normal operation and other instructions will be accepted.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 63,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer/Device ID instruction is an alternative to the Release from Power-down / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 64,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer / Device ID Dual I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 2x speed.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 65,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Manufacturer / Device ID Quad I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 4x speed.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 66,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Unique ID Number instruction accesses a factory-set read-only 64-bit number that is unique to each W25Q128FW device. The ID number can be used in conjunction with user software methods to help prevent copying or cloning of a system.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 67,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.29 Read JEDEC ID (9Fh) \nFor compatibility reasons, the W25Q128FW provides several instructions to electronically determine the identity of the device. The Read JEDEC ID instruction is compatible with the JEDEC standard for SPI compatible serial memories that was adopted in 2003. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"9Fh\". The JEDEC assigned Manufacturer ID byte for Winbond (EFh) and two Device ID bytes, Memory Type (ID15 -ID8) and Capacity (ID7 -ID0) are then shifted out on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 43a & 43b. For memory type and capacity values refer to Manufacturer and Device Identification table.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 68,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.30 Read SFDP Register (5Ah)\nThe W25Q1 28FW features a 256 -Byte Serial Flash Discoverable Parameter (SFDP) register that contains information about device configurations, available instructions and other features . The SFDP parameters are stored in one or more Parameter Identification (PID) tables. Currently only one PID table is specified, but more may be added in the future. The Read SFDP Register instruction is com patible with the SFDP standard initially established in 2010 for PC and other applications, as well as the JEDEC standard JESD216-serials that is published in 2011 . Most Winbond SpiFlash Memories shipped after June 2011 (date code 1124 and beyond) support the SFDP feature as specified in the applicable datasheet.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 69,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.31 Erase Security Registers (44h)\nThe W25Q128F W offers three 256 -byte Security Registers which can be erased and programmed individually. These re gisters may be used by the system manufacturers to store security and other important information separately from the main memory array.\nThe Erase Security Register instruction is similar to the Sector Erase instruction. A Write Enable instruction must be executed before the device will accept the Erase Security Register Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"44h\" followed by a 24 -bit address (A23 -A0) to erase one of the three security registers.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 70,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.32 Program Security Registers (42h) \nThe Program Security Register instruction is similar to the Page Program instruction. It allows from one byte to 256 bytes of security register data to be programmed at previously erased (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Program Security Register Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"42h\" followed by a 24-bit address (A23-A0) and at least one data byte, into the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being sent to the device.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 71,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.33 Read Security Registers (48h)\nThe Read Security Register instruction is similar to the Fast Read instruction and allows one or more data bytes to be sequentially read from one of the four security registers. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"48h\" followed by a 24-bit address (A23-A0) and eight \"dummy\" clocks into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 72,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.2.34 Set Read Parameters (C0h)\nIn QPI mode, to accommodate a wide range of applications with different needs for either maximum read frequency or minimum data access latency, \"Set Read Parameters (C0h)\" instruction can be used to configure the number of dummy clocks for \"Fast Read (0Bh)\", \"Fast Read Quad I/O (EBh)\" & \"Burst Read with Wrap (0Ch)\" instructions, and to configure the number of bytes of \"Wrap Length\" for the \"Burst Read with Wrap (0Ch)\" instruction.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 73,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The \"Burst Read with Wrap (0Ch)\" instruction provides an alternative way to perform the read operation with \"Wrap Around\" in QPI mode. The instruction is similar to the \"Fast Read (0Bh)\" instruction in QPI mode, except the addressing of the read operation will \"Wrap Around\" to the beginning boundary of the \"Wrap Length\" once the ending boundary is reached.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 74,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q128FW support both Standard/Dual/Quad Serial Peripheral Interface (SPI) and Quad Peripheral Interface (QPI). However, SPI mode and QPI mode cannot be used at the same time. \"Enter QPI (38h)\" instruction is the only way to switch the device from SPI mode to QPI mode.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 75,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In order to exit the QPI mode and return to the Standard/Dual/Quad SPI mode, an \"Exit QPI (FFh)\" instruction must be issued.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 76,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 77,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 78,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Individual Block/Sector Lock provides an alternative way to protect the memory array from adverse Erase/Program. In order to use the Individual Block/Sector Locks, the WPS bit in Status Register -3 must be set to 1. If WPS=0, the write protection will be determined by the combination of CMP, SEC, TB, BP[2:0] bits in the Status Registers. The Individual Block/Sector Lock bits are volatile bits. The default values after device power up or after a Reset are 1, so the entire memory array is being protected.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 82,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "PARAMETER SYMBOL SPEC UNIT \nMIN MAX \nVCC (min) to /CS Low tVSL(1) 10 µs \nTime Delay Before Write Instruction tPUW(1) 1 10 ms \nWrite Inhibit Threshold Voltage VWI(1) 1.0 1.4 V",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 83,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "PARAMETER SYMBOL CONDITIONS SPEC UNIT \nMIN TYP MAX \nInput Capacitance CIN(1) VIN = 0V(1) 6 pF \nOutput Capacitance Cout(1) VOUT = 0V(1) 8 pF \nInput Leakage ILI ±2 µA \nI/O Leakage ILO ±2 µA \nStandby Current ICC1 /CS = VCC, \nVIN = GND or VCC 10 50 µA \nPower-down Current ICC2 /CS = VCC, \nVIN = GND or VCC 1 20 µA \n... \nInput Low Voltage VIL –0.5 VCC x 0.3 V \nInput High Voltage VIH VCC x 0.7 VCC + 0.4 V \nOutput Low Voltage VOL IOL = 100 µA 0.2 V \nOutput High Voltage VOH IOH = –100 µA VCC – 0.2 V",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 84,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "PARAMETER SYMBOL SPEC UNIT \nMIN MAX \nLoad Capacitance CL 30 pF \nInput Rise and Fall Times TR, TF 5 ns \nInput Pulse Voltages VIN 0.1 VCC to 0.9 VCC V \nInput Timing Reference Voltages IN 0.3 VCC to 0.7 VCC V \nOutput Timing Reference Voltages OUT 0.5 VCC to 0.5 VCC V",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 94,
      "categories": [
        "Packaging Information"
      ],
      "content": "10.7 32-Ball WLCSP (Package Code Y; W25Q128FWYIC with backside coating)\n\nNote: Dimension b is measured at the maximum solder bump diameter, parallel to primary datum C.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 95,
      "categories": [
        "Product Summary"
      ],
      "content": "11. ORDERING INFORMATION\n\nNotes:\n1. The \"W\" prefix and the Temperature designator \"I\" are not included on the part marking.\n2. Standard bulk shipments are in Tube (shape E). Please specify alternate packing method, such as Tape and Reel (shape T) or Tray (shape S), when placing orders.\n3. For shipments with OTP feature enabled, please contact Winbond.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    },
    {
      "page_number": 96,
      "categories": [
        "Product Summary",
        "Packaging Information"
      ],
      "content": "11.1 Valid Part Numbers and Top Side Marking\n\nThe following table provides the valid part numbers for the W25Q128FW SpiFlash Memory. Please contact Winbond for specific availability by density and package type. Winbond SpiFlash memories use a 12-digit Product Number for ordering. However, due to limited space, the Top Side Marking on all packages uses an abbreviated 10-digit number.",
      "grade": "B",
      "maker_pn": "W25Q128FW",
      "part number": "1107-007139"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The W25Q128FW (128M-bit) Serial Flash memory provides a compact storage solution for systems with limited space, pins, and power. It offers flexibility and high performance beyond ordinary Serial Flash devices, making it ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP), and storing voice, text, and data.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The W25Q128FW array is organized into 65,536 programmable pages of 256-bytes each, allowing up to 256 bytes to be programmed at a time. Pages can be erased in groups of 16 (4KB sector erase), 128 (32KB block erase), 256 (64KB block erase), or the entire chip (chip erase). With 4,096 erasable sectors and 256 erasable blocks, the small 4KB sectors provide greater flexibility for data and parameter storage.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The W25Q128FW supports the standard Serial Peripheral Interface (SPI), Dual/Quad I/O SPI, and 2-clocks instruction cycle Quad Peripheral Interface (QPI) with Serial Clock, Chip Select, Serial Data I/O0 (DI), I/O1 (DO), I/O2 (/WP), and I/O3 (/HOLD). SPI clock frequencies up to 104MHz are supported, allowing equivalent clock rates of 208MHz for Dual I/O and 416MHz for Quad I/O using Fast Read Dual/Quad I/O and QPI instructions. These transfer rates can outperform standard Asynchronous 8 and 16-bit Parallel Flash memories. The Continuous Read Mode enables efficient memory access with as few as 8-clocks of instruction-overhead for true XIP (execute in place) operation.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The W25Q128FW SpiFlash Memory is available in various densities and package types. Ordering information, including valid part numbers and top side marking, is provided. Standard bulk shipments are in Tube (shape E), but alternate packing methods like Tape and Reel (shape T) or Tray (shape S) can be specified when placing orders. For shipments with OTP feature enabled, contact Winbond.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The text provides details on the status registers, memory protection schemes, and instruction set for the W25Q128FW flash memory device. It covers the format and functionality of various instructions for reading, writing, erasing, and managing the device, including standard SPI, dual SPI, quad SPI, and QPI modes. Instructions for tasks like reading manufacturer/device ID, setting read parameters, entering/exiting QPI mode, and handling security registers are also described.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The text includes tables listing the instruction set for standard/dual/quad SPI and QPI modes, detailing the instruction codes, byte formats, and data input/output sequences. It explains instructions like Read, Fast Read, Page Program, Quad Page Program, Sector/Block/Chip Erase, Erase/Program Suspend/Resume, Power-down, and various memory protection mechanisms (status register bits, individual block/sector locks).",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The text provides electrical specifications and characteristics for the W25Q128FW device, including voltage, current, power, timing parameters, input/output capacitance, and logic level definitions. It specifies conditions and limits for aspects like input leakage, standby/power-down currents, input/output voltage levels, load capacitance, rise/fall times, and timing reference voltages.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      }
    ],
    "Application Circuits": [
      {
        "content": "Figure 35b illustrates the Erase/Program Suspend Instruction in QPI Mode, which allows the erase or program operation to be suspended and resumed later.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "The Erase/Program Suspend Instruction is useful in applications where the erase or program operation needs to be interrupted for other tasks or events.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "To suspend an erase or program operation, the Erase/Program Suspend Instruction is issued, followed by the appropriate command sequence to perform the desired task or event.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "After the task or event is completed, the erase or program operation can be resumed by issuing the Resume Instruction, which continues the operation from where it was suspended.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      }
    ],
    "Packaging Information": [
      {
        "content": "3. PACKAGE TYPES AND PIN CONFIGURATIONS: This section covers the various package types, pin configurations, pad configurations, and pin/ball descriptions for different package types such as SOIC 208-mil, WSON 6x5-mm/8x6-mm, SOIC 300-mil, and TFBGA 8x6-mm (5x5 or 6x4 Ball Array). It provides detailed information about the physical packaging and pinout/ballout arrangements.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "10.7 32-Ball WLCSP (Package Code Y; W25Q128FWYIC with backside coating): This line specifically mentions the 32-Ball WLCSP (Wafer Level Chip Scale Package) package type, with the package code 'Y' and the part number 'W25Q128FWYIC' with backside coating.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "Note: Dimension b is measured at the maximum solder bump diameter, parallel to primary datum C. This note provides additional information about how to measure a specific dimension (b) for solder bumps, which is relevant for certain package types.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      },
      {
        "content": "11.1 Valid Part Numbers and Top Side Marking: This section covers the valid part numbers for the W25Q128FW SpiFlash Memory, including information about ordering and top side marking conventions. It mentions that Winbond uses a 12-digit Product Number for ordering, while the top side marking on packages uses an abbreviated 10-digit number due to space constraints.",
        "part number": "1107-007139.pdf",
        "grade": "B",
        "maker_pn": "W25Q128FW"
      }
    ]
  },
  "part number": "1107-007139"
}