{
  "metadata": {
    "component_name": "W25Q33PW",
    "manufacturer": "Winbond",
    "key_specifications": "1.8V 32M-bit Serial NOR Flash Memory with Dual/Quad SPI, 256-byte Serial SRAM buffer, 3 Security Registers, Write Protection features, configurable output driver strength",
    "applications": "Code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP), storing voice, text and data in systems with limited space, pins and power",
    "grade": "F",
    "maker_pn": "W25Q33PW"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "W25Q33PW \n\n1.8V 32M-BIT \nSERIAL NOR FLASH MEMORY WITH \nDUAL/QUAD SPI",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 5,
      "categories": [
        "Product Summary"
      ],
      "content": "The W25 Q33PW (32M-BIT) Serial Flash memory provides a storage solution for systems with limited space, pins and power. The 25Q series offers flexibility and performance well beyond ordinary Serial Flash devices. They are ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP) and storing voice, text and data. The device operates on a single 1.65V to 1.95V power supply with current consumption as low as 0.1µA for power-down. All devices are offered in space-saving packages.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 10,
      "categories": [
        "Reliability and Environmental Conditions"
      ],
      "content": "Write Protect Features \n Device resets when VCC is below threshold \n Time delay write disable after Power-up \n Write enable/disable instructions and automatic write disable after erase or program \n Software and Hardware (/WP pin) write protection using Status Registers \n Write Protection using Power-down instruction \n Lock Down write protection for Status Register until the next power-up \n One Time Program (OTP) write protection for array and Security Registers using Status Register *",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 11,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In Standard SPI mode, one of the new powerful features of the W25Q33PW is the integrated Serial SRAM buffer and its associated Program Buffer. Together, the 256-byte Serial SRAM provides usable SRAM storage. The SRAM can be used in conjunction with the Flash memory or independently. The main purpose of the Serial SRAM is to serve as the primary buffer for data to be written into the Serial Flash memory array. In case of need, it can help to transform random Byte Write to page Program Buffer.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 12,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Three Status and Configuration Registers are provided for W25Q33PW. The Read Status Register-1/2/3 instructions can be used to provide status on the availability of the flash memory array, whether the device is write enabled or disabled, the state of write protection, Quad SPI setting, Security Register lock status, Erase/Program Suspend status, and output driver strength. The Write Status Register instruction can be used to configure the device write protection features, Quad SPI setting, Security Register OTP locks, Hold/Reset functions and output driver strength.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 16,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Output Driver Strength (DRV1, DRV0) – Volatile/Non-Volatile Writable\nThe DRV1 & DRV0 bits are used to determine the output driver strength for the Read operations.\n\nDRV1, DRV0 Resistor\n0, 0 25-ohm\n0, 1 33-ohm\n1, 0 50-ohm(default)\n1, 1 100-ohm",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 17,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "STATUS REGISTER(1) W25Q33PW (32M-BIT) MEMORY PROTECTION(3)\nSEC TB BP2 BP1 BP0 PROTECTED BLOCK(S) PROTECTED ADDRESSES PROTECTED DENSITY PROTECTED PORTION(2)\n... (table content) ...",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 18,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "W25Q33PW Status Register Memory Protection (CMP = 1)\nSTATUS REGISTER(1) W25Q33PW (32M-BIT) MEMORY PROTECTION(3)\nSEC TB BP2 BP1 BP0 PROTECTED BLOCK(S) PROTECTED ADDRESSES PROTECTED DENSITY PROTECTED PORTION(2)\n... (table content) ...",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 22,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Notes: \n1. Data bytes are shifted with Most Significant Bit first. Byte fields with data in parenthesis \"( )\" indicate data output from the device on either 1, 2 or 4 IO pins.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 23,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Write Enable (06h)\nThe Write Enable instruction (Figure 5) sets the Write Enable Latch (WEL) bit in the Status Register to a 1. The WEL bit must be set prior to every Page Program, Quad Page Program, Sector Erase, Block Erase, Chip Erase, Write Status Register and Erase/Program Security Registers instruction.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 24,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Write Disable (04h)\nThe Write Disable instruction (Figure 7) resets the Write Enable Latch (WEL) bit in the Status Register to a 0. The Write Disable instruction is entered by driving /CS low, shifting the instruction code \"04h\" into the DI pin and then driving /CS high.\n\nRead Status Register-1 (05h), Status Register-2 (35h) & Status Register-3 (15h)\nThe Read Status Register instructions allow the 8-bit Status Registers to be read. The instruction is entered by driving /CS low and shifting the instruction code \"05h\" for Status Register-1, \"35h\" for Status Register-2 or \"15h\" for Status Register-3 into the DI pin on the rising edge of CLK.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Write Status Register instruction allows the Status Registers to be written. The writable Status Register bits include: SRP, SEC, TB, BP[2:0] in Status Register-1; CMP, LB[3:1], QE, SRL in Status Register-2; DRV1, DRV0, in Status Register-3. All other Status Register bit locations are read-only and will not be affected by the Write Status Register instruction. LB[3:1] are non-volatile OTP bits, once it is set to 1, it cannot be cleared to 0.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Data instruction allows one or more data bytes to be sequentially read from the memory. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"03h\" followed by a 24-bit address (A23-A0) into the DI pin. The code and address bits are latched on the rising edge of the CLK pin. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with most significant bit (MSB) first.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read instruction is similar to the Read Data instruction except that it can operate at the highest possible frequency of FR (see AC Electrical Characteristics). This is accomplished by adding eight \"dummy\" clocks after the 24-bit address as shown in Figure 16. The dummy clocks allow the devices internal circuits additional time for setting up the initial address. During the dummy clocks the data value on the DO pin is a \"don't care\".",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 28,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual Output (3Bh) instruction is similar to the standard Fast Read (0Bh) instruction except that data is output on two pins; IO0 and IO1. This allows data to be transferred at twice the rate of standard SPI devices. The Fast Read Dual Output instruction is ideal for quickly downloading code from Flash to RAM upon power-up or for applications that cache code-segments to RAM for execution.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 29,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Quad Output (6Bh) instruction is similar to the Fast Read Dual Output (3Bh) instruction except that data is output on four pins, IO0, IO1, IO2, and IO3. The Quad Enable (QE) bit in Status Register-2 must be set to 1 before the device will accept the Fast Read Quad Output Instruction. The Fast Read Quad Output Instruction allows data to be transferred at four times the rate of standard SPI devices.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 30,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Fast Read Dual I/O (BBh) instruction allows for improved random access while maintaining two IO pins, IO0 and IO1. It is similar to the Fast Read Dual Output (3Bh) instruction but with the capability to input the Address bits (A23-0) two bits per clock. This reduced instruction overhead may allow for code execution (XIP) directly from the Dual SPI in some applications.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 32,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read Quad I/O (EBh) \nThe Fast Read Quad I/O (EBh) instruction is similar to the Fast Read Dual I/O (BBh) instruction except that address and data bits are input and output through four pins IO 0, IO1, IO2 and IO3 and four Dummy clocks are required in SPI mode prior to the data output. The Quad I/O dramatically reduces instruction overhead allowing faster random access for code execution (XIP) directly from the Quad SPI. The Quad Enable bit (QE) of Status Register-2 must be set to enable the Fast Read Quad I/O Instruction.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 33,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Fast Read Quad I/O with \"8/16/32/64-Byte Wrap Around\" in Standard SPI mode\n\nThe Fast Read Quad I/O instruction can also be used to access a specific portion within a page by issuing a \"Set Burst with Wrap\" (77h) instruction prior to EBh. The \"Set Burst with Wrap\" (77h) instruction can either enable or disable the \"Wrap Around\" feature for the following EBh instructions. When \"Wrap Around\" is enabled, the data being accessed can be limited to either an 8, 16, 32 or 64-byte section of a 256-byte page. The output data starts at the initial address specified in the instruction, once it reaches the ending boundary of the 8/16/32/64-byte section, the output will wrap around to the beginning boundary automatically until /CS is pulled high to terminate the instruction.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 34,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Set Burst with Wrap (77h) \nIn Standard SPI mode, the Set Burst with Wrap (77h) instruction is used in conjunction with \"Fast Read Quad I/O\" instructions to access a fixed length of 8/16/32/64-byte section within a 256-byte page. Certain applications can benefit from this feature and improve the overall system code execution performance.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 35,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Page Program (02h) \nThe Page Program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased (FFh) memory locations. A Write Enable instruction must be executed before the device will accept the Page Program Instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"02h\" followed by a 24-bit address (A23-A0) and at least one data byte, into the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being sent to the device.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 36,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Quad Input Page Program (32h) \nThe Quad Page Program instruction allows up to 256 bytes of data to be programmed at previously erased (FFh) memory locations using four pins: IO 0, IO1, IO2, and IO 3. The Quad Page Program can improve performance for PROM Programmer and applications that have slow clock speeds <5MHz. Systems with faster clock speed will not realize much benefit for the Quad Page Program instruction since the inherent page program time is much greater than the time it take to clock-in the data.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 37,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Sector Erase instruction sets all memory within a specified sector (4K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Sector Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"20h\" followed a 24-bit sector address (A23-A0).",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 38,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (32K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"52h\" followed a 24-bit block address (A23-A0).",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 39,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Block Erase instruction sets all memory within a specified block (64K-bytes) to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Block Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"D8h\" followed a 24-bit block address (A23-A0).",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 40,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Chip Erase instruction sets all memory within the device to the erased state of all 1s (FFh). A Write Enable instruction must be executed before the device will accept the Chip Erase Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"C7h\" or \"60h\". The Chip Erase instruction sequence is shown in Figure 34.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 41,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Suspend instruction \"75h\", allows the system to interrupt a Sector or Block Erase operation or a Page Program operation and then read from or program/erase data to, any other sectors or blocks. The Erase/Program Suspend instruction sequence is shown in Figure 35a & 35b.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 42,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Erase/Program Resume instruction \"7Ah\" must be written to resume the Sector or Block Erase operation or the Page Program operation after an Erase/Program Suspend. The Resume instruction \"7Ah\" will be accepted by the device only if the SUS bit in the Status Register equals to 1 and the BUSY bit equals to 0. After issued the SUS bit will be cleared from 1 to 0 immediately, the BUSY bit will be set from 0 to 1 within 200ns and the Sector or Block will complete the erase operation or the page will complete the program operation. The Erase/Program Resume instruction sequence is shown in Figure 36a & 36b.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 43,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Although the standby current during normal operation is relatively low, standby current can be further reduced with the Power-down instruction. The lower power consumption makes the Power-down instruction especially useful for battery powered applications (See ICC1 and ICC2 in AC Characteristics). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"B9h\" as shown in Figure 37a & 37b.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 44,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Release from Power-down / Device ID instruction is a multi-purpose instruction. It can be used to release the device from the power-down state, or obtain the devices electronic identification (ID) number. To release the device from the power-down state, the instruction is issued by driving the /CS pin low, shifting the instruction code \"ABh\" and driving /CS high as shown in Figure 38a & 38b. Release from power-down will take the time duration of tRES1 (See AC Characteristics) before the device will resume normal operation and other instructions are accepted.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 45,
      "categories": [
        "Electrical Characteristics",
        "Product Summary"
      ],
      "content": "The Read Manufacturer/Device ID instruction is an alternative to the Release from Power-down / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID. The Device ID values for the W25Q33PW are listed in Manufacturer and Device Identification table.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 46,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Manufacturer / Device ID Dual I/O (92h) \nThe Read Manufacturer / Device ID Dual I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 2x speed.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 47,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Manufacturer / Device ID Quad I/O (94h)\nThe Read Manufacturer / Device ID Quad I/O instruction is an alternative to the Read Manufacturer / Device ID instruction that provides both the JEDEC assigned manufacturer ID and the specific device ID at 4x speed.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 48,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Unique ID Number (4Bh)\nThe Read Unique ID Number instruction accesses a factory-set read-only 64-bit number that is unique to each W25Q33PW device. The ID number can be used in conjunction with user software methods to help prevent copying or cloning of a system.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 49,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "For compatibility reasons, the W25Q33PW provides several instructions to electronically determine the identity of the device. The Read JEDEC ID instruction is compatible with the JEDEC standard for SPI compatible serial memories that was adopted in 2003. The instruction is initiated by driving the /CS pin low and shifting the instruction code \"9Fh\". The JEDEC assigned Manufacturer ID byte for Winbond (EFh) and two Device ID bytes, Memory Type (ID15 -ID8) and Capacity (ID7 -ID0) are then shifted out on the falling edge of CLK with most significant bit (MSB) first as shown in Figure 43a & 43b . For memory type and capacity values refer to Manufacturer and Device Identification table.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 50,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q33PW features a 256-Byte Serial Flash Discoverable Parameter (SFDP) register that contains information about device configurations, available instructions and other features. The SFDP parameters are stored in one or more Parameter Identification (PID) tables. Currently only one PID table is specified, but more may be added in the future. The Read SFDP Register instruction is compatible with the SFDP standard initially established in 2010 for PC and other applications, as well as the JEDEC standard JESD216 that is published in 2011.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 51,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The W25Q33PW offers three 256 -byte Security Registers which can be erased and programmed individually. These registers may be used by the system manufacturers to store security and other important information separately from the main memory array. The Erase Security Register instruction is similar to the Sector Erase instruction. A Write Enable instruction must be executed before the device will accept the Erase Security Register Instruction (Status Register bit WEL must equal 1). The instruction is initiated by driving the /CS pin low and shifting the instruction code \"44h\" followed by a 24-bit address (A23-A0) to erase one of the three security registers.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 52,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Program Security Registers (42h) \nThe Program Security Register instruction is similar to the Page Program instruction. It allows from one byte to 256 bytes of security register data to be programmed at previously erased (FFh) memory locations.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 53,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Read Security Registers (48h)\nThe Read Security Register instruction is similar to the Fast Read instruction and allows one or more data bytes to be sequentially read from one of the four security registers.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 54,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Set Read Parameters (C0h)\n\"Set Read Parameters (C0h)\" instruction is used to accommodate a wide range of applications with different needs for either maximum read frequency or minimum data access latency. This is accomplished by setting the number of dummy clocks and wrap length configurations for set of selected instructions.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 55,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Enable Reset (66h) and Reset Device (99h) \nBecause of the small package and the limitation on the number of pins, the W25Q33PW provide a software Reset instruction instead of a dedicated RESET pin. Once the Reset instruction is accepted, any on-going internal operations will be terminated and the device will return to its default power-on state and lose all the current volatile settings, such as Volatile Status Register bits, Write Enable Latch (WEL) status, Program/Erase Suspend status, Read parameter setting (P7-P0), Read Instruction Bypass Mode bit setting (M7-M0) and Wrap Bit setting (W6-W4).",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 56,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Clear Buffer(81h)\nThe Clear Buffer instruction allows all data in the buffer to be written as \"1\". A Write Enable instruction is not required and the instruction is initiated by driving the /CS pin low and then shifting the instruction code \"81h\" and a 24-bit address (A23-A0) to the DI pin. The /CS pin must be held low while instruction and address are transferred to the device. Then by driving /CS pin high, clearing the buffer with all \"1\". The Clear Buffer instruction sequence is shown in Figure 54a.\nAfter Release Power-down(ABh), a clear buffer command must be issued.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 57,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Write Buffer(82h)\nThe Write Buffer instruction allows to write from 1 byte to 256 bytes of data to the buffer. A Write Enable instruction is not required, and the instruction is initiated by driving the /CS pin low and then shifting the instruction code \"82h\" followed by a 24-bit address (A23-A0) and at least one data byte to the DI pin. The /CS pin must be held low for the entire length of the instruction while data is being transferred to the device. The Write Buffer instruction sequence is shown in Figure 54b.\nTo write the entire 256-byte buffer, the last address byte (the 8 least significant address bits) must be set to 0. The first 16 most significant address bits can be any address. If the last address byte is not zero, and the number of clocks exceeds the remaining buffer length, the addressing is wrapped to the beginning of the buffer. In some cases, less than 256 bytes (partial buffer) can be written without affecting other bytes within the buffer. One condition for performing a partial-buffer write is that the number of clocks cannot exceed the remaining buffer length. If more than 256 bytes are sent to the device, the addressing is wrapped to the beginning of the buffer, overwriting previously sent data.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 58,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Read Buffer instruction allows one or more data bytes to be sequentially read from the buffer. The instruction is initiated by driving the /CS pin low and then shifting the instruction code \"83h\" followed by a 24-bit address (A23-A0) and an 8-bit dummy into the DI pin. The code and address bits are latched on the rising edge of CLK. After the address is received, the data byte of the addressed memory location will be shifted out on the DO pin at the falling edge of CLK with the most significant bit (MSB) first. The address is automatically incremented to the next higher address after each byte of data is shifted out allowing for a continuous stream of data. This means that the entire buffer can be accessed with a single instruction as long as clock continues.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 59,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The program buffer instruction will program the buffer content into the physical memory page that is specified in the instruction. A Write Enable instruction must be executed before the device will accept the Program Buffer instruction (Status Register bit WEL= 1). The instruction is initiated by driving the /CS pin low then shifting the instruction code \"8Ah\" followed by a 24-bit address (A23-A0) into the DI pin as shown in Figure 54d. After /CS is driven high to complete the instruction cycle , the self -timed Program Buffer instruction will commence for a time duration of tPP (See AC Characteristics). While the Program Buffer cycle is in progress, the Read Status Register instruction may still be used for checking the status of the BUSY bit. The BUSY bit is a 1 during the Program Buffer cycle and becomes a 0 when the cycle is finished and the device is ready to accept other instructions again. After the Program Buffer cycle has finished, the Write Enable Latch (WEL) bit in the Status Register i s cleared to 0. The Program Execute instruction will not be executed if the addressed page is protected by the Block Protect (TB, BP2, BP1, and BP0) bits.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 60,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The Load Buffer instruction will write the contents of the physical memory page specified in the instruction to the buffer. A Write Enable instruction is not required, and the instruction is initiated by driving the /CS pin low then shifting the instruction code \"8Bh\" followed by a 24-bit address (A23-A0), and then driving /CS high as shown in Figure 54e.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 61,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.1 Absolute Maximum Ratings (1)\nParameters, Symbols, Conditions, Range, and Units for Supply Voltage, Voltage Applied to Any Pin, Transient Voltage on any Pin, Storage Temperature, Lead Temperature, and Electrostatic Discharge Voltage.\n\n9.2 Operating Ranges\nParameters, Symbols, Conditions, Specification Minimum and Maximum values for Supply Voltage and Ambient Temperature, Operating.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 62,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.3 Power-Up Power-Down Timing and Requirements\nParameters, Symbols, Specification Minimum and Maximum values, and Units for VCC (min) to /CS Low, Time Delay Before Write Instruction, Write Inhibit Threshold Voltage, The minimum duration for ensuring initialization will occur, VCC voltage needed to below VPWD for ensuring initialization will occur.\n\nFigures 58a and 58b showing Power-up Timing and Voltage Levels, and Power-up, Power-Down Requirement diagrams.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 63,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Power Cycle Requirement description and Figure 58c showing the Power Cycle Requirement diagram.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 67,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "AC Electrical Characteristics (cont'd)\n\nDESCRIPTION SYMBOL ALT SPEC UNIT\nMIN TYP MAX\nWrite Protect Setup Time Before /CS Low tWHSL(3)  20   ns\nWrite Protect Hold Time After /CS High tSHWL(3)  100   ns\n/CS High to Power-down Mode  tDP(2)    3 µs\n/CS High to Standby Mode without ID Read tRES1(2)    10 µs\n/CS High to next Instruction after Suspend tSUS(2)    20 µs\n/CS High to next Instruction after Reset tRST(2)    30 µs\n/RESET pin Low period to reset the device tRESET(2)  1(5)   µs\n/CS Low for JEDEC Reset Signaling tCSL  500   nS\n/CS High for JEDEC Reset Signaling tCSH  500   nS\nSetup Time for JEDEC Reset Signaling tS  5   nS\nHold Time for JEDEC Reset Signaling tD  5   nS\nInternal Reset Time for JEDEC Reset Signaling tRST2    100 mS\nWrite Status Register Time  tW   2 15 ms\nPage Program Time                     tPP   0.25 1.2 ms\nSector Erase Time (4KB)               tSE   30 400 ms\nBlock Erase Time (32KB)                 tBE1   100 800 ms\nBlock Erase Time (64KB) tBE2   120 1000 ms\nChip Erase Time tCE   12 40 s",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 68,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "9.7 Serial Output Timing\n\n9.8 Serial Input Timing\n\n9.9 WP Timing",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 69,
      "categories": [
        "Packaging Information"
      ],
      "content": "10. PACKAGE SPECIFICATIONS\n10.1 8-Pin SOIC 150-mil (Package Code SN)\n\nSYMBOL\nMILLIMETERS INCHES\nMin Nom Max Min Nom Max\nA 1.35 1.60 1.75 0.053 0.062 0.069\nA1 0.10 0.15 0.25 0.004 0.006 0.010\nb 0.33 0.41 0.51 0.013 0.016 0.020\nC 0.19 0.20 0.25 0.0075 0.0078 0.0098\nD 4.80 4.85 5.00 0.188 0.190 0.197\nE 3.80 3.90 4.00 0.150 0.153 0.157\nHE 5.80 6.00 6.20 0.288 0.236 0.244\ne 1.27BSC 0.050BSC\nL 0.40 0.71 1.27 0.016 0.027 0.050\ny --- --- 0.10 --- --- 0.004\n∘ 0° --- 10° 0° --- 10°",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 70,
      "categories": [
        "Packaging Information"
      ],
      "content": "Symbol \nMillimeters Inches \nMin Nom Max Min Nom Max \nA 1.75 1.95 2.16 0.069 0.077 0.085 \nA1 0.05 0.15 0.25 0.002 0.006 0.010 \nA2 1.70 1.80 1.91 0.067 0.071 0.075 \nb 0.35 0.42 0.48 0.014 0.017 0.019 \nC 0.19 0.20 0.25 0.007 0.008 0.010 \nD 5.18 5.28 5.38 0.204 0.208 0.212 \nD1 5.13 5.23 5.33 0.202 0.206 0.210 \nE 5.18 5.28 5.38 0.204 0.208 0.212 \nE1 5.13 5.23 5.33 0.202 0.206 0.210 \ne 1.27 BSC 0.050 BSC \nH 7.70 7.90 8.10 0.303 0.311 0.319 \nL 0.50 0.65 0.80 0.020 0.026 0.031 \ny --- --- 0.10 --- --- 0.004 \nθ 0° --- 8° 0° --- 8°",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 71,
      "categories": [
        "Packaging Information"
      ],
      "content": "Symbol Millimeters \nMin Nom Max \nA 0.30 0.35 0.40 \nA1 0.00 0.02 0.05 \nb 0.20 0.25 0.30 \nC --- 0.127 Ref. --- \nD 1.90 2.00 2.10 \nD2 1.55 1.60 1.65 \nE 2.90 3.00 3.10 \nE2 0.15 0.20 0.25 \ne --- 0.50 --- \nK 0.95 Ref. \nL 0.40 0.45 0.50 \ny 0.00 --- 0.075",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 72,
      "categories": [
        "Packaging Information"
      ],
      "content": "Symbol Millimeters Inches \nMin Nom Max Min Nom Max \nA 0.50 0.55 0.60 0.020 0.022 0.024 \nA1 0.00 0.02 0.05 0.000 0.001 0.002 \nA3 --- 0.15 --- --- 0.006 --- \nb 0.25 0.30 0.35 0.010 0.012 0.014 \nD 3.90 4.00 4.10 0.153 0.157 0.161 \nD1 0.70 0.80 0.90 0.027 0.031 0.035 \nD2 0.70 0.80 0.90 0.027 0.031 0.035 \nE 2.90 3.00 3.10 0.114 0.118 0.122 \nE1 0.10 0.20 0.30 0.004 0.008 0.012 \ne 0.80 BSC 0.031 BSC \nL 0.55 0.60 0.65 0.022 0.024 0.026",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 73,
      "categories": [
        "Packaging Information"
      ],
      "content": "10.5 Ordering Information\n\nNotes:\n1. The \"W\" prefix is not included on the part marking.\n2. Only the 2nd letter is used for the part marking; WSON package type ZP are not used for the part marking.\n3. Standard bulk shipments are in Tube (shape E). Please specify alternate packing method, such as Tape and Reel (shape T) or Tray (shape S), when placing orders.\n4. All devices are in compliance of RoHS, Halogen free, TSCA, REACH.",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    },
    {
      "page_number": 74,
      "categories": [
        "Packaging Information"
      ],
      "content": "10.6 Valid Part Numbers and Top Side Marking\n\nThe following table provides the valid part numbers for the W25Q33PW SpiFlash Memory. Please contact Winbond for specific availability by density and package type. Winbond SpiFlash memories use a 12-digit Product Number for ordering. However, due to limited space, the Top Side Marking on all packages uses an abbreviated 10-digit number.\n\nPACKAGE TYPE DENSITY PRODUCT NUMBER TOP SIDE MARKING\nSS\nSOIC-8 208mil   32M-BIT W25Q33PWSSIQ 25Q33PWSIQ\nSN\nSOIC-8 150mil 32M-BIT W25Q33PWSNIQ 25Q33PWNIQ\nXH\nXSON 2x3x0.4mm 32M-BIT W25Q33PWXHIQ BWywH\nIQxxxx\nUU\nUSON-8 4x3mm 32M-BIT W25Q33PWUUIQ Q33UUIQ\n\nNote:\n1. These package types are special order, please contact Winbond for more information.\n2. \"yw\" is date code",
      "grade": "F",
      "maker_pn": "W25Q33PW",
      "part number": "1107-004981"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "W25Q33PW is a 1.8V 32M-bit Serial NOR Flash memory with Dual/Quad SPI interface. It provides a storage solution for systems with limited space, pins and power.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "The W25Q33PW offers flexibility and performance beyond ordinary Serial Flash devices. It is ideal for code shadowing to RAM, executing code directly from Dual/Quad SPI (XIP), and storing voice, text and data.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "The W25Q33PW operates on a single 1.65V to 1.95V power supply with low current consumption of 0.1µA in power-down mode. It is offered in space-saving packages.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "The Read Manufacturer/Device ID instruction provides both the JEDEC assigned manufacturer ID and the specific device ID for the W25Q33PW, as listed in the Manufacturer and Device Identification table.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "The W25Q33PW has a 256-byte Serial SRAM buffer and Program Buffer, which can be used in conjunction with the Flash memory or independently. It also has three Status and Configuration Registers that provide information on the device status, configuration settings like write protection, Quad SPI mode, output driver strength, and more. The output driver strength can be configured to 25-ohm, 33-ohm, 50-ohm (default), or 100-ohm resistor values.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "The device supports various read instructions like Read Data, Fast Read, Fast Read Dual/Quad Output, Fast Read Dual/Quad I/O with options for setting burst length and wrap around. It also has instructions for Page Program, Quad Page Program, Sector/Block/Chip Erase, Erase/Program Suspend/Resume, Power-down, and reading device IDs and security registers. The security registers can be individually erased and programmed for storing sensitive information.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "The W25Q33PW provides instructions for setting read parameters, enabling reset, clearing and writing to the buffer, and programming the buffer content to memory. It has detailed electrical specifications covering absolute maximum ratings, operating ranges, power-up/down timing, AC characteristics for write/read/erase operations, and timing diagrams for serial input/output and write protect signals.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "Device resets when VCC is below threshold. Time delay write disable after Power-up. Write enable/disable instructions and automatic write disable after erase or program.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "Software and Hardware (/WP pin) write protection using Status Registers. Write Protection using Power-down instruction. Lock Down write protection for Status Register until the next power-up.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "One Time Program (OTP) write protection for array and Security Registers using Status Register. Write Protect Features for reliability and environmental conditions.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      }
    ],
    "Packaging Information": [
      {
        "content": "10.1 8-Pin SOIC 150-mil (Package Code SN) package specifications including dimensions, symbols, and tolerances for millimeters and inches. This chunk covers the physical dimensions and geometry of the 8-pin SOIC 150-mil package.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "10.4 16-Pin SOIC 300-mil (Package Code SW) package specifications including dimensions, symbols, and tolerances for millimeters and inches. This chunk covers the physical dimensions and geometry of the 16-pin SOIC 300-mil package.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "10.5 Ordering Information notes including part marking conventions, package types, shipping methods, and compliance information like RoHS and REACH. This chunk provides guidance on how to order parts and what to expect in terms of marking and packaging.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      },
      {
        "content": "10.6 Valid Part Numbers and Top Side Marking table listing the product numbers, top side markings, package types, and densities for the W25Q33PW SpiFlash Memory. This chunk allows users to cross-reference part numbers, markings, packages, and densities for ordering the correct device.",
        "part number": "1107-004981.pdf",
        "grade": "F",
        "maker_pn": "W25Q33PW"
      }
    ]
  },
  "part number": "1107-004981"
}