{
  "metadata": {
    "component_name": "LM25118-Q1",
    "manufacturer": "Texas Instruments",
    "key_specifications": "Wide voltage range (4V to 42V input) buck-boost switching regulator controller, supports up to 3A load current, 300kHz switching frequency, emulated current mode control, high voltage start-up regulator, adjustable oscillator frequency, internal high gain error amplifier, built-in current limiting and protection features.",
    "applications": "Automotive applications requiring wide input voltage range buck or buck-boost regulation, high efficiency battery powered systems, industrial power supplies.",
    "grade": "A",
    "maker_pn": "LM25118-Q1"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "The LM25118-Q1 wide voltage range Buck-Boost switching regulator controller features all of the functions necessary to implement a high-performance, cost-efficient Buck-Boost regulator using a minimum of external components. The Buck-Boost topology maintains output voltage regulation when the input voltage is either less than or greater than the output voltage making it especially suitable for automotive applications.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 3,
      "categories": [
        "Packaging Information"
      ],
      "content": "PWP Package \n20-Pin HTSSOP With Exposed Pad \nTop View \n\nPin Functions: \n\nPIN TYPE \nDESCRIPTION \nNO. NAME \n1 VIN P/I Input supply voltage. \n2 UVLO I If the UVLO pin is below 1.23 V, the regulator will be in standby mode... \n... \n16 VCC P/I/O Output of the bias regulator. Locally decouple to PGND using a low ESR/ESL capacitor located as close to the controller as possible.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 10,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 7. Oscillator Frequency vs RT",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 11,
      "categories": [
        "Application Circuits"
      ],
      "content": "7.2 Functional Block Diagram",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 12,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 8. Buck Mode Operation",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 13,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 9 shows the basic operation of buck-boost mode. In buck-boost mode, both Q1 and Q2 are active for the same time interval each cycle. The inductor current ramps up (proportional to VIN) when Q1 and Q2 are active and ramps down through the recirculating diode during the off-time. The first order buck-boost transfer function is VOUT/VIN = D/(1 – D), where D is the duty cycle of Q1 and Q2.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 14,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.3.1 UVLO\nAn undervoltage lockout pin is provided to disable the regulator when the input is below the desired operating range. If the UVLO pin is below 1.13 V, the regulator enters a standby mode with the outputs disabled, but with VCC regulator operating. If the UVLO input exceeds 1.23 V, the regulator will resume normal operation. A voltage divider from the input to ground can be used to set a VIN threshold to disable the regulator in brownout conditions or for low input faults.\n\n7.3.2 Oscillator and Sync Capability\nThe LM25118-Q1 oscillator frequency is set by a single external resistor connected between the RT pin and the AGND pin. The RT resistor should be located very close to the device and connected directly to the pins of the IC. To set a desired oscillator frequency (f), the necessary value for the RT resistor can be calculated from Equation 1:\n\nRT =6.4 x 109 / f - 3.02 x 103",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 15,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.3.3 Error Amplifier and PWM Comparator\nThe internal high gain error amplifier generates an error signal proportional to the difference between the regulated output voltage and an internal precision reference (1.23 V). The output of the error amplifier is connected to the COMP pin. Loop compensation components, typically a type II network shown in Figure 18 are connected between the COMP and FB pins. This network creates a low-frequency pole, a zero, and a noise reducing high-frequency pole. The PWM comparator compares the emulated current sense signal from the RAMP generator to the error amplifier output voltage at the COMP pin. The same error amplifier is used for operation in buck and buck-boost mode.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 16,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The ramp signal of a pulse-width modulator with current mode control is typically derived directly from the buck switch drain current. This switch current corresponds to the positive slope portion of the inductor current signal. Using this signal for the PWM ramp simplifies the control loop transfer function to a single pole response and provides inherent input voltage feed-forward compensation...Proper selection of the RAMP capacitor (CRAMP) depends upon the value of the output inductor (L) and the current sense resistor (RS). For proper current emulation, the sample and hold pedestal value and the ramp amplitude must have the same relative relationship to the actual inductor current.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 17,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The relationship between the average inductor current and the pedestal value of the sampled inductor current can cause instability in certain operating conditions. This instability is known as sub-harmonic oscillation, which occurs when the inductor ripple current does not return to its initial value by the start of the next switching cycle...In the buck mode the average inductor current is equal to the output current (Iout). In buck-boost mode the average inductor current is approximately equal to: (1 + VOUT/VIN) x Iout.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 18,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "In applications with low output inductance and high input voltage, the switch current may overshoot due to the propagation delay of the current limit comparator and control circuitry. If an overshoot should occur, the sample-and-hold circuit will detect the excess recirculating diode current. If the sample-and-hold pedestal level exceeds the internal current limit threshold, the buck switch will be disabled and will skip PWM cycles until the inductor current has decayed below the current limit threshold.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 19,
      "categories": [
        "Product Summary"
      ],
      "content": "Feature Description (continued)\n\nLimiting the maximum duty cycle will limit the maximum boost ratio (VOUT/VIN) while operating in buck-boost mode. For example, from Figure 15, at an operating frequency of 500 kHz, DMAX is 80%. Using the buck-boost transfer function.\n\n(8)\n\nwith\n• D = 80%, solving for VOUT results in\n• VOUT = 4 × VIN\n\nWith a minimum input voltage of 5 V, the maximum possible output voltage is 20 V at f = 500 kHz. The buck-boost step-up ratio can be increased by reducing the operating frequency which increases the maximum duty cycle.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 20,
      "categories": [
        "Product Summary"
      ],
      "content": "7.4 Device Functional Modes\n\nFigure 10 shows how duty cycle effects the operational mode and is useful for reference in the following discussions. Initially, only the buck switch is active and the buck duty cycle increases to maintain output regulation as VIN decreases. When VIN is approximately equal to 15.5 V, the boost switch begins to operate with a low duty cycle. If VIN continues to fall, the boost switch duty cycle increases and the buck switch duty cycle decreases until they become equal at VIN = 13.2 V.\n\n7.4.1 Buck Mode Operation: VIN > VOUT\n\nThe LM25118-Q1 buck-boost regulator operates as a conventional buck regulator with emulated current mode control while VIN is greater than VOUT and the buck mode duty cycle is less than 75%. In buck mode, the LO gate drive output to the boost switch remains low.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 21,
      "categories": [
        "Product Summary"
      ],
      "content": "7.4.3 High Voltage Start-Up Regulator\n\nThe LM25118-Q1 contains a dual-mode, high voltage linear regulator that provides the VCC bias supply for the PWM controller and the MOSFET gate driver. The VIN input pin can be connected directly to input voltages as high as 42 V. For input voltages below 10 V, an internal low dropout switch connects VCC directly to VIN. In this supply range, VCC is approximately equal to VIN. For VIN voltages greater than 10 V, the low dropout switch is disabled and the VCC regulator is enabled to maintain VCC at approximately 7 V. A wide operating range of 4 V to 42 V (with a startup requirement of at least 5 V) is achieved through the use of this dual-mode regulator.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 22,
      "categories": [
        "Application Circuits"
      ],
      "content": "The LM25118-Q1 high voltage switching regulator features all of the functions necessary to implement an efficient high voltage buck or buck-boost regulator using a minimum of external components. A buckboost regulator can maintain regulation for input voltages either higher or lower than the output voltage.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 23,
      "categories": [
        "Application Circuits"
      ],
      "content": "The design specifications are:\n• VOUT = 12 V\n• VIN = 5 V to 42 V\n• f = 300 kHz\n• Minimum load current (CCM operation) = 600 mA\n• Maximum load current = 3 A",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 24,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "RT sets the oscillator switching frequency. Generally speaking, higher operating frequency applications will use smaller components, but have higher switching losses. An operating frequency of 300 kHz was selected for this example as a reasonable compromise for both component size and efficiency. The value of RT can be calculated as:\n\n(9)\n\ntherefore, R7 = 18.3 kΩ",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The inductor value is determined based upon the operating frequency, load current, ripple current, and the input and output voltages. See Figure 20 for details.\n\nTo keep the circuit in continuous conduction mode (CCM), the maximum ripple current IRIPPLE should be less than twice the minimum load current. For the specified minimum load of 0.6 A, the maximum ripple current is 1.2 Ap-p. Also, the minimum value of L must be calculated both for a buck and buck-boost configurations. The final value of inductance will generally be a compromise between the two modes.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 26,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "To select the current sense resistor, begin by calculating the minimum K values for each mode using Equation 20 and Equation 21. K represents the slope compensation of the controller and is different for each mode, KBUCK and KBUCK-BOOST. KBUCK and KBUCK-BOOST were selected to be 1.33 and 3, respectively.\n\nWith the inductor value selected, the value of C3 necessary for the emulation ramp circuit is: \n\n(28)\n\nWith the inductance value (L1) selected as 10 µH, the calculated value for CRAMP is 333 pF. A standard value of 330 pF was selected.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The current limit for each mode can be calculated using Equation 29 and Equation 31. If the peak current limit is less than the calculated inductor peak current, the R13 and C15 need to be recalculated. This can be done by increasing the previous K values or M and reiterating the calculations.\n\nIn buck-boost mode, the output capacitors C9 – C12 must supply the entire output current during the switch on-time. For this reason, the output capacitors are chosen for operation in buck-boost mode, the demands being much less in buck operation. Both bulk capacitance and ESR must be considered to ensure a given output ripple voltage.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 28,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "IRMS(BUCK-BOOST)  =1 - D\nIOUT D(1 -D)\nIRMS(BUCK)  = IOUT D(1 -D)",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 29,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "OFF\nIN\nC21 R1 R3 R1 R3t Ln 1 .98R1 R3 V R3\nª º        « »   ¬ ¼ \n\nR3 = 1.23 x\nVIN(MIN) + 5 P A x R1 - 1.23\nR1\n- 1R9\nR8\n1.23V\nVOUT\n=\ntSS  = 10 P A\nC16 x 1.23V",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 30,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "fz = 2 x S x R4 x C18\n1\nESR zero = 2S x ESR x COUT\n1\nfRHPzero  =\nR LOAD  (1 - D)2\n2S x L x D\nMAX\nP(MOD)\nLOAD OUT\n1 D f 2 R C\n Su u\nDCGain (MOD)  =\nR LOAD  x VIN\n10R S(VIN + 2VOUT )",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 31,
      "categories": [
        "Application Circuits"
      ],
      "content": "C17 introduces an additional pole used to cancel high frequency switching noise. The error amplifier zero cancels the modulator pole leaving a single pose response at the crossover frequency of the loop gain if the crossover frequency is much lower than the right half plane zero frequency. A single pole response at the crossover frequency yields a very stable loop with 90 degrees of phase margin.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 32,
      "categories": [
        "Application Circuits"
      ],
      "content": "The plots shown in Figure 21 through Figure 26 show the gain and phase diagrams of the design example. The overall bandwidth is lower in a buck-boost application due the compensation challenges associated with the right-half-plane zero. For a pure buck application, the bandwidth could be much higher. The LM5116 data sheet is a good reference for compensation design of a pure buck mode regulator.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 33,
      "categories": [
        "Electrical Characteristics",
        "Application Circuits"
      ],
      "content": "Buck or Buck-boost regulators operating with high-input voltage can dissipate an appreciable amount of power while supplying the required bias current of the IC. The VCC regulator must step-down the input voltage VIN to a nominal VCC level of 7 V. The large voltage drop across the VCC regulator translates into high power dissipation in the VCC regulator. There are several techniques that can significantly reduce this bias regulator power dissipation.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 34,
      "categories": [
        "Application Circuits"
      ],
      "content": "The highest power dissipating components are the two power MOSFETs, the recirculating diode, and the output diode. The easiest way to determine the power dissipated in the MOSFETs is to measure the total conversion losses (PIN - POUT), then subtract the power losses in the Schottky diodes, output inductor and any snubber resistors. An approximation for the recirculating Schottky diode loss is:\n\nP = (1-D) × IOUT × VFWD (55)\n\nThe boost diode loss is:\n\nP = IOUT × VFWD (56)",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 35,
      "categories": [
        "Layout Guidelines"
      ],
      "content": "In a buck-boost regulator, there are two loops where currents are switched very fast. The first loop starts from the input capacitors, and then to the buck switch, the inductor, the boost switch then back to the input capacitor. The second loop starts from the inductor, and then to the output diode, the output capacitor, the recirculating diode, and back to the inductor. Minimizing the PCB area of these two loops reduces the stray inductance and minimizes noise and the possibility of erratic operation. A ground plane in the PCB is recommended as a means to connect the input filter capacitors to the output filter capacitors and the PGND pins of the LM25118-Q1.",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 37,
      "categories": [
        "Packaging Information"
      ],
      "content": "Orderable part number Status (1) Material type (2) Package | Pins Package qty | Carrier RoHS (3) Lead finish/ Ball material (4) MSL rating/ Peak reflow (5) Op temp (°C) Part marking (6)\nLM25118Q1MH/NOPB Active Production HTSSOP (PWP) | 20 73 | TUBE Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH\nLM25118Q1MH/NOPB.Z Active Production HTSSOP (PWP) | 20 73 | TUBE Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH\nLM25118Q1MHE/NOPB Active Production HTSSOP (PWP) | 20 250 | SMALL T&R Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH\nLM25118Q1MHE/NOPB.Z Active Production HTSSOP (PWP) | 20 250 | SMALL T&R Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH\nLM25118Q1MHX/NOPB Active Production HTSSOP (PWP) | 20 2500 | LARGE T&R Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH\nLM25118Q1MHX/NOPB.Z Active Production HTSSOP (PWP) | 20 2500 | LARGE T&R Yes SN Level-3-260C-168 HR -40 to 125 LM25118 Q1MH",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 39,
      "categories": [
        "Packaging Information"
      ],
      "content": "Device Package Type Package Drawing Pins SPQ Reel Diameter (mm) Reel Width W1 (mm) A0 (mm) B0 (mm) K0 (mm) P1 (mm) W (mm) Pin1 Quadrant\nLM25118Q1MHE/NOPB HTSSOP PWP 20 250 178.0 16.4 6.95 7.0 1.4 8.0 16.0 Q1\nLM25118Q1MHX/NOPB HTSSOP PWP 20 2500 330.0 16.4 6.95 7.0 1.4 8.0 16.0 Q1",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 40,
      "categories": [
        "Packaging Information"
      ],
      "content": "PACKAGE MATERIALS INFORMATION\n\nwww.ti.com 13-May-2025\n\nTAPE AND REEL BOX DIMENSIONS\n\nWidth (mm)\nW LH\n\n*All dimensions are nominal\nDevice Package Type Package Drawing Pins SPQ Length (mm) Width (mm) Height (mm)\nLM25118Q1MHE/NOPB HTSSOP PWP 20 250 208.0 191.0 35.0\nLM25118Q1MHX/NOPB HTSSOP PWP 20 2500 356.0 356.0 36.0",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 41,
      "categories": [
        "Packaging Information"
      ],
      "content": "PACKAGE MATERIALS INFORMATION\n\nwww.ti.com 13-May-2025\n\nTUBE\n\nL - Tube length\nT - Tube\nheight\nW - Tube\nwidth\nB - Alignment groove width\n\n*All dimensions are nominal\nDevice Package Name Package Type Pins SPQ L (mm) W (mm) T (µm) B (mm)\nLM25118Q1MH/NOPB PWP HTSSOP 20 73 495 8 2514.6 4.06\nLM25118Q1MH/NOPB.Z PWP HTSSOP 20 73 495 8 2514.6 4.06",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    },
    {
      "page_number": 43,
      "categories": [
        "Mechanical Characteristics"
      ],
      "content": "MECHANICAL DATA\nPWP0020A",
      "grade": "A",
      "maker_pn": "LM25118-Q1",
      "part number": "1107-004785"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The LM25118-Q1 is a wide voltage range Buck-Boost switching regulator controller that features all the necessary functions to implement a high-performance, cost-efficient Buck-Boost regulator using minimal external components. The Buck-Boost topology maintains output voltage regulation when the input voltage is either less than or greater than the output voltage, making it suitable for automotive applications.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The maximum duty cycle limits the maximum boost ratio (VOUT/VIN) while operating in buck-boost mode. For example, at 500 kHz, DMAX is 80%, resulting in a maximum output voltage of 20 V with a minimum input voltage of 5 V. The buck-boost step-up ratio can be increased by reducing the operating frequency, which increases the maximum duty cycle.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The LM25118-Q1 operates in different modes based on the duty cycle and input/output voltage relationship. In buck mode (VIN > VOUT), it operates as a conventional buck regulator with emulated current mode control. In buck-boost mode (VIN ≈ VOUT), both buck and boost switches operate with varying duty cycles. In boost mode (VIN < VOUT), it operates as a boost regulator.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The LM25118-Q1 contains a dual-mode, high voltage linear regulator that provides the VCC bias supply for the PWM controller and MOSFET gate driver. For VIN below 10 V, VCC is connected directly to VIN. For VIN above 10 V, the VCC regulator maintains VCC at approximately 7 V. This dual-mode regulator enables a wide operating range of 4 V to 42 V with a startup requirement of at least 5 V.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "Figure 7 shows the oscillator frequency vs RT. The LM25118-Q1 oscillator frequency is set by a single external resistor connected between the RT pin and the AGND pin. The RT resistor value can be calculated from Equation 1 to set the desired oscillator frequency. The oscillator has sync capability.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The error amplifier generates an error signal proportional to the difference between the regulated output voltage and an internal 1.23V reference. Loop compensation components create poles and zeros for stable operation. The PWM comparator compares the emulated current sense signal from the RAMP generator to the error amplifier output. The ramp signal is derived from the buck switch drain current, simplifying the control loop transfer function. Proper selection of the RAMP capacitor depends on the inductor value and current sense resistor for accurate current emulation.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The relationship between the average inductor current and the sampled inductor current pedestal value can cause sub-harmonic oscillation instability. In buck mode, the average inductor current equals the output current. In buck-boost mode, it is approximately (1 + VOUT/VIN) x IOUT. At low inductance and high input voltage, the switch current may overshoot, causing cycle skipping if the pedestal exceeds the current limit threshold.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "Design equations and examples are provided for selecting the RT resistor to set the oscillator frequency, the inductor value based on ripple current, the current sense resistor based on slope compensation factor K, the RAMP capacitor for current emulation, and the current limits for buck and buck-boost modes. Output capacitor selection is also discussed, considering RMS ripple current and ESR.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "Buck or buck-boost regulators with high input voltage can dissipate significant power supplying the IC bias current through the VCC regulator. Techniques to reduce this bias regulator power dissipation are mentioned.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      }
    ],
    "Application Circuits": [
      {
        "content": "7.2 Functional Block Diagram Figure 8 shows the basic operation of buck mode operation. Figure 9 shows the basic operation of buck-boost mode. In buck-boost mode, both Q1 and Q2 are active for the same time interval each cycle. The inductor current ramps up (proportional to VIN) when Q1 and Q2 are active and ramps down through the recirculating diode during the off-time. The first order buck-boost transfer function is VOUT/VIN = D/(1 – D), where D is the duty cycle of Q1 and Q2. The LM25118-Q1 high voltage switching regulator features all of the functions necessary to implement an efficient high voltage buck or buck-boost regulator using a minimum of external components. A buck-boost regulator can maintain regulation for input voltages either higher or lower than the output voltage.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The design specifications are: • VOUT = 12 V • VIN = 5 V to 42 V • f = 300 kHz • Minimum load current (CCM operation) = 600 mA • Maximum load current = 3 A RT sets the oscillator switching frequency. Generally speaking, higher operating frequency applications will use smaller components, but have higher switching losses. An operating frequency of 300 kHz was selected for this example as a reasonable compromise for both component size and efficiency. The value of RT can be calculated as: (9) therefore, R7 = 18.3 kΩ C17 introduces an additional pole used to cancel high frequency switching noise.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The error amplifier zero cancels the modulator pole leaving a single pose response at the crossover frequency of the loop gain if the crossover frequency is much lower than the right half plane zero frequency. A single pole response at the crossover frequency yields a very stable loop with 90 degrees of phase margin. The plots shown in Figure 21 through Figure 26 show the gain and phase diagrams of the design example. The overall bandwidth is lower in a buck-boost application due the compensation challenges associated with the right-half-plane zero. For a pure buck application, the bandwidth could be much higher. The LM5116 data sheet is a good reference for compensation design of a pure buck mode regulator.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "Buck or Buck-boost regulators operating with high-input voltage can dissipate an appreciable amount of power while supplying the required bias current of the IC. The VCC regulator must step-down the input voltage VIN to a nominal VCC level of 7 V. The large voltage drop across the VCC regulator translates into high power dissipation in the VCC regulator. There are several techniques that can significantly reduce this bias regulator power dissipation. The highest power dissipating components are the two power MOSFETs, the recirculating diode, and the output diode. The easiest way to determine the power dissipated in the MOSFETs is to measure the total conversion losses (PIN - POUT), then subtract the power losses in the Schottky diodes, output inductor and any snubber resistors. An approximation for the recirculating Schottky diode loss is: P = (1-D) × IOUT × VFWD (55) The boost diode loss is: P = IOUT × VFWD (56)",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      }
    ],
    "Mechanical Characteristics": [
      {
        "content": "MECHANICAL DATA: Physical dimensions, form factor, and mechanical specifications for the PWP0020A component.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "PWP0020A mounting information: Details on how to properly mount and install the PWP0020A component, including mounting holes, clearance requirements, and compatible mounting hardware.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "PWP0020A mechanical characteristics: Robust mechanical design details for the PWP0020A, such as materials used, weight, shock and vibration resistance, and operating temperature ranges.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "PWP0020A form factor and dimensions: Specific details on the physical size, shape, and dimensions of the PWP0020A component to ensure proper fit and integration.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      }
    ],
    "Packaging Information": [
      {
        "content": "The LM25118 is available in a 20-pin HTSSOP (PWP) package with an exposed pad. The package has a top view illustration showing the pin assignments and functions. Pin 1 is the input supply voltage (VIN), pin 2 is the UVLO (undervoltage lockout) pin, and pin 16 is the VCC output of the bias regulator.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "The LM25118 is offered in several orderable part numbers with different packaging options. These include a tube of 73 units (LM25118Q1MH/NOPB), a small reel of 250 units (LM25118Q1MHE/NOPB), and a large reel of 2500 units (LM25118Q1MHX/NOPB). All packages use a lead-free SnPb finish and have an MSL rating of 3 with a peak reflow temperature of 260°C. The operating temperature range is -40°C to 125°C.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "Detailed packaging information is provided for the small reel (LM25118Q1MHE/NOPB) and large reel (LM25118Q1MHX/NOPB) options. This includes the reel diameter, reel width, package dimensions (A0, B0, K0, P1, W), and the quadrant location of pin 1. Box dimensions for the reels are also specified, including the length, width, and height.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      },
      {
        "content": "For the tube packaging options (LM25118Q1MH/NOPB and LM25118Q1MH/NOPB.Z), the tube length, width, height, and alignment groove width are provided. This information is useful for automated pick-and-place equipment and packaging handling.",
        "part number": "1107-004785.pdf",
        "grade": "A",
        "maker_pn": "LM25118-Q1"
      }
    ]
  },
  "part number": "1107-004785"
}