{
  "metadata": {
    "component_name": "JW5070",
    "manufacturer": "N/A (not explicitly stated in the given text)",
    "key_specifications": "4.5V to 28V operating input range, 3A continuous output current, integrated 80mΩ and 40mΩ MOSFETs, 50uA quiescent current, 0.596V±1% reference voltage, fixed 500kHz switching frequency, input under voltage lockout, current run-away protection, output short protection, thermal protection, TSOT23-6 package",
    "applications": "Industrial Application: Appliance, Surveillance, E-meter; Enterprise System: Multifunction Printers; Personal Electronics: Monitors, Audios, TVs; General Purpose for Power Bus Supply",
    "grade": "E",
    "maker_pn": "JW5070"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "DESCRIPTION\nThe JW 5070 is a monolithic buck switching regulator based on PCM architecture. Operating with an input range of 4.5V~28V, JW5070 delivers 3A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode. At light loads, the regulator operates in low frequency to maintain high efficiency and low output ripples.\n\nJW5070 guarantees robustness with output short protection, thermal protection, current run-away protection, input under voltage lockout.\n\nJW5070 is available in TSOT23-6 package, which provide a compact solution with minimal external components.\n\nFEATURES\n• 4.5V to 28V Operating Input Range\n• Integrated 80mΩ and 40mΩ MOSFETs\n• 50uA Quiescent Current\n• 0.596V±1% Reference Voltage\n• Fixed 500kHz Switching Frequency\n• Accurate EN Control\n• Input Under Voltage Lockout\n• Current Run-away Protection\n• Output Short Protection\n• Thermal Protection\n• Available in TSOT23-6 Package\n\nAPPLICATIONS\n• Industrial Application: Appliance, Surveillance, E-meter\n• Enterprise System: Multifunction Printers\n• Personal Electronics: Monitors, Audios, TVs\n• General Purpose for Power Bus Supply",
      "grade": "E",
      "maker_pn": "JW5070",
      "part number": "1203-001120"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The JW 5070 is a monolithic buck switching regulator based on PCM architecture. It operates with an input range of 4.5V to 28V and delivers 3A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the need for an external Schottky diode. At light loads, the regulator operates in low frequency to maintain high efficiency and low output ripples.",
        "part number": "1203-001120.pdf",
        "grade": "E",
        "maker_pn": "JW5070"
      },
      {
        "content": "JW5070 guarantees robustness with features like output short protection, thermal protection, current run-away protection, and input under voltage lockout. It is available in a compact TSOT23-6 package, providing a space-saving solution with minimal external components.",
        "part number": "1203-001120.pdf",
        "grade": "E",
        "maker_pn": "JW5070"
      },
      {
        "content": "Key features of JW5070 include a 4.5V to 28V operating input range, integrated 80mΩ and 40mΩ MOSFETs, 50uA quiescent current, 0.596V±1% reference voltage, fixed 500kHz switching frequency, accurate EN control, input under voltage lockout, current run-away protection, output short protection, and thermal protection.",
        "part number": "1203-001120.pdf",
        "grade": "E",
        "maker_pn": "JW5070"
      },
      {
        "content": "JW5070 is suitable for a wide range of applications, including industrial applications like appliances, surveillance, and E-meters, enterprise systems like multifunction printers, personal electronics like monitors, audios, and TVs, as well as general-purpose power bus supply.",
        "part number": "1203-001120.pdf",
        "grade": "E",
        "maker_pn": "JW5070"
      }
    ]
  },
  "part number": "1203-001120"
}