{
  "metadata": {
    "component_name": "JWH5141/JWH5141F",
    "manufacturer": "Not specified in the given text",
    "key_specifications": "100V/1A Synchronous Step-Down Converter, 6V to 100V Operating Input Range, 1A Output Current, Internal Soft-start, Adjustable Switch Frequency, FCCM at Light Load (JWH5141F), PFM at Light Load (JWH5141), Input under Voltage Lockout, Current Run-away Protection, Short Circuit Protection, Thermal Protection, Available in ESOP8 Package",
    "applications": "Distributed Power Systems, Smart Meter, Automotive Systems, High Voltage Power Conversion, Industrial Power Systems, Battery Powered Systems",
    "grade": "B",
    "maker_pn": "JWH5141"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "JWH5141/JWH5141F \n 100V/1A Synchronous \n          Step-Down Converter \n\nDESCRIPTION \nThe JWH5141 and JWH5141F are monolithic buck switching regulators based on constant on-time control (COT) for fast transient response. Operating with a wide input voltage range of 6V~100V, the JWH5141 and JWH5141F deliver 1A of continuous output current with two integrated MOSFETs. Constant on-time control mode control provides tight load transient response and cycle-by-cycle current limit. At light loads, JWH5141 operates in low frequency to maintain high efficiency, while JWH5141F operates in continuous current mode for frequency sensitive application. \n\nFEATURES\n- 6V to 100V Operating Input Range\n- 1A Output Current\n- Internal Soft-start\n- Adjustable Switch Frequency\n- FCCM at Light Load (JWH5141F)\n- PFM at Light Load (JWH5141)\n- Input under Voltage Lockout\n- Current Run-away Protection\n- Short Circuit Protection\n- Thermal Protection\n- Available in ESOP8 Package\n\nAPPLICATIONS\n- Distributed Power Systems\n- Smart Meter\n- Automotive Systems\n- High Voltage Power Conversion\n- Industrial Power Systems\n- Battery Powered Systems",
      "grade": "B",
      "maker_pn": "JWH5141",
      "part number": "1203-002880"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "JWH5141/JWH5141F are monolithic buck switching regulators based on constant on-time control (COT) for fast transient response. Operating with a wide input voltage range of 6V~100V, they deliver 1A of continuous output current with two integrated MOSFETs. Constant on-time control mode provides tight load transient response and cycle-by-cycle current limit.",
        "part number": "1203-002880.pdf",
        "grade": "B",
        "maker_pn": "JWH5141"
      },
      {
        "content": "JWH5141 operates in low frequency at light loads to maintain high efficiency, while JWH5141F operates in continuous current mode for frequency sensitive applications. Key features include 6V to 100V operating input range, 1A output current, internal soft-start, adjustable switch frequency, input under voltage lockout, current run-away protection, short circuit protection, and thermal protection.",
        "part number": "1203-002880.pdf",
        "grade": "B",
        "maker_pn": "JWH5141"
      },
      {
        "content": "The JWH5141/JWH5141F are suitable for various applications such as distributed power systems, smart meters, automotive systems, high voltage power conversion, industrial power systems, and battery powered systems. They are available in the ESOP8 package.",
        "part number": "1203-002880.pdf",
        "grade": "B",
        "maker_pn": "JWH5141"
      }
    ]
  },
  "part number": "1203-002880"
}