{
  "metadata": {
    "component_name": "TPS54331",
    "manufacturer": "Texas Instruments",
    "key_specifications": "3-A, 28-V input, step-down DC-DC converter, integrated 80-mΩ high-side MOSFET, 570-kHz switching frequency, pulse skipping Eco-mode for high efficiency at light loads, adjustable output voltage down to 0.8V, overvoltage transient protection, thermal shutdown protection",
    "applications": "Consumer applications (set-top boxes, CPE equipment, LCD displays, peripherals, battery chargers), industrial and car-audio power supplies, 5V/12V/24V distributed power systems",
    "grade": "A",
    "maker_pn": "TPS54331"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "TPS54331 3-A, 28-V Input, Step Down DC-DC Converter With Eco-mode\n\n1 Features\n• 3.5 to 28-V input voltage range\n• Adjustable output voltage down to 0.8 V\n• Integrated 80-mΩ high-side MOSFET supports up to 3-A continuous output current\n• High efficiency at light loads with a pulse skipping Eco-mode\n• Fixed 570-kHz switching frequency\n• Typical 1-μA shutdown quiescent current\n• Adjustable slow-start limits inrush currents\n• Programmable UVLO threshold\n• Overvoltage transient protection\n• Cycle-by-cycle current limit, frequency foldback, and thermal shutdown protection\n• Available in easy-to-use SOIC8 package or thermally-enhanced SOIC8 PowerPAD™ integrated circuit package\n\n2 Applications\n• Consumer applications such as set-top boxes, CPE equipment, LCD displays, peripherals, and battery chargers\n• Industrial and car-audio power supplies\n• 5-V, 12-V, and 24-V distributed power systems\n\n3 Description\nThe TPS54331 device is a 28-V, 3-A non-synchronous buck converter that integrates a low RDS(on) high-side MOSFET. To increase efficiency at light loads, a pulse skipping Eco-mode feature is automatically activated. Furthermore, the 1- μA shutdown supply-current allows the device to be used in battery-powered applications.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 3,
      "categories": [
        "Pin Configuration and Functions"
      ],
      "content": "Table 5-1. Pin Functions\n\nPIN\nI/O DESCRIPTION\nNO. NAME\n1 BOOT O A 0.1-μF bootstrap capacitor is required between the BOOT and PH pins. If the voltage on this capacitor falls below the minimum requirement, the high-side MOSFET is forced to switch off until the capacitor is refreshed.\n2 VIN I This pin is the 3.5-V to 28-V input supply voltage.\n3 EN I This pin is the enable pin. To disable, pull below 1.25 V. Float this pin to enable. Programming the input undervoltage lockout with two resistors is recommended.\n4 SS I This pin is slow-start pin. An external capacitor connected to this pin sets the output rise time.\n5 VSENSE I This pin is the inverting node of the transconductance (gm) error amplifier.\n6 COMP O This pin is the error-amplifier output and the input to the PWM comparator. Connect frequency compensation components to this pin.\n7 GND — Ground pin\n8 PH O The PH pin is the source of the internal high-side power MOSFET.\n9 PowerPAD — The PowerPAD is only available on the DDA package. For proper operation, the GND pin must be connected to the exposed pad.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 7,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 6-1. ON Resistance vs Junction Temperature\nFigure 6-2. Shutdown Quiescent Current vs Input Voltage\nFigure 6-3. Switching Frequency vs Junction Temperature\nFigure 6-4. Voltage Reference vs Junction Temperature\nFigure 6-5. Minimum Controllable On Time vs Junction Temperature\nFigure 6-6. Minimum Controllable Duty Ratio vs Junction Temperature",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 8,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 6-7. SS Charge Current vs Junction Temperature\nFigure 6-8. Current-Limit Threshold vs Input Voltage",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 9,
      "categories": [
        "Product Summary"
      ],
      "content": "The TPS54331 device is a 28-V, 3-A, step-down (buck) converter with an integrated high-side n-channel MOSFET. To improve performance during line and load transients, the device implements a constant-frequency current mode control, which reduces output capacitance and simplifies external frequency compensation design. The TPS54331 device has a preset switching frequency of 570 kHz.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 13,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "7.3.10 Overvoltage Transient Protection\nThe TPS54331 device incorporates an overvoltage transient-protection (OVTP) circuit to minimize output voltage overshoot when recovering from output fault conditions or strong unload transients. The OVTP circuit includes an overvoltage comparator to compare the VSENSE pin voltage and internal thresholds. When the VSENSE pin voltage goes above 109% × V REF, the high-side MOSFET is forced off. When the VSENSE pin voltage falls below 107% × VREF, the high-side MOSFET is enabled again.\n\n7.3.11 Thermal Shutdown\nThe device implements an internal thermal shutdown to protect the device if the junction temperature exceeds 165°C. The thermal shutdown forces the device to stop switching when the junction temperature exceeds the thermal trip threshold. When the die temperature decreases below 165°C, the device reinitiates the power-up sequence.\n\n7.4.1 Eco-mode\nThe TPS54331 device is designed to operate in pulse skipping Eco-mode at light load currents to boost light load efficiency. When the peak inductor current is lower than 160 mA (typical), the COMP pin voltage falls to 0.5 V (typical) and the device enters Eco-mode. When the device is in Eco-mode, the COMP pin voltage is clamped at 0.5 V internally, which prevents the high-side integrated MOSFET from switching. The peak inductor current must rise above 160 mA for the COMP pin voltage to rise above 0.5 V and exit Eco-mode. Because the integrated current comparator catches the peak inductor current only, the average load current entering Eco-mode varies with the applications and external output filters.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 14,
      "categories": [
        "Product Summary"
      ],
      "content": "For additional design needs, see the following devices:\n\nParameter TPS54231 TPS54232 TPS54233 TPS54331 TPS54332\nIO (maximum) 2 A 2 A 2 A 3 A 3.5 A\nInput voltage range 3.5 to 28 V 3.5 to 28 V 3.5 to 28 V 3.5 to 28 V 3.5 to 28 V\nSwitching frequency (typical) 570 kHz 1000 kHz 285 kHz 570 kHz 1000 kHz\nSwitch current limit (minimum) 2.3 A 2.3 A 2.3 A 3.5 A 4.2 A\nPin and package 8SOIC 8SOIC 8SOIC 8SOIC 8SO PowerPAD 8SO PowerPAD",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 15,
      "categories": [
        "Application Circuits"
      ],
      "content": "8.2 Typical Application\n\n0.01 µF 4.7µF 4.7µF Vin 7 V – 28 V 0.01 μF 0.1 μF 332 kΩ 68.1 kΩ 47 pF 0Ω 47 µF Vout 3.3 V Iout Max 3 A 6.8 µH 10.2 kΩ 3.24 kΩ 29.4 kΩ 1000 pF 47 µF\n\nFigure 8-1. Typical Application Schematic",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 16,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "The maximum RMS ripple current must also be checked. For worst case conditions, use Equation 7 to calculate the maximum-RMS input ripple current, ICIN(RMS).\n\nICIN(RMS) = IOUT(MAX) / √2 (7)\n\nIn this case, the input ripple voltage is 143 mV and the RMS ripple current is 1.5 A.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 17,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Use Equation 11 to calculate the peak inductor current.\n\nILPK = IOUT(MAX) + ILPP / 2 (11)\n\nFor this design, the RMS inductor current is 3.01 A and the peak inductor current is 3.47 A. The selected inductor is a Sumida CDRH103-6R8, 6.8 μH. This inductor has a saturation current rating of 3.84 A and an RMS current rating of 3.6 A, which meets these requirements.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 18,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Use Equation 15 to calculate the maximum RMS ripple current.\n\nICOUT(RMS) = √(1/12) * (VOUT * (VIN(MAX) - VOUT) / (VIN(MAX) * LOUT * FSW * NC)) (15)\n\nwhere NC is the number of output capacitors in parallel.\n\nFor this design example, two 47-μF ceramic output capacitors are selected for C8 and C9. These capacitors are TDK C3216X5R0J476MT, rated at 6.3 V with a maximum ESR of 2 mΩ and a ripple current rating in excess of 3 A. The calculated total RMS ripple current is 161 mA (80.6 mA each) and the maximum total ESR required is 43 mΩ. These output capacitors exceed the requirements by a wide margin and result in a reliable, high-performance design.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 19,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Now that the phase loss is known, the required amount of phase boost to meet the phase margin requirement can be determined. Use Equation 22 to calculate the required phase boost.\nPB = PM - 90 deg - PL (22)\nwhere\n• PM is the desired phase margin.\nA zero-pole pair of the compensation network is placed symmetrically around the intended closed-loop frequency to provide maximum phase boost at the crossover point. The amount of separation can be calculated with Equation 23. Use Equation 24 and Equation 25 to calculate the resultant zero and pole frequencies.\nk = tan(PB/2 + 45 deg) (23)\nFZ1 = FCO/k (24) \nFP1 = FCO * k (25)",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 20,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "For this design, the two 47-μF output capacitors are used. For ceramic capacitors, the actual output capacitance is less than the rated value when the capacitors have a DC bias voltage applied, which occurs in a DC-DC converter. The actual output capacitance can be as low as 54 μF. The combined ESR is approximately 0.001 Ω.\n\nUsing Equation 20 and Equation 21, the output stage gain and phase loss are equivalent as:\n• Gain = –2.26 dB\n• PL = –83.52 degrees\n\nFor 70 degrees of phase margin, Equation 22 requires 63.52 degrees of phase boost.\n\nUse Equation 23 , Equation 24 , and Equation 25  to calculate the zero and pole frequencies of the following values:\n• FZ1 = 5883 Hz\n• FP1 = 106200 Hz\n\nUse Equation 26, Equation 27, and Equation 28 to calculate the values of RZ, CZ, and CP.\nRZ = 29.2 kΩ (29)\nCZ = 928 pF (30)\nCP = 51 pF (31)",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 21,
      "categories": [
        "Electrical Characteristics",
        "Reliability and Environmental Conditions"
      ],
      "content": "8.2.2.8 Bootstrap Capacitor\nEvery TPS54331 design requires a bootstrap capacitor, C4. The bootstrap capacitor must have a value of 0.1 μF. The bootstrap capacitor is located between the PH pin and BOOT pin. The bootstrap capacitor must be a high-quality ceramic type with X7R or X5R grade dielectric for temperature stability.\n\n8.2.2.9 Catch Diode\nThe TPS54331 device is designed to operate using an external catch diode between the PH and GND pins. The selected diode must meet the absolute maximum ratings for the application. The reverse voltage must be higher than the maximum voltage at the PH pin, which is VIN(MAX) + 0.5 V. The peak current must be greater than IOUT(MAX) plus half the peak-to peak-inductor current. The forward-voltage drop must be small for higher efficiencies. The catch diode conduction time is (typically) longer than the high-side FET on time, so attention paid to diode parameters can make a marked improvement in overall efficiency. Additionally, check that the selected device is capable of dissipating the power losses. For this design, a Diodes, Inc. B340A was selected, with a reverse voltage of 40 V, forward current of 3 A, and a forward-voltage drop of 0.5 V.\n\n8.2.2.10 Output Voltage Limitations\nBecause of the internal design of the TPS54331 device, any given input voltage has both upper and lower output voltage limits.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 22,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "3. Gate charge loss:\nPgc = 22.8 × 10-9 × ƒSW\n4. Quiescent current loss\nPq = 0.11 × 10-3 × VIN\nTherefore:\nPtot = Pcon + Psw + Pgc + Pq\nwhere\n• Ptot is the total device power dissipation (W).\nFor given TA :\nTJ = TA + Rth × Ptot\nwhere\n• TJ is the junction temperature (°C).\n• TA is the ambient temperature (°C).\n• Rth is the thermal resistance of the package (°C/W).\nFor given TJMAX = 150°C:\nTAMAX = TJMAX – Rth × Ptot\nwhere\n• TJMAX is maximum junction temperature (°C).\n• TAMAX is maximum ambient temperature (°C).",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 23,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 8-2. Efficiency\nFigure 8-3. Low Current Efficiency\nFigure 8-4. Load Regulation\nFigure 8-5. Line Regulation\nFigure 8-6. Transient Response\nFigure 8-7. Loop Response",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 24,
      "categories": [
        "Application Circuits"
      ],
      "content": "Figure 8-8. Output Ripple\nFigure 8-9. Input Ripple\nFigure 8-10. Start-Up\nFigure 8-11. Start-Up Relative to Enable\nFigure 8-12. Typical Minimum Output Voltage vs Input Voltage\nFigure 8-13. Typical Maximum Output Voltage vs Input Voltage",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 25,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "Figure 8-14. Maximum Power Dissipation vs Junction Temperature\n\nFigure 8-15. Maximum Power Dissipation vs Junction Temperature\n\n8.3 Power Supply Recommendations\nThe devices are designed to operate from an input-voltage supply range between 3.5 V and 28 V. This input supply must be well regulated. If the input supply is located more than a few inches from the converter, additional bulk capacitance can be required in addition to the ceramic bypass capacitors. An electrolytic capacitor with a value of 100 μF is a typical choice.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 26,
      "categories": [
        "Application Circuits"
      ],
      "content": "8.4 Layout\n8.4.1 Layout Guidelines\nThe VIN pin must be bypassed to ground with a low-ESR ceramic bypass capacitor. Take care to minimize the loop area formed by the bypass capacitor connections, the VIN pin, and the anode of the catch diode. The typical recommended bypass capacitor is 10- μF ceramic with a X5R or X7R dielectric and the optimum placement is closest to the VIN pins and the source of the anode of the catch diode. Figure 8-16 shows a PCB layout example. The GND pin must be tied to the PCB ground plane at the pin of the device. The source of the low-side MOSFET must be connected directly to the top-side PCB ground area used to tie together the ground sides of the input and output capacitors as well as the anode of the catch diode. The PH pin must be routed to the cathode of the catch diode and to the output inductor. Because the PH connection is the switching node, the catch diode and output inductor must be located very close to the PH pins, and the area of the PCB conductor minimized to prevent excessive capacitive coupling. For operation at full rated load, the top-side ground area must provide adequate heat dissipating area. The TPS54331 device uses a fused lead frame so that the GND pin acts as a conductive path for heat dissipation from the die. Many applications have larger areas of internal or back-side ground plane available, and the top-side ground area can be connected to these areas using multiple vias under or adjacent to the device to help dissipate heat. The additional external components can be placed approximately as shown. Obtaining acceptable performance with alternate layout schemes can be possible, however this layout has been shown to produce good results and is intended as a guideline.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 27,
      "categories": [
        "Electrical Characteristics"
      ],
      "content": "8.4.3 Electromagnetic Interference (EMI) Considerations\nAs EMI becomes a rising concern in more and more applications, the internal design of the TPS54331 device includes features to reduce the EMI. The high-side MOSFET gate drive is designed to reduce the PH pin voltage ringing. The internal IC rails are isolated to decrease the noise sensitivity. A package bond wire scheme is used to lower the parasitics effects.\n\nTo achieve the best EMI performance, external component selection and board layout are equally important. Follow the steps listed in Section 8.2.2 to prevent potential EMI issues.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 28,
      "categories": [
        "Product Summary"
      ],
      "content": "9.1.1.1 Custom Design with WEBENCH® Tools\nClick here to create a custom design using the WEBENCH Power Designer.\n1. Start by entering your VIN, VOUT and IOUT requirements.\n2. Optimize your design for key parameters like efficiency, footprint and cost using the optimizer dial and compare this design with other possible solutions from Texas Instruments.\n3. WEBENCH Power Designer provides you with a customized schematic along with a list of materials with real time pricing and component availability.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 29,
      "categories": [
        "Packaging Information"
      ],
      "content": "TPS54331D Active Production SOIC (D) | 8 75 | TUBE Yes NIPDAU Level-1-260C-UNLIM -40 to 150 54331\nTPS54331DDA Active Production SO PowerPAD (DDA) | 8 75 | TUBE Yes NIPDAU Level-2-260C-1 YEAR -40 to 150 54331\nTPS54331DDAR Active Production SO PowerPAD (DDA) | 8 2500 | LARGE T&R Yes NIPDAU Level-2-260C-1 YEAR -40 to 150 54331",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 38,
      "categories": [
        "Packaging Information"
      ],
      "content": "SOIC - 1.75 mm max height\nNOTES:\n1. Linear dimensions are in inches [millimeters]. Dimensions in parenthesis are for reference only. Controlling dimensions are in inches. Dimensioning and tolerancing per ASME Y14.5M.\n2. This drawing is subject to change without notice.\n3. This dimension does not include mold flash, protrusions, or gate burrs. Mold flash, protrusions, or gate burrs shall not exceed .006 [0.15] per side.\n4. This dimension does not include interlead flash.\n5. Reference JEDEC registration MS-012, variation AA.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    },
    {
      "page_number": 39,
      "categories": [
        "Packaging Information"
      ],
      "content": "NOTES: (continued)\n6. Publication IPC-7351 may have alternate designs.\n7. Solder mask tolerances between and around signal pads can vary based on board fabrication site.",
      "grade": "A",
      "maker_pn": "TPS54331",
      "part number": "1203-006618"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "TPS54331 is a 3-A, 28-V input, step down DC-DC converter with Eco-mode for high efficiency at light loads. It features a 3.5 to 28-V input voltage range, adjustable output voltage down to 0.8 V, integrated 80-mΩ high-side MOSFET supporting up to 3-A continuous output current, fixed 570-kHz switching frequency, and typical 1-μA shutdown quiescent current.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "The TPS54331 device implements constant-frequency current mode control, reducing output capacitance and simplifying external frequency compensation design. It offers protection features like adjustable slow-start to limit inrush currents, programmable UVLO threshold, overvoltage transient protection, cycle-by-cycle current limit, frequency foldback, and thermal shutdown.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "TPS54331 is suitable for consumer applications like set-top boxes, CPE equipment, LCD displays, peripherals, battery chargers, industrial and car-audio power supplies, and 5-V, 12-V, and 24-V distributed power systems. It is available in easy-to-use SOIC8 package or thermally-enhanced SOIC8 PowerPAD integrated circuit package.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "The TPS54331 is part of a family of DC-DC converters from Texas Instruments with varying maximum output current, input voltage range, switching frequency, switch current limit, and package options like the TPS54231, TPS54232, TPS54233, and TPS54332.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "Texas Instruments provides the WEBENCH Power Designer tool to create custom designs with the TPS54331, allowing users to enter VIN, VOUT and IOUT requirements, optimize for efficiency, footprint and cost, and generate a customized schematic with a list of materials and real-time pricing and component availability.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      }
    ],
    "Electrical Characteristics": [
      {
        "content": "Figure 6-1 shows the on resistance vs junction temperature. Figure 6-2 shows the shutdown quiescent current vs input voltage. Figure 6-3 shows the switching frequency vs junction temperature. Figure 6-4 shows the voltage reference vs junction temperature. Figure 6-5 shows the minimum controllable on time vs junction temperature. Figure 6-6 shows the minimum controllable duty ratio vs junction temperature.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "The TPS54331 device incorporates an overvoltage transient-protection (OVTP) circuit to minimize output voltage overshoot when recovering from output fault conditions or strong unload transients. The device implements an internal thermal shutdown to protect the device if the junction temperature exceeds 165°C. The TPS54331 device is designed to operate in pulse skipping Eco-mode at light load currents to boost light load efficiency.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "The maximum RMS ripple current must be checked for worst case conditions. Equations are provided to calculate the maximum RMS input ripple current, peak inductor current, and maximum RMS ripple current. The selected inductor and output capacitors must meet the current and ripple current requirements. The amount of phase boost required to meet the phase margin requirement is calculated based on the output stage gain and phase loss.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      }
    ],
    "Application Circuits": [
      {
        "content": "8.2 Typical Application: This section provides a typical application schematic for the electronic component, including component values, input and output voltages, and maximum output current. It also includes figures illustrating key performance characteristics such as efficiency, load regulation, line regulation, transient response, loop response, output ripple, input ripple, start-up behavior, and output voltage range.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "8.4 Layout: This section provides guidelines for the printed circuit board (PCB) layout when using the electronic component. It discusses the importance of proper bypassing and grounding, minimizing loop areas, and component placement for optimal performance and heat dissipation. A PCB layout example is provided to illustrate the recommended layout practices.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "8.4.1 Layout Guidelines: This subsection provides detailed layout guidelines for the electronic component. It covers the proper bypassing of the VIN pin, minimizing loop areas, grounding considerations, component placement for the switching node (PH pin), heat dissipation through the ground plane, and general component placement recommendations. The guidelines aim to ensure acceptable performance and thermal management.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      }
    ],
    "Reliability and Environmental Conditions": [
      {
        "content": "8.2.2.8 Bootstrap Capacitor: Every TPS54331 design requires a bootstrap capacitor, C4. The bootstrap capacitor must have a value of 0.1 μF. The bootstrap capacitor is located between the PH pin and BOOT pin. The bootstrap capacitor must be a high-quality ceramic type with X7R or X5R grade dielectric for temperature stability.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "8.2.2.9 Catch Diode: The TPS54331 device is designed to operate using an external catch diode between the PH and GND pins. The selected diode must meet the absolute maximum ratings for the application. The reverse voltage must be higher than the maximum voltage at the PH pin, which is VIN(MAX) + 0.5 V. The peak current must be greater than IOUT(MAX) plus half the peak-to peak-inductor current. The forward-voltage drop must be small for higher efficiencies. The catch diode conduction time is (typically) longer than the high-side FET on time, so attention paid to diode parameters can make a marked improvement in overall efficiency. Additionally, check that the selected device is capable of dissipating the power losses. For this design, a Diodes, Inc. B340A was selected, with a reverse voltage of 40 V, forward current of 3 A, and a forward-voltage drop of 0.5 V.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "8.2.2.10 Output Voltage Limitations: Because of the internal design of the TPS54331 device, any given input voltage has both upper and lower output voltage limits.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      }
    ],
    "Packaging Information": [
      {
        "content": "TPS54331D Active Production SOIC (D) | 8 75 | TUBE Yes NIPDAU Level-1-260C-UNLIM -40 to 150 54331. TPS54331DDA Active Production SO PowerPAD (DDA) | 8 75 | TUBE Yes NIPDAU Level-2-260C-1 YEAR -40 to 150 54331. TPS54331DDAR Active Production SO PowerPAD (DDA) | 8 2500 | LARGE T&R Yes NIPDAU Level-2-260C-1 YEAR -40 to 150 54331. This provides information about different package types, their production status, package details like number of pins, body size, packaging method (tube, tray), and ordering codes.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "SOIC - 1.75 mm max height. NOTES: 1. Linear dimensions are in inches [millimeters]. Dimensions in parenthesis are for reference only. Controlling dimensions are in inches. Dimensioning and tolerancing per ASME Y14.5M. 2. This drawing is subject to change without notice. 3. This dimension does not include mold flash, protrusions, or gate burrs. Mold flash, protrusions, or gate burrs shall not exceed .006 [0.15] per side. 4. This dimension does not include interlead flash. 5. Reference JEDEC registration MS-012, variation AA. This chunk provides specific packaging information for the SOIC package type, including maximum height, dimensions, and relevant notes.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      },
      {
        "content": "NOTES: (continued) 6. Publication IPC-7351 may have alternate designs. 7. Solder mask tolerances between and around signal pads can vary based on board fabrication site. This chunk continues the notes related to packaging information, mentioning additional design considerations and potential variations in solder mask tolerances.",
        "part number": "1203-006618.pdf",
        "grade": "A",
        "maker_pn": "TPS54331"
      }
    ]
  },
  "part number": "1203-006618"
}