{
  "metadata": {
    "component_name": "JW5702x",
    "manufacturer": "Not specified in the given text",
    "key_specifications": "700nA ultra-low quiescent current, 0.9V to 4.5V input range, 1.8V to 5.5V output range, fixed output voltage versions available, 700mA switch peak current limit, output discharge, regulated output voltage in down mode, true disconnection during shutdown, up to 75% efficiency at 10uA load with fixed output voltage versions, up to 93% efficiency at 10mA to 300mA load, output over-voltage protection, output short protection, thermal shutdown",
    "applications": "Memory LCD bias, optical heart rate monitor LED bias, wearable applications, low power wireless applications, portable products, battery powered systems",
    "grade": "D",
    "maker_pn": "JW5702"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "DESCRIPTION \nThe JW5702x is a highly integrated synchronous boost converter with 1 μA ultra-low quiescent current. It is designed for products powered by an alkaline battery, NiMH rechargeable battery, Li-Mn battery or rechargeable Li-Ion load battery, for which high efficiency under light load condition is critical to achieve long battery life operation. \n\nThe JW5702x adopts hysteretic control topology, which obtains maximal efficiency at minimal quiescent current. It can achieve up to 75% efficiency at 10uA load with fixed output current from 3.3V to 5V conversion, and achieve up to 93% at 200mA load.\n\nFEATURES\n• 700nA Ultra-low IQ into VOUT Pin\n• 100nA Ultra-Low IQ into VIN Pin\n• 0.9V to 4.5V Operating Input Range\n• 1.8V to 5.5V Operating Output Range\n• Fixed Output Voltage Versions Available\n• 700mA Switch Peak Current Limit\n• Output Discharge\n• Regulated Output Voltage in Down Mode\n• True Disconnection During Shutdown\n• Up to 75% Efficiency at 10uA Load with Fixed Output Voltage Versions\n• Up to 93% Efficiency at 10mA ~ 300mA Load\n• Output Over-Voltage Protection\n• Output Short Protection\n• Thermal Shutdown\n• Available in CSP1.23x0.88-6 Package, DFN2x2-6 Package and SOT563 Package\n\nAPPLICATIONS\n• Memory LCD Bias\n• Optical Heart Rate Monitor LED Bias\n• Wearable Applications\n• Low Power Wireless Applications\n• Portable Products\n• Battery Powered Systems",
      "grade": "D",
      "maker_pn": "JW5702",
      "part number": "1203-000362"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The JW5702x is a highly integrated synchronous boost converter with ultra-low quiescent current of 1 μA. It is designed for battery-powered products where high efficiency under light load is critical for long battery life. The JW5702x adopts hysteretic control topology, achieving up to 75% efficiency at 10uA load with 3.3V to 5V conversion, and up to 93% efficiency at 200mA load.",
        "part number": "1203-000362.pdf",
        "grade": "D",
        "maker_pn": "JW5702"
      },
      {
        "content": "Key features of the JW5702x include 700nA ultra-low quiescent current into the output pin, 100nA ultra-low quiescent current into the input pin, wide operating input range of 0.9V to 4.5V, wide operating output range of 1.8V to 5.5V, fixed output voltage versions available, 700mA switch peak current limit, output discharge, regulated output voltage in down mode, true disconnection during shutdown, and various protection features like output over-voltage protection, output short protection, and thermal shutdown.",
        "part number": "1203-000362.pdf",
        "grade": "D",
        "maker_pn": "JW5702"
      },
      {
        "content": "The JW5702x is suitable for a wide range of applications, including memory LCD bias, optical heart rate monitor LED bias, wearable applications, low power wireless applications, portable products, and battery-powered systems.",
        "part number": "1203-000362.pdf",
        "grade": "D",
        "maker_pn": "JW5702"
      }
    ]
  },
  "part number": "1203-000362"
}