{
  "metadata": {
    "component_name": "JW5079A",
    "manufacturer": "JW",
    "key_specifications": "4V to 23V operating input range, 10A continuous, up to 95% efficiency, 500kHz switching frequency, programmable valley current limit, power good indicator, input under voltage lockout, output discharge function, output over voltage latch off protection, output short protection, thermal protection, available in QFN3X3-20 package",
    "applications": "Industrial and commercial low power system, notebook, LDO monitors and TVs, green electronics/appliances",
    "grade": "E",
    "maker_pn": "JW5079A"
  },
  "page_summaries": [
    {
      "page_number": 1,
      "categories": [
        "Product Summary"
      ],
      "content": "JW5079A\n23V/10A\nSync. Step-Down Converter\n\nDESCRIPTION\nThe JW®5079A is a monolithic buck switching regulator based on I2 architecture for fast transient response. Operating with an input range of 4V~23V, JW5079A delivers 10A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode. At light loads, the regulator operates in low frequency to maintain high efficiency and low output ripples.\nJW5079A guarantees robustness with output short protection, thermal protection, current run-away protection, and input under voltage lockout.\nJW5079A is available in QFN3×3-20 package, which provide a compact solution with minimal external components.\n\nFEATURES\n- 4V to 23V operating input range\n- 10A continuous\n- Up to 95% efficiency\n- High efficiency at light load\n- 500kHz switching frequency\n- External bypass input\n- Programmable valley current limit\n- Power good indicator\n- Input under voltage lockout\n- Output discharge function\n- Output over voltage latch off protection\n- Output short protection\n- Thermal protection\n- Available in QFN3X3-20 package\n\nAPPLICATIONS\n- Industrial and commercial low power system\n- Notebook\n- LDO monitors and TVs\n- Green electronics/appliances",
      "grade": "E",
      "maker_pn": "JW5079A",
      "part number": "1203-003901"
    }
  ],
  "category_chunks": {
    "Product Summary": [
      {
        "content": "The JW5079A is a monolithic buck switching regulator based on I2 architecture for fast transient response. It operates with an input range of 4V~23V and delivers 10A of continuous output current with two integrated N-Channel MOSFETs. The internal synchronous power switches provide high efficiency without the use of an external Schottky diode.",
        "part number": "1203-003901.pdf",
        "grade": "E",
        "maker_pn": "JW5079A"
      },
      {
        "content": "At light loads, the JW5079A operates in low frequency to maintain high efficiency and low output ripples. It guarantees robustness with output short protection, thermal protection, current run-away protection, and input under voltage lockout. The JW5079A is available in a compact QFN3×3-20 package, providing a solution with minimal external components.",
        "part number": "1203-003901.pdf",
        "grade": "E",
        "maker_pn": "JW5079A"
      },
      {
        "content": "Key features of the JW5079A include a 4V to 23V operating input range, 10A continuous output current, up to 95% efficiency, high efficiency at light loads, 500kHz switching frequency, external bypass input, programmable valley current limit, power good indicator, input under voltage lockout, output discharge function, output over voltage latch off protection, output short protection, and thermal protection.",
        "part number": "1203-003901.pdf",
        "grade": "E",
        "maker_pn": "JW5079A"
      },
      {
        "content": "The JW5079A is suitable for various applications, including industrial and commercial low power systems, notebooks, LDO monitors and TVs, and green electronics/appliances.",
        "part number": "1203-003901.pdf",
        "grade": "E",
        "maker_pn": "JW5079A"
      }
    ]
  },
  "part number": "1203-003901"
}